{"posts":[{"title":"Donald Draws——米国大统领阻挡不住的艺术梦想","text":"今天分享的 app 叫做 Donald Draws，一看这个图标就知道这是一个搞事的应用（并没有）。 要说这唐纳德川普君自从当上米国大统领以来，那是广受人民群众爱戴，米国人民在其领导下轰轰烈烈地投入了伟大的 Make America Great Again 运动。冈比亚著名哲学家沃兹·基索德曾说过，领导人带头搞艺术，国家才能兴旺。可是作为一个超级大国的领袖，川普君每日宵衣旰食 与普京通电话 治理国家，哪有那么多时间从事艺术创作呢？没关系，米国人民说，咱们开发一个 app，普通百姓涂涂画画的作品都记到伟大领袖的头上，我们每人都为他续一……咳咳，每人都来帮他创作。 总之，这个 app 就是用来帮助川普大统领创作艺术作品的，至于成果如何就要靠大家的自由发挥了。据最新一版的更新说明该 app 已登陆 ios 平台，现在人人都能参与建设美国梦了，赶快下载吧⇓⇓⇓！ 下载地址","link":"/2017/02/16/Donald%20Draws%E2%80%94%E2%80%94%E7%B1%B3%E5%9B%BD%E5%A4%A7%E7%BB%9F%E9%A2%86%E9%98%BB%E6%8C%A1%E4%B8%8D%E4%BD%8F%E7%9A%84%E8%89%BA%E6%9C%AF%E6%A2%A6%E6%83%B3/"},{"title":"简明安卓刷机准备流程","text":"要说安卓与 ios、wp 等系统相比最大的特点那就是高度的自定义化，用户通过一系列设置能够随心所欲地对自己的手机进行设置。这篇文章就简单地谈一谈安卓通用的刷机前期准备流程。 注意：由于不同型号手机各自的特殊性，并不存在一种适用于所有手机的方法或工具，因此这里只会涉及各步骤的原理，至于所需要的具体工具，请到各自品牌的论坛查询，如MIUI论坛等，或者是直接前往国外的 xda 论坛——这才是真正大神云集的地方，诸如 TWRP、SuperSu 等都是在这里发布再被转载到国内的。 零、设置开发者选项之前把这段漏了……因为手机到手后就打开了再也没关过，所以没想起还有这步。 首先打开设置-关于手机，连击7次版本号打开开发者选项，然后退回到上级菜单，进入开发者选项，将OEM解锁和USB调试都打开，否则是无法刷机的。 一、解锁 BootLoaderBootLoader 与电脑的 BIOS 类似，是在系统启动前进行硬件初始化，获取内存大小信息等，调整手机到适配状态等工作的一段程序。这种非常底层的东西自然十分重要，大部分厂商都会为其加锁。而为了后续操作，我们有必要对其进行解锁。解锁的方法多种多样，许多论坛如著名的移动叔叔都提供工具箱一键解锁，不过我更建议按照 xda 上 TWRP 发布者的教程来解锁。 二、刷入第三方 RecoveryRecovery 常简称 rec，是安卓的一个恢复系统，类似于 Windows 的 pe，可以在关机状态下通过同时长按电源键和音量减来进入。手机出厂时就自带官方 rec 了，不过无法刷入任何非官方包，因此需要刷入第三方 rec。第三方 rec 主要有 CWM 和 TWRP，两家曾经成分庭抗礼之势，不过 TWRP 由于支持触摸操作等原因而在最近渐渐超越了 CWM，更为流行，并且自从 3.0.0-1 后原生加入了简体中文支持，国内用户也不再需要去找各种中文版了。 以站长的一加 3 为例，这里给出 xda 上的 TWRP 贴子，可以看到都是非常简单的英文，只有少量的安卓术语，不过也都是刷机过程中的常见词汇，极易掌握。 这里特别给出安卓主要版本的中英文代号，以防下载了错误的工具版本： 7.x: Nougat(N) 牛轧糖 6.x: Marshmallow(M) 棉花糖 5.x: Lollipop(L) 棒棒糖 4.4.x: KitKat(KK) 奇巧巧克力 更古老的安卓版本现在很少见了，因此也就不展开描述，若有需要请参考维基百科。 另外还需注意的是，一些手机可能存在特别情况，如站长的一加 3 在刷入第三方 rec 后会触发 dm-verity，需要有一些特殊处理。在 xda 上通常会有说明，请仔细阅读，并严格按照上面的流程操作。 三、root是否 root 其实是一个见仁见智的问题。root 后，顾名思义，用户就能掌握系统的最高权限（根权限），能对系统进行任意修改。然而，一旦有害应用诱导用户给自己授予了 root 权限，它就能够对你的手机为所欲为。前不久才发生了有人修改的绿色守护获取权限后伪装成微信诱导用户输入支付密码，造成财产损失的事件。因此，是否 root 以及 root 后是否给应用授予权限，需要慎重考虑。 至于 root 方法，也是种类繁多。Kingroot 之流有后台安装其他软件的流氓行为，而曾经绝对的老大 SuperSu 几个月前被一个传闻来自中国的神秘公司收购，让许多重视隐私的用户深感担忧，毕竟国内互联网公司算得上是劣迹斑斑，而将 root 权限这么重要的东西交予国内公司实在令人难以放心。因此，这里介绍一个新型的 root 方法：Magisk。 其实将 Magisk 当作 root 方法完全是大材小用，它的最初目的是在不修改 /system 文件夹的情况下达到修改的效果，root 只是产生的一个附带功能，因为传统的 root 是修改 /system 中的文件。另外，Magisk 完全开源，其安全性可以放心。刷入 Magisk 的方法是通用的，详情请参考上面给出的 xda 链接，这里只做简单的介绍： （建议）备份 boot.img（在第三方 rec 中操作）； 下载最新版 Magisk 的卡刷包，放入手机根目录； 如果想要使用 SuperSu，以Systemless 模式刷入 SuperSu（只支持安卓6.0以上）；否则跳过这步； 刷入 Magisk.zip； 重启，安装最新版 Magisk Manager。 值得一提的是，Magisk 的作者 topjohnwu 是来自台湾的学生，算是 xda 上难得的中国开发者，它的脸谱标志也极富中国韵味。关于 Magisk 的其他应用，之后站长会专门写一篇介绍。 至此，你的手机已经完成了搞机的准备工作，胆大心细地去研究安卓吧！最后给出几个有用的参考： xda论坛：一切技术的源泉。 酷安：站长对于安卓的一切知识几乎都来自酷安。酷安正在经历改版，社区化的应用市场定位很适合交流技术，不过老用户也产生了劣币驱逐良币的担忧。希望新加入酷安的萌新不要成为劣币。 wuxianlin：吴大，国内著名大神，分享了很多针对一加、oppo、flyme 等的定制工具。 一只萌新：不要脸。咳咳，有什么问题尽管在评论里问，站长会尽力解答的​~","link":"/2017/02/19/%E7%AE%80%E6%98%8E%E5%AE%89%E5%8D%93%E5%88%B7%E6%9C%BA%E5%87%86%E5%A4%87%E6%B5%81%E7%A8%8B/"},{"title":"小白浅谈Xposed与Magisk","text":"前一篇文章说要介绍 Magisk，想了想干脆把 Xposed 一起介绍了吧。 Xposed 无疑是站长接触安卓以来见过的最强力的东西，曾经为了使用它而坚决不上 7.0（虽然后来还是叛变革命了）。Xposed 框架由 xda 大神 rovo89 开发，通过替换安卓系统 /system/bin 目录下的文件，实现对系统某些功能的接管，进而给予基于 Xposed 框架开发的 app（Xposed 模块）更多权限。用户可以通过安装模块深度定制自己的安卓系统，实现诸如 qq、微信防撤回、为单独应用修改 dpi 或语言、强行阻止毒瘤常驻后台等功能。具体的实现原理萌新站长也不是很明白……感兴趣的读者还请自行搜索，反正我是没看懂（懵逼.jpg）。 刷入 Xposed 的过程与之前介绍的刷入 Magisk 类似，都是先在第三方 rec 刷入 zip 包（卡刷，区别于刷第三方rec时的线刷）再安装启动器，不过需要注意的是 Xposed 框架不自带 root，需要先 root 后再刷。既然 Xposed 本身就会修改 /system，因此选择 root 也无须选择 systemless 模式，使用 SuperSu就好，最新版的 xda 链接在此，如果对被收购后的版本不放心，也可以选择被收购前的最后一版 v2.76。 当然，这种深度介入系统的行为必然伴随着风险。装上Xposed框架后有时会面临着无法开机的情况，这个时候就需要卡刷卸载包了。话不多说，安装包和卸载包在这里下载： https://dl-xda.xposed.info/framework/ 注意，下载时请选择对应的版本，安卓 5.0 是 SDK21，5.1 是 SDK22，6.0 是 SDK23，7.0 是 SDK24，7.1 是 SDK25，8.0 是 SDK26，8.1 是 SDK27， Xposed 暂不支持 8.0 及以上的版本。另外，还需根据自己手机的 CPU 选择正确的 arm 或 x86 版本，若不清楚请自行搜索或在评论里询问站长。卸载包不分安卓版本，只要选择正确的 CPU 版本就好。 不愿意修改 /system 文件夹的玩家怎么办呢？Magisk 就在这时横空出世了。通过站长还是看不明白的原理，Magisk 能实现在不修改 /system 文件夹的情况下深度定制系统的效果。并且，Magisk 自带开源的 root，不需要再去特意 root。并且，rovo89 配合 Magisk 作者 topjohnwu 开发了基于 Magisk 的 Xposed 框架，应该是能支持所有的 Xposed 模块，有兴趣的玩家可以自己尝试。 Magisk 的 xda 链接在此，上一篇文章里也有介绍，这里就不废话了。 总之，Magisk 相对来说上手难度较低，也比较安全，建议有兴趣的读者先尝试一下这个玩法。不过 Xposed 的可玩性目前来说是无人能及的，有时间精力的朋友可以大胆地尝试，你会发现一个神奇的新世界。 最后，Xposed Manager 和 Magisk Manager 酷安都有下载，这里就不贴地址了。","link":"/2017/02/22/%E5%B0%8F%E7%99%BD%E6%B5%85%E8%B0%88Xposed%E4%B8%8EMagisk/"},{"title":"幸灾乐祸地放两张图","text":"AMD 的 Ryzen 处理器于近日发布，网上一片农企翻身的声音。确实，这次来势汹汹的 AMD 把万年牙膏厂英特尔打懵了，被迫全线降价，大快人心。 站长家里 14 年初配的台式，CPU 是 Haswell 架构的 4570，历经 Haswell-Refresh, Skylake, Kaby Lake 这 2.5 代而毫无更换的冲动，坐看其挤牙膏。想当初，站长大学的第一份作业便是《论摩尔定律的失效》，当时对英特尔的挤牙膏行为深恶痛绝，对 AMD 推土机的孱弱也无可奈何。没想到寒假快结束时农企一仗翻身，可喜可贺。如果英特尔拿不出对应的表现的话，下次换机站长就准备搭 3A 平台了，毕竟现在显卡已经是农企的 390。 感兴趣的读者还可以去看看卡吧的这篇贴子： https://tieba.baidu.com/p/4999052815。本来还想把这里的图也贴上来的，但是因为懒为了节省带宽就不放了，还请自己观看。","link":"/2017/02/27/%E5%B9%B8%E7%81%BE%E4%B9%90%E7%A5%B8%E5%9C%B0%E6%94%BE%E4%B8%A4%E5%BC%A0%E5%9B%BE/"},{"title":"火车纪行","text":"我是很喜欢火车的。不是动车，只是老旧的前拉后推式火车。 在各式交通工具如此发达的现代，这话显得很不合时宜。高速如飞机，灵活如汽车，就连火车本身，也在逐渐为高铁动车所取代。如今，KTZ 字头的列车，给人的印象大约只剩逼仄，拥挤，喧嚣，混杂着方便面和其他的味道，更遑论纯数字编号的车次了。 可是，正是这老旧的火车，开启了一个伟大的时代。它是人类迈入工业社会最原始、也最持久的见证。 自 6000 年前轮子出现在新月沃地，直到 200 年前火车在不列颠的土地上开始咆哮，人类的交通工具久未发生质的变化。马车带来了赫梯帝国的征服，牛车象征着日本平安时代的繁华。然而，无论何种畜力，拉着历史前进数千年后，残存的力气已不足以应对地理大发现后宏大的世界。煤，蒸汽，机械，这些令人心旌摇曳的词语，在这时共同催化出一只咆哮的钢铁怪兽——蒸汽机车。时代发展，火车的动力逐渐由蒸汽变为燃气，再由燃气变为电力。不变的，则是碎石、枕木和跳上火车在窗前看远山渐近的那份无忧无虑。 相比之下，飞机起飞降落的时候的确是激动人心，可巡航时无边无际、千篇一律的蓝白之色实在令人绝望。而汽车，起起停停左摇右摆之间，难免令人眩晕；若是自己驾车，更是要将绝大部分精力投入与他车的关系中。由此看来，这也不是最佳的旅行方式。至于高铁，近年来已成为国家的骄傲，一张对外展示的光鲜名片。可它的速度实在太快，快到来不及看清窗外的风景。因此，高铁上人手一部手机或者平板才是常态，而很难想象乘客在其上细细品味风景。试看，从西伯利亚到挪威峡湾，有哪条观光铁路能达到每小时三百千米呢！ 慢慢行使的火车，则自有其特别的魅力。以我所乘的 Z50 为例吧，在春天从西南北上的路途中，有丘陵间谷地中连绵的油菜花田，其中点缀着几株淡粉色的樱花或白色的梨花，飘升着暧暧的炊烟；有七百里绝壁和绝壁上生生凿出的幽暗的隧道；有入夜后一座伴水而生的城市的万家灯火和扬子江中点点星光；若你起得足够早，向西边车窗外望去，地平线上更有可遇不可求的维纳斯带散发着女神的光辉。 火车之旅是无忧无虑的。登上待发的列车，两条铁轨好似伸向无尽的远方。不必担心路上有什么状况，不必怀疑能否抵达目的地，只消往窗边一坐，平米见方，便能提供足够广阔的视野，足以观察百态人情。 提到人情，车厢内更是有趣的地方。几十位毫无交集的旅客，被命运聚在一起，坐在车厢的一角，便能观察到许许多多的故事。这儿，有想捉住四处撒欢的女儿为她梳头的母亲；那儿，有叽叽喳喳，左顾右盼，充满活力和自信的少女；在窗边，有始终坐在同一位置的小哥，沉默而忧伤；走道上，有难耐旅途无趣的大叔，来来回回想要寻人加入牌局……被命运抛在狭小的空间内，人们刻意保持在陌生人面前的礼貌，而只属于自己的铺位则又给予了一种归属感与安全感。拘谨与天性，在窄窄的车厢内达到了一种微妙的平衡。 写到这里，我的旅程也接近终点了。当初离开时还是一片荒芜的田野，已被春天用她绿色的火焰点起燎原之火。不变的，是田间蜿蜒的火车，和车上的人。","link":"/2017/03/02/%E7%81%AB%E8%BD%A6%E7%BA%AA%E8%A1%8C/"},{"title":"Adobe系列破解利器——AMTEmu","text":"Adobe 系列软件因为功能强大而在很多人生活中是不可或缺的，其价格也十分对得起功能，只是对于个人用户、尤其是学生而言，就显得很不友好了，所以在使用过程中很多人难免会去找破解版。然而，网络上各色人等自制的修改版在安全性方面多少有些让人不放心，并且也不知道是否会打着精简的旗号删改一些有用的东西。因此，最好的办法还是下载原版软件+广受认可的专门破解工具。下面介绍的就是来自毛熊国 Ru-Board 论坛的 painter 大神的工具，AMTEmu。 AMTEmu 通过某种站长也不明白的原理，针对 amtlib.dll 进行破解，从而达到欺骗 Adobe 验证机制的效果。长长的支持列表包括： Adobe Acrobat DC Adobe Acrobat XI Adobe Acrobat X Adobe After Effects CC 2017 Adobe After Effects CC 2015.3 Adobe After Effects CC Pre-release Adobe After Effects CC 2015 Adobe After Effects CC 2014 Adobe After Effects CC Adobe Animate CC 2017 Adobe Animate CC 2015 Adobe Audition CC 2017 Adobe Audition CC 2015.2 Adobe Audition CC 2015 Adobe Audition CC 2014 Adobe Audition CC Adobe Audition CS6 Adobe Audition CS5.5 Adobe Character Animator Adobe Dreamweaver CC 2017 Adobe Dreamweaver CC 2015 Adobe Dreamweaver CC 2014 Adobe Dreamweaver CC Adobe Dreamweaver CS6 Adobe Dreamweaver CS5.5 Adobe Dreamweaver CS5 Adobe Dreamweaver CS4 Adobe Flash Pro CC 2015 Adobe Flash Pro CC 2014 Adobe Flash Pro CC Adobe Flash Pro CS6 Adobe Flash Pro CS5.5 Adobe Flash Pro CS5 Adobe Illustrator CC 2017 Adobe Illustrator CC 2015.3 Adobe Illustrator CC 2015 Adobe Illustrator CC 2014 Adobe Illustrator CC Adobe Illustrator CS6 Adobe Illustrator CS5.5 Adobe Illustrator CS5 Adobe Illustrator CS4 Adobe InCopy CC 2017 Adobe InCopy CC 2015 Adobe InCopy CC 2014 Adobe InCopy CC Adobe InCopy CS6 Adobe InCopy CS5.5 Adobe InCopy CS5 Adobe InDesign CC 2017 Adobe InDesign CC 2015 Adobe InDesign CC 2014 Adobe InDesign CC Adobe InDesign CS6 Adobe InDesign CS5.5 Adobe InDesign CS5 Adobe Media Encoder CC 2017 Adobe Media Encoder CC 2015.3 Adobe Media Encoder CC 2015 Adobe Media Encoder CC 2014 Adobe Media Encoder CC Adobe Muse CC 2017 Adobe Muse CC 2015 Adobe Muse CC 2014 Adobe Photoshop CC 2017 Adobe Photoshop CC 2015.5 Adobe Photoshop CC 2015 Adobe Photoshop CC 2014 Adobe Photoshop CC Adobe Photoshop CS6 Adobe Photoshop CS6 Pre-release Adobe Photoshop CS5.5 Adobe Photoshop CS5 Adobe Photoshop CS5 Pre-release Adobe Photoshop CS4 Adobe Lightroom CC (with Dehaze feature) Adobe Prelude CC 2017 Adobe Prelude CC 2015.4 Adobe Prelude CC 2015 Adobe Prelude CC 2014 Adobe Premiere Pro CC 2017 Adobe Premiere Pro CC 2015.3 Adobe Premiere Pro CC 2015 Adobe Premiere Pro CC 2014 Adobe Premiere Pro CC 使用方法： 先以试用方式安装 Adobe 软件，然后在 AMTEmu 里选择需要破解的软件，单击 Install，找到软件安装目录，双击 amtlib.dll 即可。 站长试图找到 painter 的原帖，结果大概因为该论坛是俄语的缘故，查找许久也一无所获。后来翻到了 painter 的推特，在里面找到了原帖，可是无法打开，翻译一下大概是游客无权查看……总之，原帖打不开的情况下就只好在国内论坛找到了转载的下载地址： win版：http://ftpportal.tk/PainteR/ru-board/CC/amtemu.v0.9.2.win-painter.zip mac版：http://ftpportal.tk/PainteR/ru-board/CC/amtemu.v0.8.1.mac-painter.dmg 注意：据转载，原帖为 mac 用户列出了如下一段话： I had no time to implement the elevation request. That’s why you need to use sudo when you have no sufficient privileges to modify the apps folder. Otherwise you will need to create configs and copy emulator’s files manually. 谷歌机翻一下是： 我没有时间实现高程请求。 这就是为什么当您没有足够的权限修改应用程序文件夹时，您需要使用 sudo。 否则，您将需要手动创建配置和复制仿真器的文件。 在这之下列出了几段命令，应该是解决方式： Last login: Mon Oct xx xx:xx:xx on consoleUser:~ user$sudo /AMTEmu.app/Contents/MacOS/AMTEmu 站长从未使用过 mac 设备，手边也没有可供测试的机器，所以 mac 用户还需自测。 若是觉得国外链接速度太慢，可下载站长上传的网盘版本： 下载地址 最后要说的是，使用盗版不是什么光明正大的行为，在财力无法支撑时默默使用就好，若以后有能力，还希望能够支持 Adobe 公司。毕竟，这些软件真的对得起它的价格。","link":"/2017/03/03/Adobe%E7%B3%BB%E5%88%97%E7%A0%B4%E8%A7%A3%E5%88%A9%E5%99%A8%E2%80%94%E2%80%94AMTEmu/"},{"title":"凑点字数","text":"开通转载板块后，突然发现了一条轻松发布内容的方式。一边提交转载申请，一边把文章保存到本地，待一拿到申请就发布文章，省时省力。转载的文章还都有三五千字，自己写的从来没有这么多。 开学前定下的目标是，在学校里没事就写写博客，预计的产出应当颇丰。然而，无论是课程还是社团之类的琐事，占据了意料之外的大把时间。再加上长期的敌人懒惰作祟，借新设转载板块的名义更加不想自己写了。 昨天参加了我们院足球队这学期的第一次训练。曾经绝对的大腿、我的大四舍友 W，因为实习而很难再在这学期参加什么比赛了。不由想到再过半年，或许就再也见不到很多半年前才认识的人了。感觉新生报到的日子才刚过去，似乎还能嗅到北京夏日绿荫的气息，忽然之间一年就这样飞也似的过去了。好在春天快来了，昨天专程去学校另一边看的玉兰花快要开了。正是最美好的季节，无论做什么，都怀有很高的兴致。那么博客，也是应当多写写了。诗酒趁年华。现在不做，更待何时呢？ 不知所言，便且当作凑字数的一篇吧。","link":"/2017/03/15/%E5%87%91%E7%82%B9%E5%AD%97%E6%95%B0/"},{"title":"南国之春","text":"春天来了。 离家北行的路上，便已经能看到稀疏的油菜花田。一晃半月过去，春风的声音是越来越清晰可闻。宿舍楼下的玉兰树已经含苞待放，毛绒绒的甚是可爱。也许是品种或光照的原因，学校另一头的玉兰更是已经盛开。一转角，好几棵整整齐齐的树突然闯进你的眼里，没有一片杂叶，全是干干净净洁白如玉的花朵，密密麻麻绽放在细细的枝头，让人怀疑这样一株小树怎么能盛起如此多的花朵。背景是我一直很喜欢的红砖墙，白与红，繁茂与平展，温柔与粗粝，重重对比间，自有一种安稳的欣喜。 说来惭愧，长久以来不辨草木的我，直到去年秋天才算真正认识了玉兰。可是，春风的另一种信物——柳，我确是自小熟识的。小时候母亲常带着我前往小城外的河边，沿河的一排垂柳在春风中流动的画面，构成了我对春天最初的记忆。杨柳依依。春在我的记忆中，始终是柔软而湿润的。 相比之下，北方的春是盛放而激烈的。一夜春风来，地里生出了嫩芽，枝头吐出了新花，春放肆地对世人宣告着她的到来。经历了一冬的干枯，土地和树木都无法再忍耐自己单调的褐黄，迫不及待地展现出最美的姿态。在这里冬春交替迅疾而热烈，仿佛在一夜之间就已完成，忽地生出的大朵春花让人有从浑噩中复活之感。 可是，这不是我记忆里的春的样子啊。前些日子看到了这样一张图，青城山的春色。在那对世界遗产的组合中，似乎都江堰总是更出名的一个，可毕竟“青城天下幽”，这里的山色确实撩人。 身处亚热带常绿阔叶林区，青城是被绿意宠爱的。春去秋来，这里好似不曾被季节所影响，始终是幽幽的绿。只有长居于此的人，才能分辨出细微的不同。冬季少雨，叶饱满的绿被浮尘遮掩，转向深沉；青苔也有些失去了水分，泛起些白意。直至春的到来，雨水落，溪水涨，树抖落浮尘，把根扎得更深些；石上清泉梳洗着旧苔，新苔也趁此机会蔓延。新绿实在是世上最可爱的颜色。 又是一年。去年此时节，我正做着高考前最后几个月的准备。每天埋着头，偶尔瞥见窗外新发的银杏便觉得是无比幸事。在蜀地长居十余年，觉得无边无际的绿色由水润到深沉的循环实在是太正常不过。如今才知道，各地气候差异之大，连春的可爱也各自不同。春色之美，本没有高低之分，但一个人心中总有所熟悉而无法忘怀的一种。古有秋风起思莼菜鲈鱼，今有春风起思潺潺水声。","link":"/2017/03/24/%E5%8D%97%E5%9B%BD%E4%B9%8B%E6%98%A5/"},{"title":"书格——每个人都能自由地看到我们的文明","text":"书格是站长前些日子发现的一个致力于古籍数字化的网站。在这里摘抄一段它对自己的介绍： 书格（Shuge.org）是一个自由开放的在线古籍图书馆。致力于开放式分享、介绍、推荐有价值的古籍善本，并鼓励将文化艺术作品数字化归档。分享内容限定为公共版权领域的书籍（参照标准伯尔尼公约）；我们最大限度地还原书籍品貌、内容；借此计划让大家自由、免费地欣赏到那些难以现世的书籍。让大家能从中感受到人类文明进程。 简而言之，这里有超过 1000 本高质量的古籍资源，格式以 PDF 为主，总量达到 420 G +。在拥有如此庞大资源的同时，书格开放的态度更令人肃然起敬。作为个人站长，尽管时间不长，我也知道一些独立运营非盈利性网站的难处。而书格这样一个工作量极大的网站，自创始起便一直靠站长未曾一人维护，并且坚持非盈利的理念，没有任何收费或商业性广告。与此同时，网站本身也做得非常优秀；相对地，一只萌新花费了站长大量时间精力去优化仍然只是这个效果，可以想见未曾为书格本身投入了多少。“伟大”是一个很重的词，但我想将它用于形容书格和它的站长，都再恰当不过。 最后想说的是，书格右上角有方便的捐赠链接，从开销列表看网站光是每月固定的服务器费用就达到 700 左右，况且还有不固定的其他开销。因此，若是能力所及，还希望受惠于书格的朋友或多或少捐赠一些。毕竟，这个网站和它背后的理念能走多远，很大程度上都掌握在我们每个人手中。","link":"/2017/03/30/%E4%B9%A6%E6%A0%BC%E6%AF%8F%E4%B8%AA%E4%BA%BA%E9%83%BD%E8%83%BD%E8%87%AA%E7%94%B1%E5%9C%B0%E7%9C%8B%E5%88%B0%E6%88%91%E4%BB%AC%E7%9A%84%E6%96%87%E6%98%8E/"},{"title":"鞋带","text":"今天一个人走路去操场刷锻，来回一公里不到的距离，鞋带散了三次。每一次都习惯性的向前甩一甩脚，似乎这样就能避免踩到鞋带，也能就这么”跛”着走回去。 但最终还是放弃了，大衣往身前一夹，蹲下身系鞋带。初中一个同学嘲笑过我，是我系鞋带的方法不对，还教给我一种又快又好的系鞋带的招数，但我究竟还是没记住，不然也不会在路上五步一蹲。 最后一蹲，是在宿舍附近的足球场边，为了躲避来往的自行车，我躲进了最角落的绿化边上，按照老方法系好，起身，突然就想起了刚进初中那天，也有一个关于鞋带的故事。 我的初中离我家还有半小时车程，于是只好选择住校。不，这里的只好其实不尽恰当，因为在这之前的好几年，我还都一直向往着住校生活，想象没有爸妈管，不用听唠叨，跟同学每天见面吃饭聊天八卦的生活。这种自由，对于我这个从小生活在当过小学老师，绰号是“铁匠”的妈妈的阴影下的小孩儿来说，简直是想都不敢想的，至于我家的传统程度，从保留至今的家谱和家规可见一斑。 总之我的初中对于那时候的我来说，简直是再满意不过，以至于一开学就要到军区军训这种事，都觉得可能是令人愉悦的。 至于那一天，跟所有夏季学期开学的日子一样，盆地的闷热到了极致，太阳也总是不明晃晃的，而只是像被一层水雾蒙住了，不很明显。就是这样一天，我拎着箱子背着包，要从后门出去，坐马路对面停着的大巴，开始我的”征程”。此时后门已经停满了载学生的大巴，还有舍不得儿女在后门张望的若干父母。当然我爸妈那时已经回家了，他们向来不会这样明显地表露任何情感。 正当我提着大箱子歪着身子过马路的时候，鞋带不合时宜的散了，而且是两只。但此时我已走到路中央，两手都腾不开，所以索性不管它，像我之前说的那样，迈步的时候把脚抬得高高的，以防自己把自己给绊倒了。这姿势颇有些像俄罗斯士兵的正步。正当我如此好笑地想着，一个个子不高的阿姨冲到了我的面前，年纪跟我妈差不多大，想来肯定是来送孩子的。她冲着过来，用极重的乡音说“等等等等等等，阿姨给你把鞋带栓上”，说着就要俯身，我急坏了。从小就被教育着自己动手，爸妈不是你的奴役，如此种种，我跟我的父母甚至是从小学二年级开始，就让我自己上下学，大概也是从那个时候开始，我跟父母上街，也从来不会挽手或者是牵着手走了。所以我急坏了，这种亲密行为让我甚至有些不适，让母亲辈的人给我系鞋带，我觉得我跟古时那种大不孝的浪子没什么区别。在那个档口，我当然慌张地拒绝了那位阿姨:“阿姨不用了，我马上上车了，上车了再系也行，这样太不好了！”无奈我空不出手，那位阿姨已经蹲下，手已然碰上了我散开的鞋带，我只好作罢，浑身难受地“享受”这特殊的待遇。阿姨系着系着，又开始咕哝:“这个学校也是，娃儿才开学就去军训，还弄得那么着急，鞋带儿散了都没办法栓！”我低头看着这位阿姨，嗯，一点也不像我的母亲，她身材小小的，头发烫卷了，扎成低马尾，就这么一个中年女人，却让我想到我已经在家中的母亲。 这位阿姨可能在门口张望了很久，可能没看到自家的孩子，可能正很失落，也可能就在这时候看到一跳一跳提着大箱子走得踉跄的我，想到了自己那个还没长大，还没离家那么久过的孩子。我盯着她，几乎是快要哭出来，这种令人有些尴尬的好意，我竟然也能感受到。离家的喜悦已经消散得差不多，更多的是对我家那两位并不善言辞，十分“严肃”的大人的想念。想念这个词我用得很慎重，因为对于我们家来说，这种词语属于”太过肉麻不可能说出来”一类。 阿姨系好了鞋带就离开了，她其实还说了几句话，但我已经记不清了，只是看着她埋下去的头顶觉得感动，和心酸。心酸她在校门外顶着热度就为看孩子一眼，也心酸我这没出息的，像是没有父母疼一样，这么一件小事也能想到那么远。 可能有人不太能够理解这种感触，但于我而言，我确是真切的通过这件事，理解了我那旁人看来不够亲近的父母，即使他们当时可能正在家里吃着饭吹着空调摆谈着”这下子有机会锻炼这些个没吃过苦的娃儿了！”","link":"/2017/03/26/%E9%9E%8B%E5%B8%A6/"},{"title":"使用油猴脚本破解百度网盘限速","text":"几年前百度网盘刚出现时，凭借经常的活动和优秀的服务吸引了一大批用户，可以说坐稳了国内网盘的头把交椅，尤其是在 360、微云等国内网盘相继停止服务后，百度网盘可以说是几年前国内网盘时期热硕果仅存的产品。然而，做大之后它也逐渐显示出百度公司的本色，从大于 2G 文件强制使用百度网盘客户端到现在数 M 的文件就无法直接下载，从慢慢开始限速到现在有时丧心病狂地限速十几 KB/s，百度的吃相越来越难看，这一切无非就是逼迫用户购买超级会员。当然，不是说百度应该做慈善，网盘服务成本确实很高，但其一，国内与国外网盘逻辑不同，百度网盘并未真正给用户 2T 空间；其二，再没有别家网盘用过限速到十几 KB/s 这样丧心病狂的手段。百度想做中国的谷歌，却又不像 Google Drive 一样通过出售储存空间赚钱，反而弄些限速的幺蛾子。如此种种，自然让人很不开心，于是就有了以下的破解方法。 首先，我们需要安装一个扩展 Tampermonkey，中文俗称油猴。目前油猴已经支持 Chrome，Edge，Firefox，Safari 等一众浏览器，同时也应该支持类似于 360 极速浏览器的基于 Chromium 的浏览器。以 Chrome 为例，可直接在 Chrome 应用商店下载或者在官网下载后将 crx 文件拖入 Chrome 扩展程序页面安装。 油猴相当于一个平台，实际发挥作用的是依托这个平台的各个脚本。脚本下载网站很多，站长常用的是 Greasy Fork。在这里找到脚本百度网盘直接下载助手并安装，之后在百度网盘选择一个文件后就会出现下面的页面： 可以看到，上面一栏最右边多出了个下载助手，里面有直接下载、API 下载和外链下载三项，其中有可以选择批量下载。至于哪种模式最快，不同地区和网络都不一定相同，这就需要自己尝试了。 最后，站长个人推荐使用 IDM 作为平常的下载器，一般情况下都能跑满带宽，不像迅雷之类也存在限速现象。不过这是一个付费软件，终身单设备许可大概是 80 多元的样子，在 IDM 吧里有破解版，如果感觉好用不妨购买。","link":"/2017/04/04/%E4%BD%BF%E7%94%A8%E6%B2%B9%E7%8C%B4%E8%84%9A%E6%9C%AC%E7%A0%B4%E8%A7%A3%E7%99%BE%E5%BA%A6%E7%BD%91%E7%9B%98%E9%99%90%E9%80%9F/"},{"title":"【多图】记一次让人生无可恋的排队","text":"前两天趁着清明去了一趟国博，最大的感受便是绝对不要在公共假期去北京任何有名的景点，否则迎接你的就是让人崩溃的队伍。国博目前的特展，“大英博物馆 100 件文物中的世界史”，自 3 月初延续到 5 月底。本以为开展已逾一月，慕名参观的游客应该少了很多，没想到还是低估了人民群众的热情。从下地铁到进入展厅，一共排了五次队，共计两个多小时。 本来我是极不愿意排队的，过去常有想去某个地方但见到长长的队伍转身就走的不良记录。不过这次的展览实在符合我的胃口，所以也放弃原则排起了队。但胸中积怨，干脆写篇文章吐槽一下，顺便放些看到的展品，给没有去过的朋友一些参考。最后，由于展厅不允许拍照，展品的照片均来自互联网。说实话，去博物馆参观大型展览的时候没有必要拍照，看到有趣的藏品记下中英文名回来一搜，得到的图片比自己在昏暗灯光下隔着玻璃拍的好很多。 绳文时代，指日本公元前 14500 年到公元前 300 年前后的时期。这件陶器为篮子形，上有绳索印出的纹路。后于 19 世纪被内部漆金，成为茶道用具。 发现于希腊喀帕苏斯岛的这件藏品是大英博物馆所藏最古老的古希腊雕像。它的特殊形状或许暗示其与女性生殖有关。 发现于伊拉克南部苏美尔人城市乌尔。被挖掘时竖琴木制部分早已腐烂，这是考古学家修复后的样子。牛头上牛角也是现代制品，而胡须、头发和眼睛这是原件。牛头下方的几幅图案也很有趣。 泥板从右向左、由上至下阅读，罗列了一群工人的食物配给。 同样用楔形文字书写，“大洪水”记录板记录了世界文学史上第一部伟大史诗《吉尔伽美什史诗》的一章，讲述了与《圣经》中诺亚方舟极为相似的大洪水的故事。 这是件非常精美的饰品，发现于威尔士。项圈末端有美丽的几何花纹，不过在现场看到的不如此处清晰。 拉美西斯二世大概是最著名的埃及法老之一。头顶的双王冠象征统一的上埃及和下埃及，手中的连枷和钩子象征着至上的王权。 浮雕板上是在亚述国王卫队服役的士兵，来自于帝国各地。从发型和衣服来看，左侧的弓箭手是阿拉米人，右侧持矛者则来自黎凡特。 阿马拉瓦蒂大佛塔始建于印度孔雀王朝阿育王时期，但大部分雕刻是在公园 1-3 世纪新增的。这件石板表现了守护佛塔的五头蛇和狮子。 密特拉是一个古老的印度-波斯神祇，后来该信仰受到基督教迫害。在这座雕像中，密特拉正用剑杀死一只公牛，一条狗和一只蛇在舔舐流出的鲜血，而一只蝎子在攻击牛的睾丸。 这只非常逼真的青铜手是献给前伊斯兰时代一位也门地区神灵的供品。从高度逼真和折断小指看，它可能是用真人的手铸模建成。 银盘描绘了持剑刺杀牡鹿的萨珊国王沙普尔二世。牡鹿由于破环庄稼而被看作混乱的象征，因此沙普尔二世在这里便被描绘成了秩序的守护者。萨珊帝国的国教是琐罗亚斯德教，即著名的拜火教或祆教。尽管如今只是一个伊朗的小宗教，但琐罗亚斯德教是第一个将教义用文字记录下来的宗教，对基督教、犹太教和伊斯兰教都产生了巨大的影响。 公元 150 年前后，佛陀开始以人的形象出现。佛陀巨大的耳垂象征了对财富和权势的拒绝，因为他出生高贵，出家前习惯佩戴沉重而昂贵的耳环，但当他为了追求更高的觉悟和启迪而出家后，就主动摘下了象征俗世荣华的耳环。 唐三彩，不需要介绍太多了吧……近距离看真的很美。 很有趣的一组展品，来自秘鲁。莫切人可能是在南美洲第一个建立准国家的民族。实际展出的藏品不是这些，多了几个少了几个。 这尊雕像表现的是一位导致妇女难产而死的恶灵。阿兹特克人认为，死于生产的妇女与战死的男子同样可敬。雕像头部的符号是阿兹特克历法的一个日期，在这一天及接下来的 13 天中，这个恶灵尤为危险。 羊驼作为唯一原产美洲的大型家畜，对印加文明来说极其重要。这种羊驼塑像常常和真羊驼一起献祭给神灵，一起献祭的还有上层社会的孩子。西班牙人抵达南美后，熔解了大量黄金，导致留存的印加金器极为稀少。 圣尤斯塔斯是罗马皇帝图拉真的一位将军，因为信奉基督教而与妻子孩子一同被烧死。这个华丽的圣物匣内藏有一个木制核心，中有尤斯塔斯的头骨碎片和其他骨头。 这种仪仗被称为 alam，用于纪念殉道者。这把 alam 长柄上至少出现了 8 次阿里的名字，同时也刻有 10 位伊玛目的名字。将 alam 用于游行的传统可追溯到伊朗萨菲王朝阿拔斯一世统治时期。在他的统治下，尽管什叶派伊斯兰教是国教，但犹太教徒和基督教徒同样被允许生活在首都伊斯法罕。这与同时期欧洲的宗教迫害形成了天壤之别。 这件面具来自塞拉利昂，装饰着棕榈叶碎。顶部的欧式大礼帽显示出欧非之间的文化交流。 在博物馆里注视着达尔文曾经同样注视过的计时器，的确是一种非同寻常的感觉。这件仪器穿越过麦哲伦海峡，抵达过加拉帕戈斯群岛，历经 5 年的环球航行和 200 年的风霜岁月，如今又穿越半个地球躺在博物馆里，安静地接受人们的目光，伴随着一种历史的奇妙感。 走完全程，从最原始的石制砍砸器到最先进的太阳能灯具，人类文明的历程就浓缩在这 100 件文物中。一种无法言说的历史感萦绕在心头，眼看着自己的种族从茹毛饮血到文字，到礼仪，到信仰，到理性，眼看着从各自偏安一隅到浩浩汤汤不可阻挡的全球化，不得不为自己物种创造出如此辉煌的文明而热泪盈眶。所以我的建议是，挑个普通的周末去参观吧，50 元的票价实在太值得了。","link":"/2017/04/09/%E5%A4%9A%E5%9B%BE%E8%AE%B0%E4%B8%80%E6%AC%A1%E8%AE%A9%E4%BA%BA%E7%94%9F%E6%97%A0%E5%8F%AF%E6%81%8B%E7%9A%84%E6%8E%92%E9%98%9F/"},{"title":"Heavens-Above 简要介绍","text":"本篇文章最早发布在我校天文社公众号上，作者也是我，所以没有转载信息…… Heavens-Above 是一个由德国人 Christopher Peat 创建并维护，免费提供多种天文信息的网站。 进入网站后，右上角默认的地址为经纬 0 °，位于几内亚湾的某地，所以我们需要首先在设置里选择自己所在的地区，同时也可以先在右上角设置语言。点击“更改您的观测位置”，在打开的页面有搜索、地图拖动和手动输入信息三种设置方式。地图使用的似乎是谷歌地图中国版的数据源，所以不需要梯子即可正常使用。 当选择好自己所处的地区的时候，就可以查看各式各样的信息了！先来挑个好玩的，我们的天宫二号： 可以看到，这个页面显示了最近十天在北京可见的天宫二号所有过境情况，亮度、时间、方位等信息一应俱全，大家可以依靠这个去观测天宫二号划破天际时的闪光。不过从表上看，最近它经过北京的时间都是凌晨，想要看到它的人恐怕需要很强的毅力了。至少站长是没有的。 相似地，Heavens-Above 还提供了诸如铱星闪光、哈勃望远镜过境等信息，这里就不逐一描述了。除了人造天体外，网站上还有许多自然天体的信息，比如日食： 这个页面列出了最近几年会出现的各种日全食，每个都能点击进入详情页面查看具体情况。虽然目前这个页面显示的日食图看似复杂，但结合详情页面的交互式动画，很容易就能理解图上各种线条的含义。百闻不如一见，站长在这里不多说，感兴趣的朋友还请自行操作，一定会让你有豁然开朗之感。 最后放一个逼格特高的东西，国际空间站三维模型： 国际空间站，常缩写为 ISS，是由美国国家航空航天局、俄罗斯联邦航天局、日本宇宙航空研究开发机构、加拿大太空局、巴西航天局和欧洲空间局六家机构共同运营的近地空间站。这个页面的 ISS 三维模型依照空间站的真实位置不断运动，并且可以随意旋转、放大与缩小，方便浏览者从各个角度观察。站长在上面发现了 NASA，ESA 与 NASDA 的标志，不知道你能不能发现更多呢？ 最后再放一张由“发现”号航天飞机拍摄的国际空间站。在许多人对航天事业提出质疑的时候，站长始终坚信，航天是当之无愧的人类智力的最高峰，是人类理性与情感最完美的结合。正如这个网站名所表示的，举头仰望时，人类总能望见令人一处伟大的天堂。","link":"/2017/05/26/Heavens-Above%E7%AE%80%E8%A6%81%E4%BB%8B%E7%BB%8D/"},{"title":"谈性侵，不能再假装看不见这个黑房间","text":"转自微信公众号，作者毒舌电影，原文链接 https://mp.weixin.qq.com/s/SvaEU5Eaovjs4EOYW9CNMQ，转载授权： 想必最近大家都被这两件事刷屏。 台湾作家林奕含，早年被补习老师性侵，长期饱受抑郁症折磨，2017 年 4 月 27 日上吊自杀。 自杀前两个月，她以亲身经历为参照，推出小说《房思琪的初恋乐园》。 那年的教师节思琪才13岁，这个世界和她原本认识的不一样。 老师说爱我的方式是将阳具塞进我嘴里，老师说我是全世界最好的礼物，却残忍地折磨我的身体。 他选择硬插进来，而我要为此道歉。 自杀前八天的采访中，林奕含说：这是一个关于“女孩子爱上了诱奸犯的故事”。我要爱老师，否则我太痛苦了，因为你爱的人要对你做什么都可以，不是么？ 性侵，让林奕含不再相信任何人，也无法相信文学艺术本身。 一个真正相信中文的人，他怎么可以背叛这个情话是“言有所衷且思无邪”浩浩汤汤已经超过中国五千年的语境和传统。 我的整个小说，从李国华这个角色，到我的书写行为本身，它都是非常非常巨大的诡辩，都是对艺术所谓真善美的质疑。 她说：这个故事折磨、摧毁了我一生。 林奕含父母，5 月 5 日发表声明： 还有三名女学生遭到同一位老师的伤害。 无独有偶。 林奕含事件后不久，北京电影学院的阿廖沙借朋友 @宋泽尘Leslie_AM 的微博发声： 自己曾遭班主任父亲性侵，且因为维权在学业上被班主任、系里老师为难，最后没拿到毕业证。 性侵，再次成为国民话题。 这条微博下，有接近 15000 的跟帖和将近 40000 的转发表明，人们开始迅速站队。 有人质疑受害女生炒作，质疑她的品质和作风。 有人选择相信老师——为人师表，绝不会做这种事。 更多的人批判施暴者，批判不公的体系和权力阶层…… 说实话，都似曾见过。 为什么我们总这样？总是在事后怀疑、悲愤、斥责、观望？ 最后，受害者却死的死，疯的疯，边缘的被边缘……总是于事无补？ Sir 想冒犯地说一句，这种“于事无补”，与你、我、每个貌似与性侵无关的人，都有关。 还是借一部电影，聊一下为什么。 看看“性侵”，是如何用有形的房间侵犯她的身体，又是如何用无形的房间禁锢她的灵魂。 《房间》 Room 无论摄影师怎样用柔和的光和小清新视角去美化，你得承认，这就是一个肮脏狭小的房间。 斑驳的墙、一个马桶、一张床、一个衣柜，一个方块大小的天窗。 没有活动的空间，没有清新空气，没有阳光，有的是老鼠、蟑螂和蚊子。 住在里面的女人乔伊，像一个病人。 这个不适合人类居住的房间，是一个犯罪场所。 乔伊，被老尼克囚禁了七年，性侵了七年，在这期间，生下了儿子杰克。 等到杰克五岁时，妈妈乔伊告诉了他真相：我是被老尼克骗来的，外面还有更大的世界。 叶子枯萎后是黄色的，鳄鱼松鼠都是真的。 除了我们，还有其他的人，他们也是真的。 然后，母子决心逃跑。杰克通过装死，被老尼克抱出去抛尸，在卡车上，他牢记妈妈的话。 遇到停车空挡，马上跳车呼救。 他成功了，老尼克被捕了。 但他们解脱了吗？ 不。一个无形的房间，从这一刻，建起了。 一开始，儿子杰克也不适应外面的世界。 他不敢和人对话，听到电话铃声会吓一跳，见到阳光的第一感觉，是恐惧。 好在他才 5 岁，医生说他所有的观念还没定型。 所以他很快融入了新生活，学会了对外婆说“我爱你”，学会了和其他小朋友一起玩。 对他而言，走出了有形的禁室，是新生。 而妈妈乔伊呢？ 面对记者，乔伊仓皇而逃； 面对父母，她愤怒地质问：妈妈，为什么是我？！ 如果不是因为你总是教导我要对人友善，我怎么会听信老尼克的谎话，跟他进屋。 面对人们？呵呵，这是多么难面对的一群人们。 人们关心她、怜悯她、议论她，然后……疏远她。 我是馊掉的柳丁汁和浓汤，我是爬满虫卵的玫瑰和百合，我是灯火流丽的都市里明明存在却没人看得到也没人需要的北极星。 （摘自《房思琪的初恋乐园》） …… 电影里的七年后，乔伊逃出了房间。 现实里的九年中，林奕含远离了加害人。 但此后的人生，她们陷入一个面积更大的黑房间。 走不出的乔伊，终点是疗养院。 走不出的林奕含，终点是死亡。 这带出了一个戳心的问题—— 她们走不出的，到底是一个什么样的黑房间？ 这个无形的房间，为什么每一个切面，都宏大而颠扑不破？ 直到读完《房思琪的初恋乐园》，Sir 才几乎看清了这个房间，也看到了它的每一堵墙。 第一堵墙，叫：“无知”。《初恋乐园》中，房思琪在日记里回忆第一次被性侵。她用蓝字写： 我下楼拿作文给李老师改。他掏出来，我被逼到涂在墙上。老师说了九个字：“不行的话，嘴巴可以吧。”我说了五个字：“不行，我不会。”他就塞进来，那感觉像溺水。 接着又用红字写： 为什么是我不会？为什么不是我不要？为什么不是你不可以？ 直到现在，我才知道这整起事件很可以化约成这第一幕：他硬插进来，而我为此道歉。 房思琪不懂，为什么是“我不行”而不是“你不可以”？ 《南方人物周刊》在 2016 年文章《性侵之后》中，采访过几名性侵受害者。 她们成年后再回忆当时的情况，说法相当“房思琪”： 一个说： 男人让她抚摸他的身体，“照做就是在帮忙。” 自小被教育要乐于助人……便照做了。不明白抚摸意味着什么。 另一个说： 我有模糊地拒绝，“不要吧”……没法理直气壮。 你看，未成年受害者大多不懂何为性侵，那么，便很可能也不懂，她们经受的是一种恶。 这样就更无从谈到，什么是自我保护，什么是反击。 而孩子无知，恰恰是因为大人不想她们懂。 《初恋乐园》中，房思琪被性侵后试探着问父母： 房：我们的家教好像什么都有，就是没有性教育。 房母：什么性教育？性教育是给那些需要性的人…… “父母将永远缺席。” 其实缺席的，又何止是房家父母？ 就在今年3月，网上对《小学生性健康教育读本》声势浩大的抵制，足见中国父母的意识水平。 这本教材教小学生说“不”。 家长 get 到的重点却是，孩子太小，内容太露骨。 现在小学二年级就开始学习（这个）了吗？ 终于在家长们团结一致的吐槽下，教材被学校迅速收回。 这些家长肯定没看过《初恋乐园》中这么一段话—— 思琪：我有时候想起来都不知道老师怎么舍得，我那时那么小。 李国华：那时候你是小孩，但我可不是。 不要嫌弃性教育早，因为性侵者，从来不嫌你孩子小。 这道叫“无知”的墙，把守的卫兵不是别人，正是同样无知的家长。 第二堵墙，叫：耻感和爱。《初恋乐园》中，房思琪试探父母： 思琪在家一面整理行李，一面用一种天真口吻对妈妈说：“听说学校有个同学跟老师在一起。”“谁？”“不认识。”“这么小年纪就这么骚。”思琪不说话了。她一瞬间决定从此一辈子不说话了。 因为无知而产生的所有性疑问，在周围人的拒绝解答中，化为了无法出口的耻感。 耻感，是房思琪们不可说、不敢说的东西。 她向闺蜜怡婷坦白： ——如果我告诉你我和李老师在一起了，你会生气吗……该做的做了，不该做的也做了。 ——老师跟我们差几岁，37！天哪，你真的好恶心，我没有办法跟你说话了。 有男生追求她，房思琪想的是： **已经来不及了，我已经脏了。**脏有脏的快乐，再去想干净就太苦了。 难怪，林奕含只能这么去理解《初恋乐园》： 这是一个关于“女孩子爱上了诱奸犯”的故事 她无法承认诱奸，只能承认“爱”。 因为诱奸是脏的，爱是干净的。 我想出唯一的解决之道了，我不能只喜欢老师，我要爱上他。你爱的人对你做什么都可以，不是吗？……我要爱老师，否则我太痛苦了。 然后，她一次次试着去理解老师。 但还有另一个自己，在不断提醒这种爱的怪异之处—— 他们知道什么叫不被当人看吗？他们当真知道被当成狗操的意思吗？被当成狗操。 爱只是人插进你的嘴巴而你向他对不起。 就这样，“耻感”和“爱”，成为了施暴者控制受害女性的两件利器。 在这两件利器作用下，她们不能说、不敢说，而生活中所有星星点点的日常，却从未放过她们—— 在博客中，林奕含写道： ……公寓管理员老看我。每踏进巷子，就感觉到他把眼球软搭搭投掷到我脸上…… 在知乎上还有匿名的受害者说： 上体育课聊到处女膜，心里就咯噔一下；新婚之夜聊到第一次，心里又咯噔一下…… 可以想象，无数件对普通人而言轻如鸿毛的日常小事，在性侵者的耳朵里无异重锤。 她们做什么干净的事，都摆脱不了**“我已经脏了”**这个强暗示。 第三堵墙，叫“善意”。呵呵，为什么善意也是墙？ 在小说中，房思琪疯掉了。林奕含说，“她注定会终将走向毁灭且不可回头。” 她注定走不出来，因为周围的人包括她自己，都在“不断重温”。 林奕含在性侵结束的9年来，一次次咀嚼之前的经历，一次次附身到当年那个被性侵的小女孩身上。 然后，她又用小说再强化。 她说自己的写作“细到有点恶心、情色、变态。我要用非常细的工笔，去刻画他们之间很恶心的色情，是很不伦的。” 思琪大起胆子问他：做的时候你最喜欢我什么？他回答了四个字，“娇喘吁吁”。她几乎要哭了，《红楼梦》对老师来说就是这样吗。 她善意的精神科医师对于她所遭受的事，再三给予了下面的形容： 我的精神科医师在认识我几年后，他对我说，你是经过越战的人 然后又过了几年，他对我说，你是经历集中营的人 后来，他又对我说，你是经历核爆的人 这是抚慰，但这也可能是又一次强化。 Sir 不是专业人士，但微博网友 @端木异提供的观点值得深思： 数年前，李银河曾经将要用身体伤害罪来代替强奸罪…… 我们讨论强奸行为时，附加了太多意义和传统，最终竟反刍到脆弱的受害人身上……讲白了，就算是遭遇强奸，本质上也只是身体器官受到暴力的伤害，不应该有人因此自杀，让自己漫长的余生在被伤害的阴影里无法走出。 她们为什么非但走不出来，反而越来越不正常？ 其中一个原因，是不是因为我们带着深切的同情，逼她们一次次将自己重新“受害者化”，一次次自我强奸？ 是不是因为我们的善意里，也包含了一种对“异类”的疏远？ 或者再揣测得大胆一些—— 是不是因为我们内心也觉得，她们失去了处女膜、“脏了”，所以，我们才同情她？ 最怕这“善意的墙”，是由一块块“思维落后的砖”构成。 却很少人把善意释放到该释放的地方——她的精神黑洞： 奇怪的是，没有人要听我讲内心……没有人知道我害怕睡觉、害怕晚上、害怕早上、害怕阳光、害怕月亮。（《报道者》网站采访） 林奕含是受害者，她肯定是受害者，于是……她也一直是受害者。 第四堵墙，叫“不许说话”。很好理解吧。 小说《初恋乐园》，李老师跟思琪说：“嘘，这是我们的秘密哦”。 她现在还感觉那食指在她的身体里，既像一个摇杆也像马达 纪实采访《性侵之后》的受害者艾麻说，那男人“叮嘱她不要跟父母讲。” 不，不仅是施暴者叫她们不要说话。 还有更多的人，相关的、无关的，都在做这件事。 宣称被班主任的父亲性侵的阿廖沙，在事后坚称： 系领导层层抱团，公开为难，让她拿不到学位。 与此同时，她还被同学孤立，“你只有负能量”“她有病吧……” 就在最近几天，学校的辟谣亦称：受害者患精神性疾病。 该生自中学起就有抑郁症，大学时曾因抑郁症自杀洗胃。 更多的吃瓜群众，进一步开始污名化。 这广告打的好。性侵不亏。 ……如果不是对他有诉求，一个老头能性侵到她？ 从过去到现在，从相关人士到无关群众，每一次发声，都在叫她“闭嘴”“走开”。 这，和林奕含之死何其相似。 “苍蝇不叮无缝的蛋”，这老掉牙的俗语，一次次以新的变形，不断出现： 总的来说就是幸福过头……世间好的都给你了…… 这样的句子 Sir 不想再找了。 我们永远能听到大家对女性受害的“合理性解释”： 太漂亮、胸大无脑、太开放、作风不好、家教不好…… 一句话，苍蝇叮上蛋，就是蛋的错。 Sir说完了构成这个无形房间的四墙。 建筑这四墙的人，有父母、受害者、施暴者、有关组织、吃瓜群众…… 我们用无知，骗她走进了陷阱，孤立了她。 施暴者用耻感和**“爱”**，为她锁上了门，禁锢了她。 某些“**善意”**的人，不断“提醒”她的受害者身份，然后用脑中的陈腐，隔离了她。 还有吃瓜群众和相关组织，用不许说话和污名，封杀了她。 不要说受害者没有试图拆掉它。 很可怕，到目前为止，我们所听说的拆迁方式，都是受害者自己完成的、且是最坏的： 死、变疯、退学、辞职、变得滥交……每况愈下地，从此改变了人生轨迹。 很遗憾，找到这个房间，也不代表性侵在这个时代有解。 不要说世界，台湾这样的事情仍然会继续发生 现在、此时，也正在发生 很多人在试图找到答案。比如他们借各种新闻、电影（如《不能说的夏天》《素媛》）展开讨论，寻找解决的办法。可惜讨论的焦点，总是太过集中于受害者和施暴者身上，集中在一桩桩貌似不同的个案上，却忽视了那个更大的、看不见的，禁锢被性侵者的黑房间。 这也就是开头 Sir 说的，于事无补。 书评人蔡宜文说过，任何基于性的暴力，都是整个社会一起完成的。 那看来拆掉它，也一定得是整个社会的动作。 你愿意做第一个，从现在开始就拆掉它的人吗？ 拆掉你思维里的陈腐，拆掉你不负责任的语言，拆掉你无心伤害的伪善，拆掉不完善的立法，拆掉不合理的教育…… 难，但必须做。 要知道，这房间的最下面的一块，是林奕含们的。 只有当我们一块块拿掉了上面所有的砖。 她才可能有勇气，拿掉最后一块。 本文图片来自网络","link":"/2017/05/14/%E8%B0%88%E6%80%A7%E4%BE%B5%EF%BC%8C%E4%B8%8D%E8%83%BD%E5%86%8D%E5%81%87%E8%A3%85%E7%9C%8B%E4%B8%8D%E8%A7%81%E8%BF%99%E4%B8%AA%E9%BB%91%E6%88%BF%E9%97%B4/"},{"title":"Office 2016 新建文档显示“兼容模式”解决办法","text":"众所周知，微软的 Office 每版更新不仅是界面的变化，内容格式也会随之改变。新版软件创建的文档的格式可能在旧版软件上无法正常显示，因此就有了兼容模式的存在，在这一模式下创建的文档会自动禁用旧版无法显示的格式。不过，新建一个文档时兼容模式默认应该是关闭的，而今天站长发现自己在新建文档时兼容模式打开了。虽然不会有大的影响，但是这对一向追求最新特性的站长来说十分别扭，因此搜索了一会，找到了如下的解决办法。 如果在之前安装过旧版的 Office 套件的话，程序会自动在 C:\\Users\\用户名\\AppData\\Roaming\\Microsoft\\Templates 目录下生成一个模板。而升级或卸载重装 Office 并不会删除该模板，因此无论通过何种方式升级后，创建新文档时程序都会默认套用该模板，导致出现兼容性问题。因此我们要做的就是删除该模板。 找到上图所示的 Normal.dotm 文件，将其删除，随后再重新打开 Word，程序会新建一个符合最新标准的模板，新文档上就再也没有恼人的兼容模式提示了！ 同时站长在搜索过程中看到过另一种关闭兼容模式的方法，但描述得不甚清晰，大约是面向专业人士的缘故。其看起来类似于修改注册表，但站长在注册表中没能找到它说的路径，故在此就不赘述，给出网址，感兴趣的朋友还请自行研究。","link":"/2017/05/27/Office%202016%E6%96%B0%E5%BB%BA%E6%96%87%E6%A1%A3%E6%98%BE%E7%A4%BA%E2%80%9C%E5%85%BC%E5%AE%B9%E6%A8%A1%E5%BC%8F%E2%80%9D%E8%A7%A3%E5%86%B3%E5%8A%9E%E6%B3%95/"},{"title":"闲扯","text":"最近入了个 Kindle Paperwhite 3。起因是上课时把玩同学的，突然感觉不错，回来比较了一下几个型号，付款购之。算是一次冲动消费吧。 之前考虑过许多次买不买 Kindle，每次都是觉得更喜欢纸质书翻页的感觉而尤其讨厌 Kindle 的闪屏，故而一次次否决了自己。不过这次突然觉得拿着一个 200 g 的屏幕看各式各样的书体验着实很好，加上听说 Paperwhite 3 RAM 比同学的大了一倍，翻页闪屏已几乎不再影响观感，因此一念之间买下。 到手后几番尝试，感觉十分良好。虽然受制于性能，操作流畅性无法与习惯了的手机相比，但是也远高于预期。尤其是翻页时，极少出现不讨喜的全屏反色刷新，阅读流畅性得到了保证。同时，整个系统的生态环境也十分完善。在电脑上通过亚马逊网站下单一本书，拿起 Kindle 就能阅读，或许 iOS/macOS 的生态也不过如此（想起当年用过的 Lumia 526，可惜低端机在 Win 10 Mobile 上表现太糟糕，和电脑的互动并不好）。 周三到货之后，先后买了《中国通史》，《基督山伯爵》和《安娜·卡列尼娜》，都是想看而没有那么想看的书（其实就是没钱）。躺在床上看译林周克希先生版的《基督山伯爵》时，我突然意识到另一件事，那就是电子书实在节约空间。看看我现在书架的样子，是绝对放不下它的纸质版的——足足有 1305 页，1.9 kg 重。能手持一块薄薄的屏幕半躺在床上看书，生活堪谓满足。 感谢去年某同学送的茶，让不到 9 点就犯困的我撑到了 11 点过。恍惚间又是一年过去了，去年 6 月 9 号口语考完出学校时的瓢泼大雨仿佛还在眼前下着，怎么就整整一年了呢。一年间自己经历了什么，收获了什么呢？此时此刻耳机里正是斯美塔那的伏尔塔瓦河，壮阔的音乐阻止我思考。或许纯粹的美就够了。终有一日我会去到波希米亚的那条大河边，凭栏远望，或许想很多，或许什么都不想。存在先于本质，l’existence précède l’essence，多么迷人的话。在理性不能解决问题的时候，不妨就感受生活，感受单纯的美吧。 这篇博客没有什么目的，权当作是一个不想做作业而又闲得无聊的人的深夜瞎扯，诸位看看也罢。","link":"/2017/06/10/%E9%97%B2%E6%89%AF/"},{"title":"Windows 10 自带输入法消失解决办法","text":"微软于几个月前推送了 Win 10 创意者更新，带来了一系列新功能，不过对于站长的 sp4 来说也带来了一个 bug——每次开机或重启后自带的输入法就会消失，图标为空，只能输入英文。查了一下，没有找到具体的原因以及彻底的解决办法，不过有一个还算简便的方法。 首先右击开始菜单，选择“运行”，或者直接使用 Win+R 键调出运行，在对话框中输入“ctfmon.exe”，点击运行，这样就会重启输入法组件。可能运行后暂时看不出什么效果，但是在任何地方尝试输入文字时，就可以看到输入法可以正常工作了，右下角的图标也很快就显示出来。 因为太简单（lǎn），所以也就不截图了。","link":"/2017/07/12/Windows%2010%E8%87%AA%E5%B8%A6%E8%BE%93%E5%85%A5%E6%B3%95%E6%B6%88%E5%A4%B1%E8%A7%A3%E5%86%B3%E5%8A%9E%E6%B3%95/"},{"title":"一行代码使 Android 端 Chrome 状态栏变色","text":"谷歌的 Material Design 设计语言已经有一段时间的历史了，作为安卓的官方规范，虽然在国内的应用情况惨不忍睹（对，就是说你们，BAT)，但谷歌自家应用无疑是这种设计的典范。其中一个重要的特性便是状态栏阴影，有无这一特性很大程度上决定了一个 App 的美观与否。 有趣的是，作为谷歌一大应用的安卓端 Chrome 并未直接支持状态栏变色。站长曾对此很不理解，后来才得知 Chrome 将这一操作交给了网站开发者，只要在网页中添加一行代码就能给浏览器工具栏带来不同的色彩，同时也让状态栏蒙上一层好看的阴影。针对 WordPress 而言，打开“外观-编辑”页面，找到主题页眉 (header.php)，在文档开始部分的 与 之间任意一行插入以下代码： &lt;meta name=&quot;theme-color&quot; content=&quot;#??????&quot;&gt; 其中将六位通配符改成自己所需颜色的代码即可。颜色的查找推荐 App 日本の伝統色，这也是曾经在酷安上架的应用，由于开发者没有实名而下架，需要到网盘下载。 不过，由于网站题图的原因，站长暂时还没找到合适的搭配颜色，如果你有感觉不错的颜色请告诉站长~","link":"/2017/06/26/%E4%B8%80%E8%A1%8C%E4%BB%A3%E7%A0%81%E4%BD%BFAndroid%E7%AB%AFChrome%E7%8A%B6%E6%80%81%E6%A0%8F%E5%8F%98%E8%89%B2/"},{"title":"将 APOD 设置为电脑桌面","text":"APOD 是 Astronomy Picture of the Day 的缩写，即每日一天文图，由美国国家航空航天局与密歇根科技大学每天提供一张有关我们宇宙的图片，并由专业的天文学家提供一份简要说明。这些图片都与天文或太空探测的时事有关，图像可以是一张相片、在不同波长下拍摄的假色图，或是艺术家的构想。台湾的国立成功大学物理系取得了繁体中文版的翻译授权，每日进行翻译工作。 今天要介绍的则是一款利用了 APOD 的软件，每日一天文图桌面壁纸工具（APOD China-VO），该软件的目的即是每天自动将 APOD 网站上更新的天文图片设置为个人电脑上的桌面壁纸。 下载后无需安装，直接打开。程序界面如上图，最上方三个复选框可根据需要自行勾选。下方则是壁纸的显示方式，由于用于壁纸图片的比例和分辨率千奇百怪，不可能和每个人的显示器一致，所以 Windows 提供了这几种壁纸显示方式供使用者自行选择。说句题外话，很久没有看到过的这些选项让站长回想起了小时候的 XP 时光（暴露年龄）。个人认为填充是最美观的显示方式，不过代价是丢失图片的边缘部分。剩下的比较重要的设置就是 APOD 站点了，程序默认的是如图的 NASA 官方站点，由此更新的图片的介绍也是英文的。对于家中网络状况较差、访问 NASA 官网有困难，或者需要中文介绍的使用者可以切换成台湾国立成功大学的镜像站点，这样便能获得其翻译的繁体中文介绍。 说起来早有介绍这个程序的打算，不过拖延症发作一只没写。至于为什么会在今天动笔，因为今天的图萌啊！果然萌是第一生产力（误）。","link":"/2017/07/26/%E5%B0%86APOD%E8%AE%BE%E7%BD%AE%E4%B8%BA%E7%94%B5%E8%84%91%E6%A1%8C%E9%9D%A2/"},{"title":"关于翻译的一点感想","text":"熟悉站长的人都知道，《质量效应》系列是站长的本命所在。宁肯少活二十年，拼命也要拿下蓝莓皮皮虾。当然，最新作《质量效应：仙女座》里没有了皮皮虾，也没有了蓝莓，阿莎丽队友变成了“Peebee”。先不说这个名字，这位新队友本身便长着一张游侠脸，从三部曲过来的玩家一开始可能会觉得相当……印象深刻。（不过也是很酷的！） 不过这篇文章要谈的不是 Bioware 突然改变的美术风格。外国游戏在中国的传播，语言始终是一个老大难问题。尽管近年来中国市场地位渐高，中国玩家愈发活跃，甚至能组织起没有中文就差评的活动，但还是有很多公司并不在意。对，就是说你，EA。美国艺电作为全球数一数二的游戏大公司，对中国市场的态度却实在不敢恭维。虽然风评有时略好于育碧（老笑话：为什么 EA 是美国最差公司？因为育碧在法国），但在中文支持一项上实在是远不能及。人家的古墓 10 界面、字幕和音频都完完全全支持简中，比你们高到不知道哪里去了！因而，游走在法律边缘的各个汉化组还有长久存在之必要。 《质量效应》三部曲的汉化质量参差不齐，评价最好的应该是三代的玩家汉化组，站长在使用时也明显感觉其作品比其他汉化组以及一二代的汉化高一个档次。不过五年过去了，当年的成员毕业的毕业，成家的成家，已无时间精力继续承担仙女座的汉化任务。就在站长打算像二代一样依靠三大妈汉化时，之前汉化过《黑色洛城》的黑洛汉化组表示愿意接手，并在贴吧招募 ME 玩家，于是站长满心欢喜地报名加入了。 加入之后对于自己的英语水平没什么信心，因此报名负责润色（后来对自己中文水平也没信心因此感到很慌张）。不过由于文本量太大、成员太少，半年来初次翻译都没有成果，校对且尚未开工、遑论润色了，故而也闲了半年。大概是由于人手实在不够，一周多以前负责人让我也干一些翻译的活，量不多，数百句话而已。 但由此开始，我才真正体会到翻译的不易。曾经以为翻译不过是想出原文对应的几种译文、斟酌一下哪种最为恰当，至多不过之后再美化一二，但自己翻译起来才知道这是 too young too simple，甚至 sometimes naïve。比如一句简单的 “I don’t know, but it worked”，“我不知道，但它起作用了”？“我不知道，但它有用”？“不清楚，但是有用”？无论怎么翻都觉得词不达意。当初思考信达雅的问题时觉得“信”无需考虑，“达”要动动脑子，“雅”才是重点。现在看来，我光是做到“信”便很不容易了！看原文时很容易理解的一句话，就是找不到合适的母语来表述，这无关语言的不可译性的问题，而纯粹是译者的水平问题，外语与母语都不够熟练，无法将领会到的意思用语言表达出来，只能称其为不可道之道了。由此观之，那翻译大家们，如周克希，如草婴，其才学实在是不可估量。 突然想起一个说法： 中国的翻译界很有意思，针对俄罗斯每一位大师，都有一两位“专职”的译者。比如普希金的诗译者是查良镛（原文如此，应是查良铮，即穆旦）和戈宝权，果戈理的译者是满涛，列夫·托尔斯泰的译者是草婴，肖洛霍夫的译者是金人等等。他们的译本所达的高度就是原作的高度，很难逾越。……能够对这种高难度的长句子驾轻就熟，能是一日之功吗？所以这一代翻译家都是把一个或几个俄罗斯作家作为自己终生工作对象的！ 终生从事翻译工作，便堪称大家了。而将自己的一生献给一位作家，是何等孤寂，又何等荣耀啊！“他们的译本所达的高度就是原作的高度”，他们本身的高度也是作者的高度。没有这样的作者就没有这样的创作，没有这样的译者就没有这样的传播。创作和传播终究是一个人的两条腿，瘸了哪一条都是不行的。","link":"/2017/07/29/%E5%85%B3%E4%BA%8E%E7%BF%BB%E8%AF%91%E7%9A%84%E4%B8%80%E7%82%B9%E6%84%9F%E6%83%B3/"},{"title":"怀远人","text":"这是特殊的一周。 9 月 15 日，卡西尼-惠更斯号探测器就将坠入土星大气层——或者说卡西尼号，因为惠更斯号早已于 2005 年在土卫六（Titan）上着陆。一个陪伴了我整个童年的英雄即将离去。 卡西尼号于 1997 年在卡纳维拉尔角航天基地第 40 号发射台升空，至今刚好 20 年。其升空之时我尚未出世，而如今我已有能力回顾它的整个旅程、并从中获得一二感动了。经过数次重力助推，卡西尼号在发射 7 年后抵达土星，随即展开为期四年的原定任务。详细情况无需多说，这里只提最令人激动之一事。在对土卫二（Enceladus）的观测中，卡西尼号发现了其南极地区存在羽状喷射物，随后的飞掠带来了振奋人心的消息——羽状物主要成分为冰晶，但其中包含有复杂的碳氢化合物，暗示着土卫二冰层之下孕育着一个可供生命发展的原始环境。这是何等的激动人心！人类还在为自己在宇宙中是否孤独而喋喋不休的时候，身边就已经出现了可能孕有原始生命的环境（能以光分来计算的距离，在空间尺度上确实可称身边）。尽管存在智慧生命的可能性很低，但在别的星球上发现能进行新陈代谢的物体，已足够震撼。人类仰望星空已有数万年，当终于遇到可称为同类的事物时，心情该有多么复杂。 2008 年，卡西尼号的既定任务完成之后，燃料仍然充足，仪器仍然良好，团队决定延长其生命至 2010 年。两年过后，卡西尼号状态仍然良好，于是任务再次延长，直至如今。 神龟虽寿，犹有竟时。卡西尼号的旅程终不能永久延续下去，到了告别的时候了。在发射之时，地球上无一人能想到土星附近有可供生命存在的环境，因此卡西尼号并未接受任何消毒措施。而如今，土卫二已变得如此珍贵，人类不能冒任何污染其原有环境的风险。因此，卡西尼号不能等待自然死亡，成为一个绕土星旋转的游魂，而只能主动选择壮烈地死去。在它还能控制自己的时候，它将面向土星，一头扎进这个陪伴了自己 13 年的气态巨人怀抱里，化为一颗火流星，消失在它浓厚的大气层中。而直到它解体前的最后一刻，卡西尼号都会朝着地球——家的方向，传输探测到的关于土星大气的任何数据。在最后一场战斗中，倒在最后一颗子弹下。 天文究竟能带给我什么呢？它是如此宏大，如此瑰丽，如此令人恐惧，如此让人沉寂。任何描述性的词句总会让人觉得词不达意，无法表达出心中所感。所以让我用卡尔·萨根的一段话作结吧。这张照片是由旅行者一号于 1990 年在 64 亿千米之外拍摄的一张地球照片，我们所熟悉的那颗美丽的蓝色星球在这张照片上，不过是仅有一个像素的暗淡光点。卡尔·萨根受此启发，写出了《Pale Blue Dot》，这便是书中的一段话。原文已在图上，笔拙不再翻译了。 最后，送上 NASA 冯·卡门系列讲座之卡西尼号：去往土星的伟大航程，b 站在线，中英双字，一个小时的讲座，值得一看。","link":"/2017/09/12/%E6%80%80%E8%BF%9C%E4%BA%BA/"},{"title":"高德地图一加专版","text":"说到地图，应该是人手必备的 APP 之一了。目前国内风头最盛的无非高德，百度与腾讯三家。不管别人怎么感觉，站长用得最习惯的还是高德。可惜，14 年阿里收购高德之后，也将其改造成了一个与淘宝类似流氓软件——自启，唤醒，推送，无恶不作，即使是在 Play 商店上架的版本也是如此。不过，办法总是有的，例如今天分享的一加手机定制版。 严格来说，这种定制版软件来自于站长同样厌恶的一种行为——手机预装软件。不过，一加氢系统的预装软件都是可以卸载的，因此还不算十分流氓，并且这些软件还通常比应用市场上能下载的大众版本更为优秀。一加专版的高德地图便是如此，在 Play 版高德正常退出都无法用黑域压制的情况下，一加版用返回键退出后连缓存进程都不会留下，可以说是十分良心了（也可能和我用 MAT 杀掉其一些服务有关，不过 Play 版杀掉后还是会自动开启，而一加专版则不会）。 可以看到，此版高德版本号为 v7.5.8.S018，无更新提示，界面比市场版简洁很多，不过没有骑行导航等最新功能，适合非重度用户使用。 下载地址","link":"/2017/10/07/%E9%AB%98%E5%BE%B7%E5%9C%B0%E5%9B%BE%E4%B8%80%E5%8A%A0%E4%B8%93%E7%89%88/"},{"title":"轻课表，流氓之外的选择","text":"作为学生，课程表 App 总是必不可少的。在站长印象中，首先进入这一市场的是超级课程表，之后又有课程格子等后来者出现。不过当时站长正上初中，没有手机课程表 App 的需求，直到一年前才开始寻找好用的应用。当时慕名在酷安上搜索了前面提到的两款应用，却被其臃肿的功能和流氓的服务与权限吓退，转而尝试了酷安上很多其他课程表，最终找到了这款轻课表。 界面如上所示，没有冗杂的聊天社交元素，就是一个简简单单的课程表应用。和其他应用相比的劣势是，轻课表只能自动导入极其有限的几所大学的课程表，支持列表以外的大学需要用户自己手动添加，对于课程较多的学生来说确实有些麻烦。不过，在学期开始时花十来分钟填写好课程， 以后整个学期都无需操心，也是值得的事情。另外，轻课表目前已经支持导入与导出，可以将已添加好的信息导出到内部存储单独保存，无论是刷机还是换机都无所畏惧。并且，作者计划未来提供同步到云端的功能，那时就非常方便了。 不过美中不足的是，轻课表仍然有一些（在站长看来）不必要的权限，在意的用户可以通过各种方法将其禁用，这里不再详述。 老规矩，酷安有的应用就不放下载链接了，请各位自行搜索下载。","link":"/2017/11/12/%E8%BD%BB%E8%AF%BE%E8%A1%A8%EF%BC%8C%E6%B5%81%E6%B0%93%E4%B9%8B%E5%A4%96%E7%9A%84%E9%80%89%E6%8B%A9/"},{"title":"北京地铁和大学的故事（一）","text":"转自知乎专栏“轨道与城市”，作者 hat600，原文链接 https://zhuanlan.zhihu.com/p/20504704，转载授权： 后一篇：北京地铁和大学的故事（二） 首先需要提醒：本篇中包含大量的小道消息（未必注明），行文不但立场鲜明，而且不时流露出巨大的恶意，尤其是对涉及的大学做了大量负面描述。如有不适，请停止阅读，关闭本页面。 任何对官方态度的描述均为推测，未必代表官方观点。 引子众所周知，北京有很多高校。但是有趣的是，虽然地铁很早就开始修，但经过西郊科教区的西颐线却一推再推，第一个正经路过大学校园的地铁线路，已经是 2002 年的事情了。2002 年开通了今天的 13 号线西段，经过不少大学；但是 13 号线沿线至今仍然有很多城中村，相邻的大学也大多是后门，大家相安无事。 等到 2003 年底八通线开通，一个不是那么有名的学校——北京广播学院——成了第一个吃螃蟹的人，要求把这座车站（工程名称：定福庄）的名字改成广播学院。北京地铁也不是傻子，就专门问：你以后要是改名怎么办？于是广播学院出了一张不改名的承诺书（据说还是教育部出的）。 可这屁股还没坐热，2004 年广播学院就改名了。 当时北京地铁的站名管理仍然比较随意，没有意识到跟着改名会造成怎样的后果，这座车站就如校方所愿，顺利地改成了传媒大学站。 大概当时没什么人会想到，这个站开了个多大的坏头。 「企事业单位」时间跳到 2008 年底。北京市规委公布了《北京市地名规划编制导则（征求意见稿）》。其中首次提出： 一般不以人名、企事业单位名称作地名。 北京有名或者无名的高校，大多数都是「事业单位」（虽然其余的是企业单位，也没差），这样一来就都成了一般不作地名的主体。 实际上即便是在此之前，2005 年公开征求意见（而且开设了网上投票）的 4 号线站名，也有两个很奇怪的车站。一个叫人民大学（工程名称：双榆树），另一个叫北京大学东门（工程名称：成府路）。虽然确实，人民大学这站，没法叫人民大学 X 门；但是为什么北京大学东门要叫「北京大学东门」而不叫「北京大学」呢？ 当时有这样的小道消息：人大出具了一份红头文件（至于是谁开的，多大级别，并不明确），硬是把这站改成了人民大学。 不论这则小道消息的真假，人民大学和北京大学东门之间的格式差异，确实看起来像是发生过一些变动。规委最初并不接受人民大学这个站名，而后屈服于某种压力才把站名改过来，这样的可能是有的。而至于北京大学东门，可能性就很多了。 不管怎么样，2009 年初，上面所说的《导则》顺利地开始试行，北京地铁带着 3 个高校站名进入了现在的站名命名机制。 虎视眈眈的高校接下来的戏码只有两种。一种是高校没有其他潜在的竞争者，顺利拿下站名。另一种是两所高校之间竞争站名，最后两败俱伤。 ——是的，从 2009 年开始公示站名至今，尚未出现某高校在没有竞争者的情况下争取站名失败的情况。 而另一个现象是，市属高校获得了很大的话语权，一方面是他们的行政级别，而另一方面是市属高校往往远离高校集中区，没有人和他们抢。 2012 年，公示了 10 号线二期站名。其中出现了一个站，叫首经贸（工程名称：樊家村）。樊家村当然是个小得不能再小了的地名，但是和违反《导则》的「首经贸」相比，还是一个很好的选择。而规委对于首经贸违反《导则》的解释则是，使用周边的「首经贸北路」「首经贸南路」的名字命名——可这俩路名不就是企事业单位命名的？ 2014 年，征集 6 号线二期站名后未经进一步公示便直接推出。其中出现了物资学院路站（工程名称：物资学院；命名预案名称：富河）。这一次，据说物资学院出动了整个领导班子。这个车站很明确，就是用路来起的；当然，仍然是明显的自欺欺人。 2015 年，公示了 14 号线中段站名。其中出现了北工大西门站（规划阶段名称：松榆；工程名称：北京工业大学）。与一些其他线路不同，14 号线规委介入车站命名比较早，因而从工程名称开始就已经改叫大学了；而这站很不幸，位于西大望路和松榆北路交汇处，离北工大路很远。为了「自洽」，他们又搞出来一个「西门」，不知道和北京大学东门有多少关联。 2016 年——是否会有「农大」命名的车站（工程名称：肖家河）？我们拭目以待。 还有争夺战这种事发生了两次。 一次发生在 2010 年，当时公示了昌平线全线站名，有一座叫亢山广场的车站引起了附近同学们的注意。位于路北的中国政法大学昌平校区的同学们，和位于路南的中国石油大学（北京）的同学们，在网上开始了争夺站名的舆论战（题外话，那时候主战场还是人人网）。 昌平线二期 2015 年底才开通，那个时候的同学们，都已经毕业了吧——没毕业也没关系，由于方案调整，这座车站取消了。 还有一次发生在 2014 年，公示了 15 号线一期西延站名，位于京包铁路和规划双清路之间的清华东站成了争议的焦点。清华大学坐拥「清华园街道」之利，而且因为站后折返线伸入学校影响精密仪器实验，在此前规委召开的协调会上已经内定了这个妥协气息很浓的站名；而北京林业大学的同学们则抓住车站距离清华大门很远不放，也有一些同学以为北林正门外的区间竖井是地铁站，认为应该叫「北京林业大学」。由于是 Top2 和某普通 211 大学之间的争夺，因而不论有良还是无良的记者都偏向于北林。 最后，直到「清华东路西口站」的牌子挂出来，我们才知道结果——真是个「准确」（负面意义上的）的名字。那是规委从 2009 年至今唯一一次没有在网上公布站名公示结果。两座学校的能量，可见一斑。 尾声也许是规委自己知道干不下去，在 2015 年 1 月公示的地方标准《北京市地名规划编制标准》（《导则》的升级版）中，移除了不以企事业单位命名的条款。不过这标准自公示至今未见正式公布，也许还有很多人反对吧。 注： 北京不接受企事业单位名称命名地名肯定要较上述《导则》要早（如 2008 年 10 号线一期部分车站），但没有找到具体文件证明此事。 2005 年的征集意见（及网上投票）中「人民大学」获得了较多的支持。还有当时采访路人，路人都不知道双榆树在哪的说法。 「首经贸北路」只在一部分地图上找得到，其他地图中这条路没有名字。在各大街景中看不到路牌。 昌平线站名 2010 年公示的结果中，二期的 6 站由于站名未定而暂缓命名。大约在 2013 年取消了其中 2 站，亢山广场站即为这 2 座车站之一。 清华东路西口站的公示较为复杂，规委为了使得「清华东站」更加站得住脚，将这座车站按照 13 号线加站的名称进行公示。13 号线加站在京包铁路西侧，而 15 号线车站在京包铁路东侧；如果仅考虑到围墙的直线距离，13 号线加站距离清华大学更近，而 15 号线车站距离北京林业大学更近","link":"/2018/03/13/%E5%8C%97%E4%BA%AC%E5%9C%B0%E9%93%81%E5%92%8C%E5%A4%A7%E5%AD%A6%E7%9A%84%E6%95%85%E4%BA%8B%EF%BC%88%E4%B8%80%EF%BC%89/"},{"title":"【简讯】Vultr 特大优惠","text":"美国新泽西美国新泽西 Vultr 失了智！失了智！王八蛋老板不发工资，绿油油的美元免费送！免费送！ 咳咳，认真地说，著名 VPS 提供商 Vultr 现在提供特大优惠，注册就送 100 美元，有效期两年。注册之后需要提供支付信息，只需绑定国际信用卡或者使用 PayPal 充值一美元即可领取，在这一步暂不支持支付宝，不过正常领取之后就可以正常使用支付宝充值了。单击链接 直接注册！没有国际信用卡的朋友，提前注册一个 PayPal 并绑定国内储蓄卡便可。 （没错这是一篇非常简单的简讯。站长已经消失了半年，现在正沉迷 Netflix 无法自拔……下一篇就介绍一下国内观看 Netflix 的全流程操作，一定不会等太久了！请相信我！同时，如果身在国内且有使用 Netflix 的意向的话，建议这次先把 Vultr 的羊毛薅到手，等下一篇教程出了再参考搭建科学上网服务，尝试观看 Netflix （预警：由于 Netflix 对各家 VPS IP 段的封锁，不能保证 100% 成功））","link":"/2018/09/09/%E7%AE%80%E8%AE%AFVultr%E7%89%B9%E5%A4%A7%E4%BC%98%E6%83%A0/"},{"title":"国内观看 Netflix 全流程指北","text":"Netflix（中文名：网飞或奈飞）是一家以在美国进行邮寄 DVD 出租业务起家的公司，现在其经营重点是网络视频点播服务，市值超过 1500 亿美元。简便理解，Netflix 是一家拥有超强版权和创作能力的全球版优酷/爱奇艺，其运营地区包括除中国大陆、朝鲜、叙利亚和克里米亚之外的所有国家和地区。Netflix 拥有一大批优秀版权资源和自制剧作品，包括前几年大热的纸牌屋、绝命毒师、马男波杰克、瑞克和莫蒂，以及近几年一经推出便广受好评的王冠、毒枭、怪奇物语等等电视剧，以及相对而言稍逊一筹的电影内容，对于美剧爱好者等一类人来说，其数量和质量都远高于国内视频网站所能提供的内容。 不过，正如前文提到的，Netflix 目前在大陆尚未开展业务，我们若想观看则必须使用代理等手段。本篇文章的目标读者即是有一定科学上网经验、从未接触过 Netflix 的人，希望通过这篇文章让大家能接触到这样的优质服务。 认识 Netflix1. 注册及费用Netflix 和国内视频网站一点很大的不同是，不存在免费用户以及广告。相比国内视频网站为免费用户提供的播放前动辄两分钟、甚至播放中途强行插入的广告，以及付费用户专属广告，Netflix 可以说是十分良心，没有任何干扰用户的行为。当然，这也建立在其较高的订阅费用基础上——方案分三档，美区售价每月分别为 7.99、10.99、13.99 美元，其他各区售价为相应价值的当地货币。值得一提的是，上月土耳其里拉大跌，土耳其区的售价一度极低，吸引了许多人注册土耳其账号。但 Netflix 很快调整了土区的售价，现在土区的优惠力度应该已经没有当初那么诱人了。（但是还是很不错的！第三档售价 41.99 里拉，折合人民币大约 51 元。） 如图所示，三档不同方案的区别在于分辨率及同时在线设备数，分别为标清/高清/超高清及 1/2/4 台。如果你只想尝尝鲜，在手机上偶尔看看，选择 basic 即可；若经常在电脑上观看，则能达到 1080P 的 standard 较适合；而若你拥有一台 4K 电视、或想要与他人合租、或与家人共同观看，premium 方案能给你带来最高级的享受。另外，新注册用户首月免费，可以先试用一月，看看 Netflix 是否成为你的刚需，再考虑选择哪一档方案。 2. 内容及观看注册并设置好账号进入主页后，首先需要选择几个自己感兴趣的剧集，有助于 Netflix 更精确地进行推荐。随后，Netflix 会显示如下界面： 这是站长的主页，之前根据兴趣选择的实习医生格蕾、黑镜等剧已被保存在我的列表中，在之后看到喜欢的剧也可以随时加入列表；另外，站长正在观看的马男波杰克和星际迷航则还由“继续观看”列表保存，每次打开之后一键点击就能从上次结束的位置继续观看，无脑操作十分方便。或许你已经注意到，有的剧封面上有红色的 Netflix 标识，这代表该剧是 Netflix 自制剧，这样的剧通常来说分辨率都能达到 4K，并且不论所在区，通常都有中文字幕；而无 Netflix 标识的剧则代表是其购买版权的第三方剧，中文支持情况取决于所在区，通常港区或新加坡区绝大部分剧支持中文字幕。 说到地区，Netflix 实行分区制度，面向各个国家和地区提供不同的内容，各区的电视剧和电影数量可以参考这个网站。美区无疑内容最为丰富，不过由于版权原因，有时候其他区也有一些美区没有的剧，例如港区的瑞克和莫蒂。并且，Netflix 是按 IP 地址而非账号分区，也就是说无论你注册时处在，只要切换 IP 便可观看不同地区的内容，十分方便。 Netflix 观看平台包括桌面端浏览器/应用/手机 APP/电视（盒子)，其中 PC 端 Chrome 只支持 720P 分辨率，可安装 Netflix 1080P 拓展解决，而 Edge 可达到 4K 分辨率; Mac 端 Chrome 同上，Safari 则仅支持1080P。 Netflix UWP 应用支持 4K，不过国区应用商店未上架此应用。好在微软的区域限制十分宽松，只要在“Windows 设置-时间和语言-区域”中将区域改为美国即可。不过，UWP 应用由于其自身的限制，Shadowsocks 类的软件并不能对其进行代理，可以参考少数派这篇文章的解决方案。而在手机端，Android 若 Play Store 无法下载，可前往 APKMirror 搜索下载；iOS 方面，国区 App Store 同样未上架，需切换成美区商店下载。美区 App Store 的注册及使用教程一搜一大把，在此就不赘述了。电视端的情况较为复杂，有需要的读者可通过参考文章进一步了解。 选择代理站长本来计划在这一部分介绍一下在 Vultr上手动搭建 Shadowsocks 的操作，可是由于懒惰 Vultr 的速度其实并不理想，加上其被 Netflix 大量封锁 IP，要想找到能够使用的 IP 基本不可能，因此也就不在这里推荐这种方法了。要想观看 Netflix，最方便的办法依然是直接购买代理服务，例如站长购买的这家（有 AFF)，在速度、稳定和价格的不可能三角中基本落在最符合我需要的地方。 后记Netflix 的订阅费相比国内各大视频平台确实有些昂贵，不过其优质的内容和服务确实也值得这个价钱。此外，在酷安、v2ex、Telegram 等平台经常有合租信息，有意向的读者可以考虑四人合租 Premium 套餐，每月 20 多元的价格便和国内平台相差无几了。此外，还可以加入这个 Telegram 频道，在其中可以讨论各种疑难杂症，以及加入合租车等。等等，Telegram 不是被墙了吗？那么下一篇博客的主题也有了！ 参考文章在中国看 Netflix（网飞），看这一篇就够了","link":"/2018/09/16/%E5%9B%BD%E5%86%85%E8%A7%82%E7%9C%8BNetflix%E5%85%A8%E6%B5%81%E7%A8%8B%E6%8C%87%E5%8C%97/"},{"title":"Telegram 专用轻量级代理——MTProxy","text":"2022/04/17更新：如今由于极易被识别，已不建议使用此方案。 Telegram 是一款跨平台即时通讯软件，目前已覆盖移动端（Android、iOS、Windows Phone、Firefox OS）、桌面（Windows、macOS、Linux）和网页全平台，甚至还有 Chrome 扩展（说实话，这是我见过覆盖最全的软件……），其主打特点是安全和隐私，防范的对象包括各国政府和商业公司两方面。 由于创始人杜洛夫兄弟的个人经历和信仰，Telegram 不仅拒绝政府的监控，甚至号称不以盈利为目标、因而不接受商业机构的投资和收购。目前，Telegram 主要资金来源仍然是帕维尔·杜洛夫的个人注资，因此其独立性和安全性仍然值得信赖。事实上，正是由于 Telegram 太过安全，使其一度成为 IS 恐怖分子的联络工具，迫使 Telegram 官方封禁了上百个涉及恐怖主义的群组。恐怖分子为 Telegram 的安全性实力代言啊。 众所周知，这种不受监控的互联网服务在墙内通常是无法正常使用的。传统的办法是使用普通的代理工具，不过这对本身没有越墙需求的用户来说不太友好。为了使用一个软件而频繁开关另一个软件，加大了 Telegram 的使用成本，这也是阻碍其在国内推广的一个重要因素。不过，今年 4 月俄罗斯政府也封禁了 Telegram，而 5 月其官方就推出了这篇文章的主角——MTProxy，可以看作是 Telegram 为应对政府的封禁而主动提供的应对方法。至于创始人杜洛夫兄弟秘♂闻、Telegram 界面和操作方法等内容，本文就不介绍了，网上一搜一大把。如果你实在懒得搜也可以参考少数派、爱范儿和这篇博客，对其有一个基本的了解。 MTProxy 设置今年 5 月之后更新的 Telegram 版本，包括站长拥有的 Android、iOS 和 Windows 端都已经内置了这一代理工具。具体实现原理我们无需关心，只要知道怎么设置即可。以安卓客户端为例，打开『设置-数据和存储-代理设置』，点击添加代理，选择 MTProto 代理，填入服务器、端口和密钥信息。随后返回上一级页面，打开使用代理服务器开关即可。 不过，略微麻烦的是，Telegram 在登录之前无法进行设置，而若没有可用的代理则又不能登录。因此，在操作之前还是需要自备一个代理软件，要求就很随意了，限速限流量都没有关系，只要登录 Telegram 之后便可抛弃。 自行搭建代理服务道理我都懂，那么服务器信息要从哪来呢？这里就要用上我们之前薅到手的 Vultr 羊毛了。首先要知道，一切代理服务的本质就是用户访问境外没有被墙的服务器，由服务器代用户访问被墙的服务并返回数据。因此，首先我们需要一台境外服务器（严格来说，我们即将使用的 VPS 和独立服务器并不是一回事，但作用相同）。 打开 Vultr，点击右上角的『+』号添加 VPS，以下序号对应添加界面的序号： 地区：从国内访问，东京、新加坡或者美西几个城市都是不错的选择； 系统，选择 Debian 8 x64，便于使用之后的脚本； 规格：若你的网络有稳定的 ipv6 连接，可以选择最便宜的每月 2.5 美元，否则选择 3.5 美元那款也可； 若非选择 2.5 美元的规格，同时也有 ipv6 需要的话，务必勾选『Enable IPv6』。 5、6、7 三步留空即可。点击『Deploy Now』。 稍等片刻，等 VPS 部署成功之后，便可以进行搭建服务的操作了。首先，我们需要连接到 VPS 上。Windows 端可使用 Putty 或 Xshell（教育用户可免费使用，并且不需要教育网邮箱或学生证），Mac 端直接使用 terminal 即可。以 xshell 为例，点击左上方的新建会话按钮，在主机一栏填入 VPS 的 IP地址，弹出的安全警告中选择『接受并保存』，输入用户名『root』和密码，之后便成功连接了。 以下内容基本来自逗比根据地的这篇文章，建议有越墙能力的读者直接访问，更为详尽。 或者修改 hosts 文件，在末尾填上一行104.16.248.1 doub.io，之后访问https://doub.io 连接成功之后，粘贴并回车执行下面的代码： 1wget -N --no-check-certificate https://raw.githubusercontent.com/ToyoDAdoubi/doubi/master/mtproxy.sh &amp;&amp; chmod +x mtproxy.sh &amp;&amp; bash mtproxy.sh 运行后出现菜单，选择『1』安装。随后的端口可在提示范围内随意输入，建议输入 10000 以上的数字。之后的步骤都听从脚本的建议，一路回车并等候安装，直至出现这个界面： 恭喜你！你已经成功安装好了自己的 MTProxy 服务，接下来只要复制第一行链接（其实使用第二行链接应该更为简便，但是不知道为什么我这里一直无法成功）并发送到 Telegram 里任意一个对话（如『保存的消息』，这样就只有自己能看到，不会影响别人），点击之后便可自动添加并开启代理。接下来便可以关闭其他的代理软件，把 Telegram 当微信使用了！ 这里也提供我自己刚刚搭建的 MTProxy，可用时间为一周或者直到 IP 被封。tg://proxy?server=66.42.109.48&amp;port=23424&amp;secret=dd64a3c3f7442a3b36b371a9e135db2a0d如果你的 VPS IP 被封了（可以使用这个网站检测，国内 ICMP 和/或 TCP 结果失败即表示被封），直接销毁后重新部署一台即可。 另外，逗比根据地还提供了 bbr 等优化 VPS 的一键脚本，有能力访问的读者可以多加查阅，这是一个非常有用的网站。","link":"/2018/10/03/Telegram%E4%B8%93%E7%94%A8%E8%BD%BB%E9%87%8F%E7%BA%A7%E4%BB%A3%E7%90%86%E2%80%94%E2%80%94MTProxy/"},{"title":"更新说明","text":"没想到吧！我胡汉三又回来啦！ 一只萌新诞生在 2017 年 2 月，也就是说这个域名和之前使用的主机续费时间也是在二月。今年趁这个机会，对博客进行了一次比较大的改版。首先是为了省下一半的钱使博客更加轻量化，不再续费主机及使用 Wordpress，而是改用 Hexo，并将其托管在 Github Pages 上。使用 Github Pages 的考量在于其网络比之前的香港主机稳定很多，站长我就不用考虑如何加速国内访问了，正常情况下国内各地到 Github 的网络都是没问题的；但是，上述只是『正常情况』，Github 向来不受赵家待见，历史上也出现过短暂的封锁事件。不过作为世界上最大的代码存放网站，Github 对国内的互联网行业极为重要，在可预见的将来不太可能被全站永久封锁（当然宪都能修，这也不是不可能发生，真到了那一天再寻找别的去处吧）。不过，不被封锁不代表访问非常顺畅，偶尔国内访问 Github 也会出现缓慢、不稳定等情况，若不幸遇上请切换网络环境或稍后再试。 至于 Hexo，站长对其早有耳闻，这是一个快速、简洁且高效的博客框架。相比于 Wordpress 的全面而缓慢，Hexo 操作起来略微更加困难，然而更加高效，即使数百篇文章也能在几秒钟之内生成完毕（听说文章数上万之后 Hexo 也会变得很缓慢，不如 Hugo 快速，但估计一只萌新的文章永远达不到这一数量）。此外，不同于 Wordpress 需要登录后台管理， Hexo 更多的是在本地编辑，完成后简单几步操作发布文章即可。这样站长能专注于本地 Markdown 文件，不再有面对本地与 Wordpress 数据库两部分文章的割裂感。 不过，使用 Hexo 的直接诱因还是数月前在 V2EX 看到的这篇文章。和 Hexo 默认提供的那几个主题相比， Icarus 干净、明快的风格直戳我心，可以说是站长目前为止见过的最漂亮的博客主题。发现这篇文章时就下定决心切换到 Hexo，到寒假终于找到时间，如愿以偿。 之前和朋友闲聊时统计了一下一只萌新的情况，2017 年更新了 29 篇，2018 年只更了 5 篇。这个数字实在不好看，我也是问心有愧的——去年并没有花什么心思在博客上，有时候想到该写博客却又去做其他事情了。换用 Hexo 后，尽管搭建过程复杂了些，但写作却变简单了，只要新建文件——码字——发布即可。没有了 Wordpress 各种插件、格式等的干扰，争取回归写作本身。 当然，没有丰富的插件必然也会导致一些不便，例如评论。Icarus 提供了多种评论插件，本站目前使用的是 Valine。其优点是干净简洁，缺点则是评论通知非常不便；而 DesertsP 开发的 Valine-Admin 能很好地解决这个问题，然而需要向国内公司做实名认证，故目前暂时没有使用的想法。若需要回复的评论长时间没有得到回复，请直接猛击左侧的『联系我』！ 最后，一只萌新使用的图库这几天似乎有些不稳定的迹象，以前发布的文章有些图能正常显示，有些则不能。再观察一段时间，若问题一直持续则会切换图库。（这也是 Hexo 的一个好处，在 Wordpress 上更改文章需要更改本地和已上传的双份，而 Hexo 只需要更改 Markdown 文件，然后重新发布即可） 噢，one more thing。 其实大约一周前一只萌新就已经完成了改版，但为什么今天才发更新说明呢？当然是因为家里没有酒喝啊！站长已经习惯了伴随着一罐啤酒写文章，微醺之下文笔似乎也更加顺畅了。","link":"/2019/02/21/%E6%9B%B4%E6%96%B0%E8%AF%B4%E6%98%8E/"},{"title":"RSS 与 Windows 端阅读器推荐","text":"一个典型中国现代城市青年的一天可能是这样的：早晨醒来第一件事先刷刷微博/即刻等信息流 App，通勤路上再浏览一些微信公众号，坐定之后（有志青年）还会打开传统新闻网站/App 查看当日新闻。而有了 RSS，所有这些信息都可在一处解决（最多电脑+手机两处）。 RSS（Really Simple Syndication，简易信息聚合）是一种消息来源格式规范，用以聚合经常发布更新数据的网站，例如博客文章、新闻等。它不是一个网站或一个 App，而是一种规范，只要有足够多的内容提供者按照这种规范提供自己的内容，获取者就能在一处获得自己需要的所有信息。 从上面说明可以看出，RSS 是用户在本地直接获取到网络上各种内容，这样对用户是方便了，但对内容提供者而言就意味着流量损失。用户都不上你的网站/用你的 App 了，广告收入必然下降很多，因此许多内容提供者并不会提供 RSS 订阅链接。这时就需要请出 RSSHub 了，它『是一个轻量、易于扩展的 RSS 生成器，可以给任何奇奇怪怪的内容生成 RSS 订阅源』。它可以部署在 Windows、macOS 和 Linux 上，也就是一般的个人电脑或 VPS 等设备均可。如果嫌麻烦/没有编程常识，也可以使用 RSSHub 本身提供的链接。不过多人使用同一服务可能被内容提供者针对性限制，并且 RSSHub 官方也从未保证其服务的可用性，所以在可能的情况下还是尽量部署到自己的设备上比较好。 至于如何生成自己需要的链接，RSSHub 的说明已经非常详尽了，并且这一步不需要任何编程常识，人人都能会，所以站长也不细说。此外，RSSHub 也不是获取 RSS 链接的唯一途径，许多网站自行提供了 RSS 链接。不过，这些链接通常只提供了文章的标题和摘要，浏览之后若感兴趣还需要跳转到原网站继续阅读（还是为了引流）。如果嫌麻烦，可以自行查找 RSS 摘要转全文的方法，或是在 RSSHub 寻找是否有自己需要的内容，因为这上面的基本都是全文链接。 总之，假设你已经取得了自己需要内容的链接，随意打开一个，绝大部分的格式都是这样： 因为 RSS 需要通过纯文字实现排版，故在内容中混杂有大量的排版信息，无法直接阅读，因而我们需要一个 RSS 阅读器。这方面的推荐网上林林总总有很多，站长在这里推荐的是一个相对小众的 UWP 应用——Newsflow。 作为 UWP 应用，Newsflow 的设计简洁明了，对触屏支持良好，并且能够利用 Windows 原生通知及时推送重要信息，对中轻度用户来说功能也足够用，因而站长选择了它而非全面而庞大的 Feedly 等阅读器。 使用之前首先需要添加订阅源。点击左下方的地球图标或使用快捷键 Alt+U 打开订阅源页面，在右上角选择『添加』，输入之前获取的链接后回车，搜索到内容后点击进入预览。Newsflow 提供了标题、卡片、杂志和文章四种视图，后三者都会加载文章中的图片，故建议所有地方都选择标题视图以加速加载。若订阅源满足需要，则点击右上角的『添加』，在接下来的页面可以自定义标题、描述、分类、通知等，尤其是通知部分，可以根据该订阅源的重要和紧急程度自定义通知方式，避免被不停弹出的消息过度打扰或者错过需要第一时间了解的内容。 适当的通知——这也是 RSS 的精髓所在。生活在信息爆炸的当下，很多人都曾被手机里充斥的各种通知弄得焦头烂额，而 RSS 就像一种宣誓夺回获取信息自主权的宣言。用户自己决定在什么时间看什么内容，拒绝被商业公司无休止的『推荐』所绑架。此外，无处不在的『人工智能』和『算法』让我们能看到的东西越来越符合自己的口味，换句话说也就是眼界越来越被限制。而 RSS 只要在一开始订阅不同的内容，就始终能听见不同的声音。这在一个民粹化的时代，意义不言而喻。 要获取一只萌新的 RSS，请单击顶部菜单！","link":"/2019/02/24/RSS%E4%B8%8EWindows%E7%AB%AF%E9%98%85%E8%AF%BB%E5%99%A8%E6%8E%A8%E8%8D%90/"},{"title":"免费美国教育邮箱申请与美区 Spotify 羊毛思路","text":"美国教育邮箱申请大家都知道，在购买景区门票时学生身份通常能获得不错的折扣。而教育网邮箱就相当于线上的学生证，用途包括在微软/苹果等商店获得教育折扣、购买软件或订阅服务享受学生价等（比如站长写这篇文章时正在使用的 Yu Writer 就给学生提供半价优惠）。一般而言，国内大学或发达地区的高中都会给每一个学生分配一个邮箱，用这个邮箱申请国内的一些教育优惠是足够了——站长上个月在微软商城购买的 Surface Pro 键盘盖就便宜了一百多块。 然而，教育邮箱细说起来也是能分三六九等的，国内邮箱结尾基本都是 @edu.cn，注册国外有些服务的时候并不好用。因而本着薅羊毛的精神，我们可以选择申请国外的教育邮箱，而最常见的当然是美国了，因为美国教育邮箱结尾是单纯的 edu，简洁好看，也非常实用。此外美国几乎再差的学校也订阅了谷歌、微软等公司的服务，能用上无限或超大容量的 Google Drive/OneDrive、Office 365 等。好处这么多，这篇文章就谈谈怎么搞到一个以纯 edu 结尾的邮箱。 概括地说，我们需要向某所大学申请入学，审核通过后就会发给申请者一个学校账号，即可用的 edu 邮箱。而不要求申请者能力、只要信息齐全就能通过的学校，自然也不可能是什么好大学，基本都是各地的 community college（想要搞到 xxx@harvard.edu 的人可以洗洗睡了）。这样的社区大学有很多，站长选择的是 Ozarks Technical Community College。至于原因？一是邮箱结尾为 @otc.edu，短小美观；二当然就是 Netflix 的黑钱胜地（Ozark）啦！没有看过的话可以一看，还是挺有意思的，豆瓣第一季 8.2，第二季 8.7。 言归正传，首先打开申请页面，如图： 申请时需要填写全套美国人身份，其中最麻烦的是 SSN 社会保险号，不能随意编造。打开这个虚拟身份生成网站，可以指定自己喜欢的性别、所在州等，生成一个虚拟身份。不过要注意的是，最好在谷歌地图上验证一下所给的地址是否存在，如果有问题可以在附近选择一个真实地址，保证邮编相同即可。 之后就是复制粘贴啦。若选择了自己有高中学历，则会要求你填写高中的名字，这时候也可以在谷歌地图上找找自己地址附近的中学。一切填写完成之后点击提交，一般在一个工作日内就会通过申请（资料需要认真填写，因为也有申请不通过的先例，多半是资料过于随意），还是很快的。另外，要记住自己所用身份的生日，通过后发给你的学校账号初始密码就是生日，要是忘记了只能哦豁。推荐截图保存。 资料没问题的话，一个工作日后注册时填写的邮箱里就能收到学校的录取通知了。根据邮件提示进入 MyOTC 后台，点击顶栏的 email 就能跳到 Outlook 的网站，说明 OTC 使用的是微软 Outlook 的域名邮箱服务。收藏一下这个页面，以后直接用邮箱和密码登录就可以了，不必再从 MyOTC 后台跳转。 在邮箱页面点击右上角的头像，进入账户管理页面，在这里可以看到 OTC 给学生提供的是 Office 365 A3 订阅，权限如图所示： 大家用得最多的可能就是 Office 最新桌面版本了。在左侧点击『安装状态』，选择『安装桌面应用程序』即可下载最新的 Office 365 安装包。另外，这一账号还提供 1024 GB 的 OneDrive 存储空间，只要在 OneDrive 设置里添加账号即可。不过要注意，学校管理员是能看到你上传的内容的，并且站长目前还不确定到了入学时间而申请的这个人实际没有报道的话，这一账号会不会失效。因此，建议提供的这一 OneDrive 不要储存私密或重要的信息，短期储存一些大文件即可。 美区 Spotify 学生优惠edu 邮箱还能做什么这里就不赘述了，这方面信息一搜一大把。站长这里想介绍的是关于美区 Spotify 羊毛的一条思路，目前在中文互联网上还未找到相关信息总算有点原创的东西了。之所以说思路，是因为站长并未成功……或许仅有一个美国教育邮箱是无法成功的，又或许只是 OTC 的邮箱问题，这方面需要更多的证据支持。所以，以下的内容看看就好。 美区 Spotify Premium 常规定价是 9.99 美元/月，以前是只有这一项内容，但最近特别推出了和 Hulu（有广告版）绑定的服务，同样的价格还提供一个 Hulu 账号。而学生版则长期（从数月前站长发现这个页面起）提供 Hulu 和 Showtime 账号，并且只需 4.99 美元/月。这个价格甚至不用拼车，个人购买也可接受。要注意的是，这一绑定优惠只存在于美区（毕竟 Hulu 和 Showtime 都只在美国开展业务）。 不过，Spotify 的学生认证不同于 Apple Music 直接提供教育邮箱，而是使用了 SheerID 的服务，需要用户提供姓名、邮箱和学校名称，由 SheerID 进行验证。站长就是在这一步失败了——OTC 存在于 SheerID 的名单上，但使用这一身份无法通过认证。推测的原因是站长所使用的身份尚未入学，而只有真正入学后在名单上的学生才能通过认证。读者可以尝试申请别的学校的邮箱，看看能不能通过验证。（可以的话请告诉站长！） 后话搞不定学生优惠的的话，还可以用最常见的办法——家庭组开车。可以前往逮虾户自己发车或寻找司机，也可以在 SpotiCheap 直接上车。后者价格比前者稍高，但好在由第三方商业化运营，免去了与其他个人用户直接沟通的麻烦以及后期可能存在的扯皮，大家可以自行取舍。Spoticheap 已经翻车，还是上个人车比较稳。","link":"/2019/03/14/%E5%85%8D%E8%B4%B9%E7%BE%8E%E5%9B%BD%E6%95%99%E8%82%B2%E9%82%AE%E7%AE%B1%E7%94%B3%E8%AF%B7%E4%B8%8E%E7%BE%8E%E5%8C%BASpotify%E7%BE%8A%E6%AF%9B%E6%80%9D%E8%B7%AF/"},{"title":"更改评论系统通知","text":"昨天一觉醒来收到了这封邮件： 自从今年初博客改为 Hexo 之后，一只萌新一直使用的是 Valine 评论系统，并配合 LeanCloud 的后端实现邮件提醒等功能。当时还由于原版 Valine 的评论管理太难用，使用了 valine-admin 来实现更好的功能。valine-admin 中可选的一个步骤是定时唤醒来及时通过邮件推送新评论通知，但要实现这一功能就需要向 LeanCloud 上传手持身份证照片做实名验证，因而站长就一直没采用这个功能，这几个月博客上的新评论通知完全随缘（好在也没有评论）。 没想到还是没躲过越来越严格的网上实名制，现在也只能更改评论系统了。今天比较了一下使用的主题 Icarus 直接支持的几个评论系统，Disqus 尽管可能是最方便好用的，但是太丑，并且处于被墙状态，需要访问者拥有通畅的国际互联网连接，而本博客的读者大都没有这个习惯。又尝试了一下 LiveRe，设置倒是顺利，但不知为何在测试访问时永远也加载不出来，只能 pass。剩下的不用备案、站长能看懂怎么设置的就只剩 Gitment 和 Gitalk 了，前者的作者网站域名证书过期了一直没管，不知道是否弃坑，因而选择了后者。 其实 Gitment 和 Gitalk 两者都是利用 Github 的 Issues 功能实现的评论，因而评论者必须要有一个 Github 账号才能使用，这也是站长没有第一时间选择这两者的原因。但由于愿望列表中前几项都因其他原因被 pass 了，因而只能选择这一系统。要想评论的读者，可以到 Github 注册一个账号，再回来在文章页面一键登录，就可以留下你的评论了。","link":"/2019/06/26/%E6%9B%B4%E6%94%B9%E8%AF%84%E8%AE%BA%E7%B3%BB%E7%BB%9F%E9%80%9A%E7%9F%A5/"},{"title":"再次更改评论系统","text":"今天收到之前使用 Valine 评论时后端服务商 LeanCloud 的邮件，随意翻了一下，发现他们提到了加快国内外分开运营。灵机一动，在他们的国际版网站注册了一个账号，果然没有强制实名认证，并且用来定时唤醒的 Web 主机域名也不需要实名认证了（之前使用国内版时，就因为要实名认证一直没有做这个，导致有评论也很难收到通知虽然也没有就是了）。马上行动，好看更好用的 Valine 评论系统又回来了！☟","link":"/2019/07/09/%E5%86%8D%E6%AC%A1%E6%9B%B4%E6%96%B0%E8%AF%84%E8%AE%BA%E7%B3%BB%E7%BB%9F/"},{"title":"中国移动英国 &#x2F; CMLink 手机卡","text":"19.12.25 更新：已经收到短信通知，由于漫游时间超过了在英国本土使用时间，漫游上网功能被关闭了。目前还可以正常收发短信（或许还包括接打电话，没尝试过）。 为什么需要一张境外手机卡呢？让我下定决心的是今年上半年有一次在淘宝买东西，确认收货后没有再打开过 App，没想到几天后卖家直接用私人号码发短信过来要求好评。于是上网搜了搜，买了一张保号很便宜的 Lycamobile 的 SIM 卡，用来绑定了很多账号（然而买它的初衷却无法实现——网购留国外号码的话快递联系不上，卖家还是会要求提供中国手机号）。现在想想，拥有一张国外实体手机卡的用处大概有以下几点： 保护隐私，拒绝网络实名制和垃圾短信（只是对于对方而言，对国家来说不存在的，因此不要以为用了国外卡就可以为所欲为，要是有敏感信息需要处理还是用 Google Voice 这一类的 VOIP 比较好）； 提供应急上网手段，在例如儿童节前后大爆炸时防止失联； 用于绑定 Telegram（等），防止 +86 的负面效应。 此外，根据选择的境外卡的不同，还可能有以下功能： 美国 +1 开头的号码，可以用来申请 Google Voice、美国银行开户等； 用欧盟号码注册账号，受 GDPR 保护（例如用欧盟号码注册的微信就会按照 GDPR 要求，向用户提供下载自己全部信息的途径）。 不幸的是，我购买的 Lycamobile 卡在用了没多久之后就翻车了。或许是在中国使用的人太多，它限制了在中国境内的 pay-as-you-go 服务，必须开通每月最低 19 刀的套餐才能使用，而这大大超出了我对于一张主要用来收短信的卡的承受范围。重新寻找了许久，申请了三次 giffgaff 都没有收到之后（它只寄平邮，我在学校没能收到，能收平邮的朋友可以试试），我选择了中国移动英国的手机卡，理由包括： 尽管要脱欧了，但是英国把 GDPR 的规定都转移到了『Data Protection Act 2018』法案中，用这张手机卡能受到 GDPR 同等保护； 卡片免费，使用费用合理。这张卡本身免费，并且也可以免费快递到大陆（其实之前中国联通英国的卡也是如此，但申请的人太多，目前配送到大陆要 2 磅）。收到后充值即可激活，每次充值最低 10 磅，若没有开通三个月后会发短信提醒，六个月后会回收号码，因此至少五个月要充值一次。至于使用资费，如果平时用量较多可以开通套餐，价格也不算很贵，流量可以用于英国、欧盟指定地区、大陆和香港。 当然，如果你像我一样只是用来绑定账号收收短信，那就没必要开通套餐，因为收短信是免费的，充值后直接插卡使用就可以了。在中国漫游的资费如图： 流量出乎意料地便宜，平时用来刷刷 Telegram 也是可以的，不过因为要回源到英国，延迟略微有点高。 需要注意的一点是，官网上的公平使用条款中提到了如果漫游使用量大于在英国的用量，号码有可能会在无通知的情况下回收。但目前我看到了两个人的评论，一个人说只要卡里有余额就不会被回收，另一个人说在英国激活的卡受此限制，在其他地方则无所谓。因此这张卡还是可以谨慎看好的。","link":"/2019/07/30/%E4%B8%AD%E5%9B%BD%E7%A7%BB%E5%8A%A8%E8%8B%B1%E5%9B%BDCMLink%E6%89%8B%E6%9C%BA%E5%8D%A1/"},{"title":"几处小更新","text":"又是失踪人口回归系列。 闲来一算，一只萌新是在大一寒假时候建的，当时觉得这个名字挺贴切，大一萌新嘛。转眼间还没反应过来，就已经成了大四老狗，甚至研也考完了（虽然基本确定考不上就是了）。因此过了小半年，又有时间写写博客了。 几周之前，突然感觉本站的域名太长了，除了自己以外任何人都难以记住，所以打算买个短点的域名来用，顺便还可以以后当作自己的域名邮箱（假设我叫张三，那么用 i@zhangsan.me 当作简历上的邮箱该有多酷）。但思来想去，始终想不到一个合适的域名，因此尽管花 0.99 刀买了一个 .xyz 域名，但新鲜感过去之后也就迅速抛弃了它。今后本站的域名大概率还是会长期不变，拥有一个真名邮箱的梦想也还是遥遥无期（我的名字常见后缀域名都被韩国某公司注册了，让人气愤）。 不过既然这篇文章标题叫几处小更新，那么一只萌新确实也发生了一些变化。首先是页面左侧的个人信息标签，本站使用的 Icarus 主题更新之后，『联系我』变成了『关注我』。项目作者的 Demo 上指向的是他的 GitHub 页面，而我基本不主动使用 GitHub，并且在配置文件里翻了许久也没找到改回来的方法，因此就把这个按钮指向了我的 Telegram 频道。毕竟之前一直挂着我的邮箱，但也从来没有人单独发邮件，可以认为是没有什么用的。现在换成了 Telegram 频道，大家走过路过可以随手关注一下，我在上面更东西比博客勤多了！（就是随手发一些屁话而已） 此外，可能更有用的更新是页面右上角的一朵小云。前些日子看到了这篇文章，立马动手照葫芦画瓢搭建了一个网盘，现在已经上传了一些电影和电视剧。 目前已经换成 Alist 啦，比 FODI 强大许多。 FODI 这款程序相当不错，在上面的影音可以直接播放。不过因为后端是 OneDrive 的缘故，在国内能够访问但速度因人而异，如果直接在线播放感觉卡顿可以尝试使用代理。另外我的观影习惯是尽量使用外挂字幕，而 FODI 并不能如本地播放器一样自动加载同一目录下的字幕文件，因此如果像上图那样，一个文件夹里同时有字幕和视频的，那视频一定是生肉，想看熟肉需要把两个文件都下载到本地观看。不过我最近找到一款好用软件（下次更新有内容了），可以很方便地压制 MKV，目前已经把字幕和视频严重不同步的一部分电影（例如红心国王）调整好时间轴压成 MKV 上传了，在线就可以观看有字幕的版本。剩下的大部分电影、以及工作量更大的电视剧，还是等我有心情的时候再压吧。 此外，以后如果在博客上有什么东西分享，也就可以直接上传到这里，不再需要 Google Drive、蓝奏云一类的了。 最后一项可能都注意不到的更新，那就是本站的图片已经全面转向使用腾讯云 COS 自建的图床。之前一直使用的是第三方图床，总有一点担心要是突然倒闭，网站上所有图片都会消失（是的我没有本地备份，我知道这个习惯非常不好），因此还是在前段时间自建了腾讯云北京 COS 存储，并在前两天把所有图片都转移到了上面。尽管没有使用 CDN，但和之前的图床相比，腾讯云的速度在大陆各地表现也都应该足够优秀。当然，这是要花钱的，但就以本站的图片数和访问量来说，每个月几毛一块的支出完全在承受范围之内。用点小钱换来自己对自己东西的掌控感，还是比较安心的。","link":"/2019/12/25/%E5%87%A0%E5%A4%84%E5%B0%8F%E6%9B%B4%E6%96%B0/"},{"title":"上海短行","text":"考研之前就计划结束后去一趟上海，看看报的学校，另外也找同学玩一玩。考完后的周五出发，本来打算周一回北京，但发现德语考试要复习的东西太多，因此改签到周日晚上就回来了。这次旅行没什么特别之处，随便发几张图吧。 周五也就这样结束了。第二天起床前往上海博物馆参观两个特展，『美术的诞生：从太阳王到拿破仑』和『沧海之虹：唐招提寺鉴真文物与东山魁夷隔扇画展』。二者都质量颇高，并且持续到二月中旬，有时间的话推荐一去。尤其是将两者结合起来看，能感受到东方和西方艺术的强烈对比，非常有趣。 在各个版本里，我最喜欢的还是下面这幅 Gentileschi 的作品。原因？这个版本才像是真正的砍头，这里的朱迪斯才是一个有力量的人，而不是某个不知为何手里有个人头的柔弱的富家小姐。可以参阅豆瓣的这篇文章：女人画出的女人，和男性凝视中的女人哪里不同？ 『沧海之虹』不允许拍照，就没有照片了。总之它是相当不错的。 逛完出来已经快两点了，赶往从柳州开过来的西环肥仔吃了一碗螺蛳粉，确实比北京的水平有限水平高一些。 接下来就是在街头闲逛了。中途偶然遇到一家手工制衣店，进去发现一件羊毛外套，很喜欢，但看了看标价又默默放回去了。这就是生活中偶尔感觉『有钱真好』的时刻。 晚上回去发现全天一共走了 25000 多步，大概是我很久很久以来走过最远的一天了。教训：不要穿工装靴走远路，真的很疼。 本以为周日会下雨，就没有安排计划，打算在 Airbnb 里复习，没想到最后也没下。而打开书看了两页，发现自己不会的比想象的多多了，因而也就改签了当天下午的高铁，直接回北京了。现在想来，这也算是我为数不多的不顾计划、凭一时冲动行事的时刻之一。 对了，在来回的火车上看完了红心国王和无主之地。二者分别是来自法国和波黑的小众电影，同样地从特别的角度反映了战争。都不是什么热门片子，但都值得一看，戳右上角萌新网盘就可自取。 最后，祝大家新年快乐！","link":"/2019/12/31/%E4%B8%8A%E6%B5%B7%E7%9F%AD%E8%A1%8C/"},{"title":"Library Genesis——又一个找书的地方","text":"Library Genesis 是一个貌似由俄罗斯人创立的网站，用户可以在上面自由地上传和下载任意书籍。它有多个镜像站，因此有些读者可能知道这个网站，只不过不是通过开头给出的域名访问的，这没关系，本质都是一样的。在之前考研的时候，这个网站帮我找到了很多专业相关的书，其体验比各种充斥广告或者付费找书的（百度）网盘搜索网站好了不知道几百倍。 打开首页，可以按书名、作者、ISBN 等信息查找书籍，找到后打开详情页面，在下面的 mirrors 里随便选择一个（推荐第一个），打开之后点击大大的 GET 就可以下载到本地了。整个过程一气呵成，没有任何广告的干扰，体验非常优秀。 当然了，本篇文章的主要目的并不仅仅是推荐大家到这里下载，而是鼓励大家尽可能地多向这里上传自己的书籍。Library Genesis 并不是靠某个个人或组织在全网搜集书籍，而是完全依靠用户的上传，传的人越多，这个平台有的书就越多。因此，如果有可能的话，希望各位读者能把自己拥有的电子书，尤其是来之不易的那种，尽量上传到这里。知识共享是一件无比高尚的事情。 上传过程也很简单。点击 UPLOAD 下的第一项 Libgen upload（用户名和密码可按说明在 FORUM 下的 sitemap 中找到，目前用户名为 genesis，密码为 upload，不知道以后会不会变化），选择本地文件后点击 send（这一步可能有些慢，最好确保全局科学上网，并保持足够的耐心），在下一个页面填写本书的各种信息。一般而言填写上书名、作者、出版社、出版时间和 ISBN 即可，其中最重要的是 ISBN，相当于全球任意一本书的身份证号，确保其正确就可实现与书籍的一一对应。其他的信息若知道填上也无妨，最后点击提交就可以了。没有任何审查，用户提交的书籍立马就能出现在数据库中，对所有人开放下载。 配合上油猴的豆瓣资源下载大师脚本，每次打开豆瓣的书籍页面，看见右边 LibGen 的小方框是蓝色的，就是一个找书人最大的感动。","link":"/2020/01/19/Library%20Genesis%E2%80%94%E2%80%94%E5%8F%88%E4%B8%80%E4%B8%AA%E6%89%BE%E4%B9%A6%E7%9A%84%E5%9C%B0%E6%96%B9/"},{"title":"Let&#39;s Go to The Mall——Ted 同款来电铃声","text":"下载链接在底部 这篇其实短到不适合写成一篇文章，直接发在 Telegram 频道就好了，但是考虑到我搞到这个资源也着实费了一番工夫（主要是从 Spotify 下载到本地），因此还是发在这里，希望后来者能直接在搜索引擎里找到，省得又经历一遍我遇到过的麻烦。 How I Met Your Mother 是我最爱的剧，最近在看第三遍，发现了一个小细节。在大家发现 Robin 当年在加拿大是青春偶像，拍过 Let’s Go to the Mall 这段 MV 之后，Ted 把自己的手机铃声换成了这首歌。（S04E23 可查，Ted 正在走廊上与 Stella 交谈，Barney 来电要求他把他从警察局保释出去） 前两天在豆瓣发现十多年前（2009 年真的是十多年前了）有人分享过这段铃声，但是年代久远链接早已失效，于是自己动手，在 Spotify 上找到了这首歌，花了一番工夫下载下来剪接了一下，保留了最后一段副歌，基本与 S04E23 中 Ted 的来电铃声一致了。本来可以早点发出来，不过自建的网盘出现了一些问题，今天搞定之后就发了。 另外，最近也开始慢慢上传全部的 How I Met Your Mother，找了一下有一个 HIMYM 字幕组的字幕评价相当不错，但并不完整，似乎只出了一二三四和八九季的字幕，因此就暂时不传字幕了，生肉将就着看吧。 下载地址","link":"/2020/01/21/Let's%20Go%20to%20the%20Mall%E2%80%94%E2%80%94Ted%20%E5%90%8C%E6%AC%BE%E6%9D%A5%E7%94%B5%E9%93%83%E5%A3%B0/"},{"title":"跨考人类学杂谈","text":"失踪小半年再次回归。去年下半年由于考研，基本没更新东西，考完之后写了几篇，又因为回家而懒了起来，再加上毕业论文和复试，一直拖到了现在。前天终于收到了待录取通知，再加上之前答辩完，可以说暑假已经开始了（谁能想到冬天回家反而过上了暑假呢）。终于有了大把的空闲时间，就写写考研的经历吧。本文不是严格意义上的考研经验，更多的是记录一下这个过程，因此可能不具有什么参考性，各位也就看个热闹。 （Markdown 好像不能直接生成目录，因此）本文包括以下几个部分： 背景情况 初试 公共课 专业课 时间和方法 复试 华东师大 调剂 一、背景情况我本科就读于某教育部直属四非大学的号称全国第一专业，和人类学毫不沾边。大概是 18 年 11 月受到一则新闻触动，一个美国传教士试图登上北桑提内尔岛时被当地人杀死。着迷于桑提内尔人的历史和现状，在和一位老师聊天时提到这个问题，她指出这是人类学研究的领域，从此对其一往情深，经过一两个月的犹豫和挣扎之后，下定决心跨专业考研。 本来打算 19 年初开始准备考研，用一年时间学完别人四年的内容已经很难了，没想到大三下学期虽然课少了，但是感觉没有一点多出来的时间，整学期就看了庄孔韶《人类学概论》一本书。到了暑假没回家，开始全心全意看书，但前期又懒懒散散，最后直到九月感觉时间真的不够用了，才真正开始认真学习。一志愿报考华东师大，初试完感觉专业课崩盘，尤其是第二门大部分题都不会，纯粹瞎编，没想到成绩出来第二门还行，反而是第一门拉垮，最后政治 72，英语 86，两门专业课分别是 104 和 134，总分 396 勉强比华东师大去年复试线高出一点，今年刚好压线进复试，因此一边准备复试另一边也准备调剂。 调剂学校本来打算上海师大和中南民大二选一，没想到厦大民族学也招调剂，再一查除了夏令营和推免的，这个专业竟然完全没有人统考一志愿被录取，不知道是怎么回事。关于人类学和民族学的学科名称，是个很混乱的问题，现在基本可以认为民族学和文化人类学是一回事，而国内开设的人类学专业也大都是指文化人类学。例如厦大，在复试的时候直接提问人类学如何如何，看来他们认为这两者是完全等同的。 二、初试2.1 公共课2.1.1 政治因为一度认为自己有可能保研，暑假基本只在看专业课，等到九月保研资格出来确认没有自己，才赶紧买了肖秀荣（只买过肖秀荣，其他人不了解，因此以下内容仅针对他）。精讲精练是基础课本，我是搭配徐涛的强化班看的，B 站有人上传但也一直在删，并且有几集过于敏感一直不能上传（你们为什么害怕马克思主义原理？看来自己心里也有数？），有条件的话在 YouTube 看体验比较好。昨天看了看，今年的也已经出了。 虽然徐涛用的教材是他自己的小黄书，但是和精讲精练绝大部分内容是相同的，可以直接在上面勾画批注。极少数一者有另一者没有的内容，说明不是重点，可以自己看看，没必要太过紧张。如果某个地方二者都有但存在冲突，以肖秀荣为准（不过我没遇到过这种情况就是了）。 精讲精练以外是 1000 题。政治问答题说到底大家都是背肖四，相差不会太大，而选择题是真正拉分的地方。1000 题可以等精讲精练拉通看完之后再做，也可以学完一部分就做一部分。不管采取哪种方法，做一遍都是不够的，因此最好第一遍做的时候把答案写到题号旁边，之后再做可以遮住，或者一开始就在电脑上写答案。另外，除非每一遍都新买一本书来刷，否则每道题最好只记录错了多少次，不要在选项旁边写解析。我时间不够只刷了两遍，有时间的话三遍四遍甚至五遍都不为过，这本书一定要吃透。原题不容易碰到，但知识点就那么些。刷完题之后更重要的是复习错题，我是把做错了的题都加到 Anki 里，根据记忆曲线来不断复习，并且两次都错了的题标红，来提醒自己注意。强烈推荐这种方法。 接下来是讲真题。因为我时间实在不够，只在初试前最后几天做了近几年的几套选择题找感觉，对于正常人还是更建议看完精讲精练之后就开始做选择题，并且也要像 1000 题一样多刷吃透，问答题则看看风格和思路就够了。 另外几本小书，形势与政策我买来时间不够，一眼没看过。如果有时间可以做做里面的选择题，没时间就光做肖四肖八里时政的题也就够了（不过需要你对时政大方向有些背景常识）。知识点提要相当于浓缩版精讲精练，方便后期随手查不清楚的地方，比翻大部头的精讲精练方便。考点预测背诵版看到这名字我就没买，不清楚到底怎么样。 最后就是 11 月和 12 月相继出版的肖八和肖四了。肖八选择题每个知识点都要确保掌握，问答题除非时间实在充裕得用不完，并且自己很喜欢背诵，否则不建议背，同样看看思路就好。肖四没什么好说的，拿到就开始背问答题，并且建议把答案裁下来，材料问题和答案对照着看，不要光背答案。选择题则可以作为考前几天的练手（不要像我一样拿真题找感觉，太浪费了）。另外，肖四的答案组织得不太清楚，可以关注『考研小舍』这个公众号，虽然大部分都是贩卖焦虑可以无视的内容，但是 10 月左右会卖一种包括肖四肖八问答题解析、重要知识点整理和选择题刷题小程序在内的合集，照着它的肖四问答题解析背要轻松很多。 2.1.2 英语英语方面其实我没有任何发言权，因为基本没复习。我可能属于那种擅长英语考试的人，六级裸考 634，不过专四准备了一阵也才只是良好（本来这学期应该考专八的，结果也没了，不知道自己水平到底能不能过）。考研之前，听做了两套真题的舍友说很简单，所以不怎么心急，只是在用不背单词慢慢背单词（而且开始得比较晚，只是核心词汇 1000 多点，红宝书几千个词也来不及背了）。后来保研的同学送了我她以前买的最近五年的张剑黄皮书，12 月把五套客观题做了一下，一方面见识一下题型另一方面找找感觉，基本能控制在只错一两道左右，翻译看了看也没什么问题，因此初试的目标是客观题尽量满分，翻译少扣一点，作文随缘（我很不想专门准备作文，考试的时候基本就是依靠高中的底子）。现在想来这种学习态度真是一言难尽。 考完感觉情况不妙，比做过的那几套题都要难一些，不知道是自己发挥不好还是今年的题确实变难了。过了几天看见网上吐槽今年的题过分地难，才稍微放心了点。结果出来之后，感觉这个分数稍微有些低，客观题肯定扣分了，但是到目前为止不管在网上还是现实中都没有听说过英语一更高的分数，还是不错了（让我小小骄傲一下哈哈）。 2.2 专业课首先建议参考这篇文章，我很大程度上也是依靠文中的参考书目，并且从作者处买到了历年真题和自己做的的笔记。真题我会分享在文末，笔记如果感兴趣可以向作者购买，个人感觉还是比较清晰充实的，不过有些需要自己补充的地方。 不过关于民族志我不太赞同文中的理论。虽然作者一本民族志都没读过并且考的比我好，因此接下来我要说的话可能缺乏说服力，但是我始终认为民族志是人类学这一学科的核心，教材一类的书看得再多，也始终是在接受别人的二手信息，总感觉轻飘飘的，不能确定这就是原著中作者本人的想法。此外，读过原著之后必然会发现一些教材中不会提及的细微之处，如果它刚好能触动你，能牢牢记住，那在复试中就是很好的谈资。更何况，很多民族志本身从文学上也很美。 新几内亚东端地处热带，旱季和雨季不十分分明。事实上，这里并没有明显的旱季，大地上总是郁郁葱葱，与湛蓝的大海形成天然的对比。山顶上，常有蔼蔼雾气，海上的白云或静止不动，或飘荡流走，打破了那饱和浓稠而单调的蓝与绿。对于不熟悉南海景色的人，我们很难向他们描述那里永远欢快的节日气氛和洁净诱人的海滩。海滩边上是丛林和棕树、白浪和碧海，海滩上，一道道山坡在一条条或暗或明的绿色山谷里渐渐升高，山顶掩映在热带的雾中，或隐或现，斑斑驳驳。——《西太平洋上的航海者》 读起来如同在看《南太平洋》纪录片。 为了防止书看过就忘，我用 Book Darts 书签（官网上可以找到授权的淘宝店，超级好看，颜值就是正义）随时标记勾画的内容，看完整本书后用 OCR 软件（推荐白描）识别后存到 Notion 里，构建知识数据库，方便以后随时复习。Notion 最近刚对个人用户完全免费，取消了 block 数量限制，值得尝试。如果有教育邮箱，还可以申请更好的教育版，也是全免费。 此外，有 iPad 的同学强烈推荐 MarginNote。与 Anki 类似，功能比较复杂，上手有难度，但仅仅根据摘录自动生成思维导图这一项就值回价格了。我日常是使用它看 PDF 的教材，民族志看实体书。 最后，在上面那篇文章推荐的书目之外再推荐一本潘天舒的《发展人类学十二讲》，尤其适合对应用人类学感兴趣的同学。书里的有些案例很有趣，在复试的时候谈到应该能加分。我在厦大复试时就引用了其中的一个例子，自我感觉是整个复试中的高光内容。 2.3 时间和方法初试准备过程中，理想的一天应该如下： 7:30：起床，洗漱，吃早饭 8:30：回到宿舍楼中自习室开始学习（楼里就能自习何必出门，况且我们学校图书馆在装修，去空教室自习时不时会遇到别人上课） 11:00：吃午饭（想念三食堂的刀削面），回来休息，午睡 13:00：继续学习 17:00：吃晚饭，洗澡 19:00：继续学习 23:00：休息，吃点零食，洗漱 23:30：睡觉 因为我必须保障八小时睡眠，否则效率会直线下降，而且尤其厌恶早起，所以最多也只能制定出如上每天学习 10 个半小时的时间表。并且，在很多时候我都不能严格遵守这个时间表，偷懒贪睡是常有的事（每天最幸福的时候就是吃完午饭回寝室睡午觉的途中），每天能学七八个小时就不错了。因此对我而言最重要的不是时间长短，而是效率高低。根据番茄工作法，每学 25 分钟就休息 5 分钟，四个循环之后休息 15 分钟，这样虽然总时间进一步下降了，但是基本能保证在那 25 分钟内能心无旁骛地集中注意力学习。番茄钟的 App 很多，可以自己找来尝试一下看哪个顺手，我用的是 Goodtime。 学习方法这种东西很大程度上取决于个人差异，我的这套方法就是建立在我需要的睡眠时间很长，不喜欢早起，难以长时间集中注意力的基础上的（所以种树不适合我）。每个人情况不同，不会有与别人完全相同的学习方法，还是要自己多摸索多尝试。重要的是与自己妥协，没必要用别人的情况来要求自己，没有更好的学习方法，只有更适合自己的。 三、复试3.1 华东师大其实这部分没什么好谈的，由于今年的特殊情况，复试之前根据要求准备双机位环境等等，等 18 号当天到了时间按顺序加入会议室正常作答。问的问题无非是最常见的那些，自我介绍，毕业论文，（针对跨考考生）为什么要学人类学，最喜欢的人类学家等等，再根据你回答的内容继续提问，并没有我考前担心的以面试形式出现的笔试问题。不过由于是第一次面试，真的特别紧张（我平时也比较容易紧张），前几个问题是准备过的还好，后来英语提问突然问到了一个完全没有准备的问题，就开始结结巴巴疯狂出错，口语如同幼儿园水平。 考完觉得自己没什么希望了，开始在 B 站看质量效应的剧情视频逃避（我永远喜欢质量效应！垃圾 EA）。第二天早上华东师大打电话来通知结果，虽然比起初试进步了一名，但还是差一名不能录取。挂了电话继续看视频，等着 20 号调剂系统开放。 3.2 调剂首先建议阅读知乎上这个系列的文章，看完就基本了解调剂的全过程了。 本来根据之前搜集的信息，准备在上海师大和中南民大中二选一，如果上海大学有调剂可以试试，没有就随便填个什么学校保底。5 月 7 号厦大突然发通知，民族学有调剂名额，招一志愿是人类学的考生。当时不太确定厦大民族学和人类学在教学上到底有什么区别，因此给他们发邮件询问，回信非常官话，『具体详情可以关注我院网站』。然而网站上有信息我就不会写邮件了！厦大要求 17 号之前把个人信息发过去，我磨磨蹭蹭到 16 号，想着反正发了也不碍事，大不了进不了复试也不会少块肉，就发了（结果后来可能没多少人看到这则通知，厦大在 20 号开启调剂系统后又通知只要在规定时间内填写志愿就行，这样和我一起华东师大落榜的难兄难弟才有机会也去复试）。 系统开通后填了厦大，上海师大和中南民大三个志愿，厦大当晚就发了复试通知，上海师大第二天早上发通知，但 23 号就要复试，而厦大是 25 号。本来还希望上海师大复试完能过一两天出结果，结果当天下午就发了待录取，要求 12 小时内确认。想了想，还是希望能尝试一下厦大，况且（当时以为）后面至少还有中南民大保底，所以拒绝了这个通知。当时和朋友讲，如果到最后哪儿也没录取，那就是『多年以后，面对行刑队，我将会想起拒绝上师大通知的那个遥远的下午』。 回到厦大这边，个人感觉他们的行政有些好笑。在复试审查材料，环境测试和正式复试里都要不停签同一份诚信考试承诺书，动不动还让人朗读全文，着实有些莫名奇妙。25 号 8 点半开始复试，7 点半就让所有人加入会议通知顺序，忍着哈欠听到对面老师抱怨 6 点半就要起床准备，自己都没睡醒。 我是第 4 号，复试时间是 9 点半，退出会议室又临时抱佛脚看了些东西，当然根据一般规律这些都没考。到时间进入会议室，自我介绍之后开始正式复试，包括思政，英语，专业知识和综合运用四方面内容，每方面都从题库中各抽一道题回答，比华东师大的聊天问答正经了许多。我四道题都抽的我的序号，其中思政是背诵社会主义核心价值观个人层面内容，简单直接；英语是 What would you do if you find anthropology courses boring?（大意），虽然也同样没准备，但经过两场复试之后不再那么紧张，能组织起完整的句子回答了，进步到了小学水平。后面两道题一道关于费孝通，另一道关于社会主义新农村建设，我的兴趣点在都市和应用人类学，对乡村本来了解得就比较少，并且费孝通的作品只看过《江村经济》，问的问题应该是《乡土中国》里的内容，只能向老师承认这方面懂得不多，然后根据看过的《乡土中国》的书评尽量回答。 复试完感觉自己希望还是不大，精心准备的关于都市人类学的案例都没机会讲，因此只能希望中南民大还能发通知。中南民大 23 号晚关闭调剂系统，24 号和 25 号两天陆续发通知，等到 25 号下午我还没有收到通知，而在调剂群里看见已经有人类学的考生收到了，联想到他们老师之前提到的优先看本科专业再看初试成绩，感觉自己可能根本没有复试的机会，一点一点失去希望，甚至开始在知乎上查应征入伍的艰苦地区部队是什么意思，有点打算去当两年兵回来走退役大学生士兵计划。不敢直接二战，觉得一战已经是我能达到的巅峰水平了。 就在这时收到了学信网的短信，『厦门大学已发送通知，请及时上网确认回复』。虽然知道不存在拒录取通知，但还是心脏怦怦跳，哆哆嗦嗦点开调剂系统，看到待录取的一瞬间，解脱，轻松，欣喜，不可置信，以及一丝丝遗憾混杂着涌上心头。四年大学生涯，终于结束了。 华东师大人类学 11-20 年真题（缺 16 17 年）在此，可以自取。本站自建的网盘后端是 OneDrive，网页版应该是被墙状态，如果不能下载或者速度过慢可以在评论里告诉我。文章里有什么未尽事宜，以及另外有什么疑问，都欢迎评论。","link":"/2020/05/27/%E8%B7%A8%E8%80%83%E4%BA%BA%E7%B1%BB%E5%AD%A6%E6%9D%82%E8%B0%88/"},{"title":"个人追论文流程","text":"其实这篇文章在几个月之前就加到 Todo 里了，但是一直拖延到现在才写。 作为一个大学生，怎么能不读论文呢。前几年这一需求还比较低，知网上找找，下载到本地用随便用 PDF 软件看看就行了（推荐破解知网 PDF 下载的这个油猴脚本，以及简洁够用的 UWP PDF 应用 Xodo。无数人说好的 Drawboard 打开文件实在是太慢了）。考研以来以及预计将来的研究生生涯，（尤其是英语）论文阅读量会大幅上升，再加上去年购入了 iPad，想着用 iPad+Apple Pencil 批注论文体验应该比在电脑上看好得多，因此逐渐摸索出了这套追论文的流程。 一、找到论文：Researcher这是一个手机 App，在 Play Store 或者 App Store 都可下载。初次使用，需要选择自己关注的期刊（似乎只有英语），随后首页就会以信息流的形式提供这些这些期刊的最新文章。此外，还可以自己根据关键词或者作者创造过滤条件，从这些期刊的所有文章中筛选出自己尤其关注的领域。 Researcher 中可以选择自己就读/工作的学校，某些学校购买了数据库可以直接获取全文。尝试了一下，国内学校基本是不可行的，国外哥大、剑桥、巴黎高师可以，耶鲁不行。不能直接获取全文的情况下，只能看到论文的 DOI 号，因此要获得论文需要下面的方法。 二、下载论文：Sci-HubSci-Hub 由一位哈萨克斯坦研究生苦于论文价格过高而创立，世界各地拥有施普林格、爱思唯尔等出版社账号的匿名学者主动与其共享账号，从而使其能获得大量的论文资源，供其他人免费下载。Sci-Hub 上有多少论文呢？ 2017 年，宾夕法尼亚大学的 Daniel Himmelstein 研究了 Sci-Hub，发现网站上的论文共有 81,600,000 篇，包含了所有学术论文的 69%，基本能满足大部分的论文需求，因为剩下的 31% 是研究者不想获取的论文。（维基百科） DOI 是一串形如『10.1086/300124』的代码，全称是 Digital Object Identifier，是国际通用、全球唯一、终身不变的数字资源标识符，目前被广泛应用于学术领域，作为每一篇论文的『身份证号码』。 以上二者结合，就可以方便地下载绝大部分论文了。Sci-Hub 的盗版属性决定了被广泛屏蔽的命运，其域名必须时常更换。目前我常用的可用网址是 https://sci-hub.se/，可以在这个网站查到当前可用网址。打开网站（较慢，建议代理），输入 DOI 或者 JSTOR 一类网站上的论文网址，就可以直接下载了。此外，还可以使用国人开发的 SciHub Desktop，或者油猴脚本 Sci-Hub Button，能在 Google Scholar、JSTOR 等论文页面中添加一键跳转 Sci-Hub 对应文章的按钮。 三、管理论文：Zotero毫不夸张地说，Zotero 是我大学四年学术方面的最大发现。本文不打算详尽介绍 Zotero 的全部用法，而只是描述涉及阅读论文流程的部分。但是我仍然强烈建议所有有管理论文、进行学术写作需要的人自行搜索 Zotero 使用教程，尝试上手。个人认为这是在易用性和功能性之间形成了完美平衡的论文管理软件，更何况它是完全免费的，即使你所在学校图书馆没有买 Endnote 也没关系。（不是诋毁母校） 首先下载安装 Zotero。其次需要安装浏览器插件 Zotero Connector，安装好之后可以从知网、Google Scholar、JSTOR、豆瓣图书、维基百科等几乎所有地方直接把条目添加到 Zotero 中。Zotero 免费账号带有 300M 的云同步空间，正常使用情况下几乎必然是不够的。好在它支持 WebDAV 同步，而国内对 WebDAV 支持较好的可能只有坚果云一家。以『坚果云 WebDAV』为关键词可以搜到大把教程，这里不赘述。 当然，条目自身那点文字内容并不会占据多少空间，真正占地方的是作为附件的论文。Zotero Connector 只能获取条目，在没有全文权限的情况下不能直接下载论文本身（例如，通过学校 IP 访问知网就可以），因此需要从 Sci-Hub 一类的地方自行下载，随后通过 Zotero 插件 ZotFile 自动将文章重命名并保存到 Zotero 文件夹中。 最后就是阅读了。Zotero 并未推出官方的移动端程序，因此需要利用第三方 App 已经有啦，具体可以参考另一篇文章，也更推荐采用那里的方法。以下可以作为一种备用方案。 iOS 上，PaperShip 理论上可直接通过与桌面端 Zotero 相同的 WebDav 账号同步论文，并实现批注的双向同步，但在实践中前者时不时就会失败，需要在坚果云网页中专门调整；后者更是几乎不能成功。因此我选择了相对较麻烦的另一种解决方案，即通过 ZotFile 的 Send to Tablet 功能，将想要在 iPad 上阅读的论文发送到特定的云同步文件夹（例如 ~/OneDrive/Zotero），在 iPad 上通过 PDF Expert 连接云存储并将此文件夹设为双向同步，就可以在 iPad 和 PC 间同步论文的批注了。阅读完成后，在 Zotero 中选择 Get from Tablet，就可以将修改过的文档保存到条目下对应的文件夹中，同时删除云同步文件夹中原有内容。并且，这套稍微麻烦的方案还带来两个意料之外的优点：一是 PDF Expert 的使用体验比 PaperShip 好得多，二是通过 ZotFile 从云同步文件夹取回论文后，它会自动将论文中的批注摘录出来。 其实一开始还计划最后写写利用 Gingko 进行卡片式写作的，但关于这种方法我自己也还没弄明白，本文也是在传统 Markdown 编辑器里线性写作而成，因此暂时放弃这一内容，以后有机会再写吧。","link":"/2020/06/01/%E4%B8%AA%E4%BA%BA%E8%BF%BD%E8%AE%BA%E6%96%87%E6%B5%81%E7%A8%8B/"},{"title":"网盘翻车","text":"又翻回来了，嘻嘻。 几个月前就发现自建的网盘打不开了，但是之前也发生过类似的事情，再加上懒，也就没放在心上。前几周终于后知后觉，发现是微软屏蔽了一大批钻空子的教育账号，我专门购买用来当网盘的账号也在其中。本来打算用厦大教育邮箱注册账号再搭建一次，结果发现似乎有关于 API 的问题，不能用于建网盘，所以暂时放弃这个计划。之后一段时间会考虑如何处理需要分享的文件，目前没有确定的时间表，因此如果需要某篇文章中的文件，请评论告知或者直接邮件联系。","link":"/2020/10/26/%E7%BD%91%E7%9B%98%E7%BF%BB%E8%BD%A6/"},{"title":"一些更改","text":"最近又对博客做了些修改，涉及图片、评论以及 CDN（访问速度）。 弃用图床博客一直在使用图床，从一开始的第三方图床、到利用腾讯云对象存储自建图床、再到参考这篇文章使用 Backblaze B2 自建图床。第一种方式将数据交给别人，稳定性不能保证；第二种方式如果不备案就只能使用自带的域名，和博客域名不同并且特别长，看着不好看；第三种方式虽然和博客本体一样走 Cloudflare，但不知为何实在太慢。 最后决定返璞归真，把图片都扔到服务端去（也就是 GitHub）。Hexo 也提供了方便的本地文件引用功能，只要将设置里 post_asset_folder 的值设置为 true，在创建新文章时就会自动在 /source/_posts/ 文件夹下创建同名的空文件夹，将需要的图片 a.webp 扔进去，写文章时只用很简单地引用 ![](a.webp) 就可以了。不过需要注意，在某些情况下如果不能正常显示图片，多半是生成静态文件时没有正确地将 md 文件中的相对地址解析为能够引用的绝对地址。Hexo 官方文档也给出了解决方案，在 _config.yml 里修改一下默认的 hexo-renderer-marked 的设置即可： 12345post_asset_folder: true #确保此项打开#添加以下三行marked: prependRoot: true postAsset: true 这样操作之后，图片和文字一样都存在于 GitHub Pages 之上，并且通过 Cloudflare 的 CDN。自己尝试起来速度还可以，没有腾讯云快但也能用了。（完全不知道为什么用 Backblaze 就慢到令人发指） 使用 utterances 评论之前一直使用的是 Valine 评论，配合上 Valine-Admin 来收取通知。但是过去半年发现好像又收不到通知了，并且 Valine 出现了会泄露评论者 IP 和邮箱的隐私问题，因此又开始换评论插件。在博客主题 Icarus 的支持文档里翻来翻去，无需登录的里面 Isso 过于复杂，LiveRe 以前试过没成功，剩下的要登录的里面 Facebook 和畅言没可能，Disqus 被墙且丑，尽管有 DisqusJS 作为没被墙的替代，但我还是嫌它太重，最后只剩使用 GitHub Issues 的几个选择。首先尝试了 Gitalk，但是不知为何设置好了仍是一片空白（前年换评论那次尽管时间很短但一切正常），所以最后选择了 utterances。要评论的话需要先注册一个 GitHub 账号，然后通过账号登录即可使用。 昨天晚上设置好之后试了一下，不知道为什么一开始连不上 github.com，评论区自然也是一片空白，将 GitHub 加入代理之后就好了。今天再尝试时与 GitHub 的连接正常了，评论可以正常加载。如果你看不到评论框，可以开着代理再试试。 备用 Vercel一只萌新搭建在 GitHub Pages 上，一开始直接用它的网络也没什么问题，大概两三年前开始 GitHub Pages 在大陆的连接质量出现一波下降，使用体验非常不佳，我就给博客套了 Cloudflare 的 CDN。然而 Cloudflare 也被戏称为减速器，只是勉强能用的水平，白天体验还行，晚高峰的时候也常常让人崩溃。前不久看到许多人推荐 Vercel，说它在港台地区有 CDN 节点，大陆连接的速度比较快。听起来很让人心动，就照着教程注册了账号，让它自动导入我博客所在的 repo 就可以使用了。然而测试起来远不及预期，尽管用站长工具看是这样： 看起来全国各地都比走 Cloudflare 的主域名快，但实际体验慢到完全无法使用。网上一搜，好像也只有夸它家快而没有吐槽用了之后更加减速的，所以也不能确定是不是只是我本地网络的问题。因此暂时放弃完全从 Cloudflare 改为 Vercel 的计划，而为后者单独分配一个域名：blog.yizhimengxin.me，读者可以自行尝试和主域名哪个用起来更合适。","link":"/2021/01/25/%E4%B8%80%E4%BA%9B%E6%9B%B4%E6%94%B9/"},{"title":"文献管理工具 Zotero 教程","text":"22/04/17 更新：针对 Zotero 6.0 版本更新进行修改 在去年的一篇文章里我提到过，Zotero 是我本科四年在学术工具方面的最大发现。文献管理工具有很多，其中最著名的大概是 EndNote，但即使学校提供正版从而不必付出高昂的授权费，EndNote 的学习曲线也非常陡峭，绝对谈不上简明易懂。与之相比，Zotero 在功能性和易用性之间取得了完美的平衡，并且它还是完全免费的，因而也就成为了我的日常文献管理工具。这篇文章就将去年那篇文章里 Zotero 的部分展开，谈谈基础的上手教程。 一、安装与使用在 Zotero 的官网下载软件，在下载页面会同时出现软件本体和浏览器扩展 Zotero Connector 下载。软件本体很好理解，而 Zotero Connector 则可以将网页上的论文、书籍、文章、甚至 GitHub 代码等等自动添加到软件中，非常方便。浏览器扩展支持基于 Chromium 和 Firefox 的浏览器以及 Safari，对于 Chromium 系而言，在下载页面的安装按钮会直接导向当前浏览器的扩展商店（除了 Edge 的微软商店外，其他浏览器的 Google Web Store 当然是被墙状态），Firefox 会直接安装，而 Safari 则会导向单独的下载页面（大概，我也没有 Mac 可供尝试）。 软件页面分为三栏，左侧是文库和分类，中间是当前分类下的全部文献，右侧则是当前选中文献的信息、标签等。 安装好软件和 Zotero Connector 后，保持软件运行状态，在浏览器中访问可识别的论文（比如知网）或书籍（比如豆瓣读书）页面时，扩展的图标就会自动变成一篇文章或一本书，代表其识别到了当前网页的信息，点击一下就可以自动将信息保存为 Zotero 中的一条条目。如果是论文，Zotero 还会自动根据关键词给条目打上几个标签，但这一功能几乎毫无用处，很快就会生成几十上百个乱七八糟的标签，丝毫起不到分类和查找的作用，在『编辑-首选项-常规』里可以将其关闭。 同时，若当前使用者有权限下载论文全文，扩展还会自动下载 PDF 文件，将其作为附件保存到对应条目下，便于在本地查看。若无对应权限下载全文，我们也可以通过别的手段（说的就是你，Sci-Hub）下载之后，将文件拖动到对应条目上，手动将其保存为附件。不过需要注意的是，保存好的文献作者会默认按照西文格式将姓和名分开，条目的预览信息也只会显示单独的姓氏。不过，在这种默认情况下将文献导出为引文目录的时候，作者姓名仍然会是中文正常的格式，所以如果不在意使用中的显示效果的话，对于这一问题不必有任何操作。但如果想要更舒服的体验，则有以下几种方法，并且可以搭配采用： 最简单的办法是将『名』剪贴到『姓』后。这样除了名字后有一个空白的输入框外，在中间栏条目信息预览中能看到正常的全名； 直接点一下姓名栏右边的方框，将其改为只显示一个输入框。直接进行此操作会出现『名 姓』的格式，需要手动调换顺序并删除空格。而完成方法1后再采用方法2则能实现中间栏预览和右边栏详情都显示完美的显示效果； 修改 Zotero Connector 设置，实现1的自动化。右键单击 Zotero Connector 的选项，在『Advanced-Advanced Configuration』中点击右上角『Add Preference』，添加参数translators.zhnamesplit，值为false，动图过程可参照此处。这样一来，抓取到中文文献时作者姓名不会自动拆分，而会作为一个整体保存在『姓』的位置，这样再通过方法2就可实现完美效果； 使用插件。详见 3.4 小节。 保存到 Zotero 的所有条目都储存在『我的文库』中，然而要是成百上千条属于不同项目的文献都排在一起，则毫无辨识度和可用性。因此我们可以通过左边栏上方按钮或者右键菜单创建不同的分类，每个分类下面又可以创建子分类，从而将同一项目的条目保存在同一个分类下。值得注意的是，分类不是互斥的文件夹，我们将文献在不同分类间拖动时不是从一个分类移动到另一个分类，而是执行了复制的操作。也就是说，一个条目可以同时属于不同的分类，例如一篇关于女性主义人类学的论文可以同时存在于『女性主义』和『人类学』分类下。也正因为如此，当我们选中一条条目按『Delete』键时，只会将其从该分类中移除，而不会直接将条目从『我的文库』移至『回收站』，若要实现后者的操作需要使用组合键『Shift+Delete』。Zotero 自带的『未分类条目』可筛选出不属于任何分类的条目，方便强迫症查找是否有以为删除了但其实还存在于文库中的文献。 当收集到足够多的文献作为参考文献进而需要导出时，只需要选中需要导出的条目（或者『Ctrl+A』选中当前分类下全部条目），在右键菜单中选择『由所选条目创建引文目录』，选择需要的格式，输出模式选择引文目录，输出方式可选复制到剪贴板直接粘贴，或是另存为 RTF 文件并编辑字体和排版后再粘贴均可。第一次使用时 Zotero 已经给出了许多常见的引文格式，但没有国内最常见的 GB/T 7714 格式，需要点击『管理样式』-『获取更多样式』后搜索『Chinese』，筛选出的 1987、2005 和 2015 、author-dated 和 numeric 模式按需选择，我一般使用的是 2015 author-dated。顺带，这里给出 GB/T 7714-2015 参考文献规范的原文，方便拿不准或者强迫症患者人工对照修正。 最后，除了使用 Zotero Connector 从网页抓取文献外，若本地已经有需要的 PDF 文件，也可以直接将其拖入 Zotero 中，软件会自动识别并抓取文件的元数据，生成对应的条目保存。只不过这通常也只对英文论文有效，中文文章的抓取成功率极低。 至此，Zotero 作为一款文献管理工具最基本的功能就介绍完了，接下来的部分则是关于在最简流程的基础上如何将它改造得更为好用。 二、注册账号并使用 WebDAV 同步附件首先，为了防止电脑坏掉导致几年来保存在本地的数据全部丢失这种惨剧，我们最好注册一个账号，开启 Zotero 的云同步功能。在官网注册后，在 Zotero 的『编辑』-『首选项』中切换到『同步』页面，登录自己的账号并确保『同步文献库中的附件』选项已勾选，库里的文献就会自动同步到 Zotero 的云端了。 不过，Zotero 只免费提供了 300 MB 的云存储容量，一旦包含附件的文献稍多几乎肯定是不够用的。好在除了自家的云存储之外，Zotero 也提供了使用 WebDAV 同步附件的选项。关于 WebDAV 是什么可以参考这篇知乎回答，国内能正常使用的 WebDAV 服务大约只有坚果云一家，恰好坚果云的免费账号不限制容量大小，只限制每月 1 GB 的上传和 3 GB 的下载，用来同步论文再合适不过了。坚果云开启 WebDAV 的流程也可以参考上面那篇回答，拿到应用密码后回到 Zotero，在刚刚的『同步』页面『同步文献库中的附件』后选择使用 WebDAV，填上坚果云的地址、用户名和应用密码，点击『验证服务器』，若提示『zotero 文件夹不存在，是否创建』则选择『是』，最后选择『OK』保存并关闭设置页面，就算完成了。这样一来，体积大的文献文件通过坚果云同步，Zotero 的 300 MB 免费空间只用来同步条目的标题、作者等纯文本信息，可以认为几乎永远不会用完。 三、插件在软件本身提供的功能之外，Zotero 也支持第三方开发的插件以提供额外的特性，下面就介绍几个我个人觉得比较好用的插件。 3.1 ZotFileZotFile 可能是 Zotero 使用人数最多的插件了，正如它的 slogan（Advanced PDF management for Zotero）所说，其提供了非常方便的附件管理功能。在 GitHub 的下载页面下载最新版本的 ZotFile（当前版本 v5.1.1，文件为 zotfile-5.1.1-fx.xpi），在 Zotero 里选择『工具』-『插件』，点击右上角齿轮图标选择『Install Add-on From File），再选择下载下来的插件，最后重启 Zotero 即完成安装。 ZotFile 最主要的功能之一是方便地将自己下载的 PDF 添加为条目的附件。在 Zotero 的『工具』-『ZotFile Preferences』里，『General Setting』选项卡中『Source Folder for Attaching New Files』一项，我们可以将其设置为某一临时下载文件夹（比如『下载』或『桌面』）并保存，以后若是 Zotero Connector 没有自动下载好文章，我们将其手动下载到设置的下载文件夹后，右击对应条目选择『Attach New File』，ZotFile 就会自动将该文件夹中最新的 PDF 文档添加为条目附件并重命名（重命名规则是 Zotero 默认的，格式为『作者-年份-标题』，我们也可以在『ZotFile Preferences』里的『Renaming Rules』选项卡让 ZotFile 接管并自定义规则）。若是已经添加了附件而又更改了条目的信息（例如作者姓名），也可以通过右键菜单中『Manage Attachments』-『Rename Attachments』来再次重命名，满足强迫症的愿望。 3.2 Zotero DOI ManagerDOI 是一串形如『10.1086/300124』的代码，全称是 Digital Object Identifier，是国际通用、全球唯一、终身不变的数字资源标识符，目前被广泛应用于学术领域，作为每一篇论文的『身份证号码』。 Zotero DOI Manager的作用是自动为新保存的条目添加 DOI，可以选择长或短 DOI 形式，并且还会检验当前 DOI 是否可用（也就是是否指向该论文）。虽然这一功能好像其实并没有什么作用，不过强迫症……认为每篇论文都包含 DOI 看起来好看！不过，除了某些比较新的文章，大部分汉语论文都是没有 DOI 的，DOI Manager 也会给这种论文打上一个『⛔ No DOI found』的标签。如果嫌这一功能碍事，也可在插件设置（『工具-DOI Manager Preferences…』） 里将其关闭。 3.3 ZoteroQuickLook注意：在 Zotero 更新 6.0 版本后，此插件已失效，并且作者无意更新，理由是 Zotero 6.0 自带的阅读器已经足够迅速和好用。 macOS 有一个方便的功能，选中文件时按空格键就可以不用打开文件而临时预览一下。QuickLook 是 Windows 上一个单独的软件，可以提供同样的功能，而 ZoteroQuickLook 是与之配合的 Zotero 插件，让其在 Zotero 中也能发挥作用，不用实际打开就能预览条目的 PDF 附件。安装好 QuickLook 后（建议下载 .msi 安装包），打开 Zotero 的插件页面，将下载的 ZoteroQuickLook 插件 zoteroquicklook.zoteroplugin 拖动到该页面即可安装。这样，当 QuickLook 保持在后台运行时，在 Zotero 中选中一条条目按空格就可以预览 PDF 附件了。 另外，QuickLook 本身并非默认就能预览所有文件（例如最常见的 Office 文件就无法直接预览），而需要自己安装对应的插件。QuickLook 插件的安装非常简单，只需要将插件下载下来，选中它按一下空格就可以了。 3.4 Jasminum一个专注于处理中文元数据的插件，实现的功能包括拆分或合并条目作者姓名、更新中文的 translators 等，下载页面在此。 拆分合并作者姓名的功能非常简单，右键单击条目在『小工具』里选择就好，能够实现上文所述的完美效果。更新 translators 则更值得一说。Zotero 需要依靠各种翻译器来将特定的网站『翻译』成自己能识别的信息从而抓取需要的条目，包括知网在内的学术网站时有改版，这就要求翻译器也相应更新。针对国外网站的 Zotero 官方翻译器更新很及时，通常使用起来不会出现问题，但针对国内的更新往往就很慢了。因此，许多人都遇到过无法抓取知网数据的问题，解决办法则是更新第三方的翻译器。我们当然可以手动下载，但这一项目的作者同时开发了 Jasminum，提供了自动更新这些翻译器的方法。在『编辑-首选项』中切换到『茉莉花』，第一个选项卡可以设置该插件的一些功能，第二个选项卡就是更新翻译器的地方：点击『刷新』，再单独更新需要的翻译器或一键全部更新均可。在这里更新后，还需要在 Zotero Connector 里也同步更新。打开 Connector 的设置，找到『Advanced-Translators』，多点几次『Update Translators』再重启浏览器和 Zotero 本体就好。 至于本插件另外的一些功能，因为我并没有用到，所以就请自行研究了。 四、阅读与批注以上步骤已经让 Zotero 成为足够好用的文献管理软件了，但我们显然不会仅仅把条目囤积起来以备使用——更重要的是阅读。6.0 更新后 Zotero 提供了内置的 PDF 阅读器，只需要选中条目双击或回车就会在新标签页打开条目的 PDF 附件。 这一自带的编辑器正上方是高亮、笔记和框选三种不同的批注形式，针对第一种和第三种形式又可以对所选内容额外添加评论。最左侧和最右侧的按钮分别是打开注释栏和笔记栏。注释栏显而易见，对当前文章的所有批注都会集中在此处；笔记栏则既可以直接点击加号新建条目笔记、单纯记录自己的看法，也可以直接把某一段批注拖动到笔记栏中，还可以把目前存在于本文的所有批注全部生成为笔记。由后两者方法得来的笔记，会自动在文本上带有回到所摘录页面的链接，文本后也带有如文中引用一样的信息，可以通过点击回到条目。 这样一来，一条笔记可以在一定程度上脱离所属的文献而存在。我们可以从一篇文献出发，不断用其他文献的内容来丰富自己的笔记，最终得到一大段包含了许多相关内容和自己对其思考的宝贵资料。在这基础上再进行论文写作，就会轻松很多，因为我们想要表达的东西都已经存在，现在要做的只是将其整理成一篇逻辑顺畅的文章。 除了在电脑上阅读外，如果有平板和笔，那将论文同步到平板上阅读批注、完成后再同步回电脑保存以备进一步利用，无疑是更优秀的使用体验。长期以来我都在使用 ZotFile 插件将文献发送到 OneDrive 一类的同步盘上，再通过平板上 PDF Expert 这样可以连接网盘的 App 进行阅读。而随着 Zotero 6.0 的更新，其也同步推出了移动端 App（目前只有 iOS 端），登录 Zotero 和 WebDAV（若在使用）账号后就会同步所有的条目和分类，不过可能是出于节省空间的目的，PDF 附件只有在点击之后才会下载到本地。移动端的阅读器严格来说比不上 PDF Expert 这样更专业的作品，但用来阅读文献，基本的勾画圈点功能算得上是足够了。 最后，需要注意的是 Zotero 6.0 桌面和移动端的批注都是储存在其本身的数据库里，而非像其他阅读器一样储存在 PDF 文件本身。这一方面让其能容易实现笔记编辑器的强大功能，另一方面也加深了用户和软件的绑定关系，使用户更难以随意『叛逃』到其他文献管理工具。开发公司似乎有一个未来 All in Zotero 的野心，而这是好是坏只能交由每个用户自行判断。若不愿意被捆绑到某个特定的工具上，可以在首选项中将默认 PDF 打开方式还原成系统默认，移动端也继续采用第三方云盘同步的方式，来保障自己退出的权利。 P.S. 关于新版编辑器使用方法更详细的说明，可以参考少数派的这篇文章。","link":"/2021/09/30/%E6%96%87%E7%8C%AE%E7%AE%A1%E7%90%86%E5%B7%A5%E5%85%B7Zotero%E6%95%99%E7%A8%8B/"},{"title":"记录一下 OpenWrt 上 AdGuard Home 与 OpenClash 共存","text":"寒假回家，又开始折腾路由器。家里网络结构很简单，光猫桥接，主路由拨号并提供 DHCP 和 WiFi，一个刷了 OpenWrt 的 N1 盒子作旁路由，主要跑 OpenClash 服务于不方便本地开代理的设备（比如电视），同时也用 AdGuard Home 来去除一些广告和追踪。这两个软件都涉及到系统的 DNS，因此想要共存并且按预期发挥效果需要专门设置一下。虽然我也是照着网上教程做的，但是那些教程比较七零八碎，还多是讨论的形式，所以这里总结记录成一篇文章。不过，这篇文章不是从零开始的教程，这里默认你已经有了一个正常运行 OpenWrt 的旁路由，完成了 AdGuard Home 和 OpenClash 的基本配置并分别能正常工作。准备好了就继续读下去吧！ 一、AdGuard Home 设置首先，将 AdGuard Home 的重定向选择为『重定向 53 端口到 AdGuard Home』，然后上游 DNS 仅设置为 OpenClash 的 127.0.0.1:7874。就这么简单！ 二、OpenClash 设置选择 Fake-IP 模式，确认一下『常规设置』下 DNS 监听端口是 7874，然后在 『DNS 设置里』取消勾选『本地 DNS 劫持』和『追加上游 DNS』，在自定义上游 DNS 中添加一些 NameServer 组的国内 DNS，有无污染均无影响，当然更建议使用 DoT 或 DoH。 最后，将需要走旁路由的设备的网关和 DNS 手动设置为旁路由的 IP 地址，这样它们的请求首先发送到 AdGuard Home，匹配一遍去广告规则后再转发到 OpenClash 进行代理规则匹配，两个软件就能同时发挥作用了。","link":"/2022/02/06/%E8%AE%B0%E5%BD%95%E4%B8%80%E4%B8%8BOpenWrt%E4%B8%8AAdGuardHome%E4%B8%8EOpenClash%E5%85%B1%E5%AD%98/"},{"title":"FODI 回归","text":"封控在家，闲着没事，翻到了以前常看的一处博客。当初照着这里的教程自建了 OneDrive 网盘，把分享的大大小小的东西都搬了上去，没想到薅的微软教育账号翻车了，网盘自然也失效。今天发现博主不仅说明了如何自行申请 Microsoft 365 E5 账号、从而获得 5T 的 OneDrive 空间，而且还提供了翻车前我经常遇到的 FODI 设置过期、需要手动重置的解决方案。 花了一点时间搭建好，看着简洁明了又反应飞快的页面实在是一种享受。这个网盘的具体情况可以参考以前的这篇文章。上次使用时我还用着上行相当不错的校园网，现在就只是 30M 的普通家宽了。好在目前也一直居家，无事可做，就让它在后台挂着慢慢传吧。","link":"/2022/04/18/FODI%E5%9B%9E%E5%BD%92/"},{"title":"高分屏下星露谷物语安装 mod 后分辨率问题","text":"最近沉迷上了星露谷物语，在游戏里当一个 627 的好农民，种田采矿钓鱼养鸡好不快活。玩了 10 多个小时之后，我也打算找点 mod 来改善一下游戏体验，以免总是忘记别人生日之类的。官方 Wiki 已经把关于 mod 的一切讲得相当清楚了，但我遇到了一个常见问题里没有涉及的麻烦：安装好 mod 之后出现了分辨率问题。 具体来说，安装 mod 后打开游戏，DPI 缩放出现了严重问题，界面上所有元素都被放大了许多倍。即使在游戏设置里将界面和菜单的缩放均调至最小，显示效果还是过于地大了，很影响游玩体验。 解决方法也很简单，找到 SMAPI 安装路径下（默认为 ~\\Steam\\steamapps\\common\\Stardew Valley）的 StardewModdingAPI.exe，右键属性-兼容性-更改高 DPI 设置，将两个复选框都打上勾并确定就好了。再打开游戏，就能恢复安装 mod 前的正常状态。","link":"/2022/05/05/%E9%AB%98%E5%88%86%E5%B1%8F%E4%B8%8B%E6%98%9F%E9%9C%B2%E8%B0%B7%E7%89%A9%E8%AF%AD%E5%AE%89%E8%A3%85mod%E5%90%8E%E5%88%86%E8%BE%A8%E7%8E%87%E9%97%AE%E9%A2%98/"},{"title":"第四次更改评论系统","text":"本站又又又又一次更新了评论系统。 细数一下，19 年初博客更换为 Hexo 之后，评论一开始使用的是 Valine，后来由于国内版 LeanCloud 强制实名认证而短暂使用了 Gittalk，随后又发现 LeanCloud 国际版的存在而改回了 Valine。Valine 爆出会泄露评论者 IP 和邮箱的隐私漏洞后，我又迁移到了 utterances。 utterances 又如何呢？简单、轻量、不需要怎么操心，唯一的问题在于它是基于 GitHub Issues 的。尽管 GitHub 在相当长的一段时间内不太可能被墙，但在某些时间和某些地区的连通性却还是常常出现问题。另外，用 Issues 来搭建评论总感觉不够优雅，其功能也稍有欠缺（例如无法实现楼中楼式的回复。基于 GitHub Discussions 的 giscus 可以实现这一功能，不过我使用的博客主题暂未支持）。由于目前本站处于日常断更状态，最近一年没有任何评论，所以我也没有负担地考虑再换一个更合适的评论系统。几番比较之下，最终选择了 Waline。 正如 Waline 首页所宣称的，它是基于 Valine 衍生而来。当初 Valine 漏洞刚被披露时，我就听说了这一新系统，但由于不确定这种修改版会被维护多久，因此没有第一时间切换过来。现在距 Waline 诞生已经过去了好几年，社区一片欣欣向荣，再加上它实现了 Valine 所没有的评论通知（不限于邮件，目前在用 Telegram Bot 通知）、垃圾评论过滤等功能，因此我也决定使用它来代替 utterances。 Waline 的样式和熟悉的 Valine 差不太多，昵称、邮箱和个人网址都是可选项（当然要想收到评论回复通知必须留下邮箱）。也可以点击“登录”按钮来注册一个账号，以后评论都会默认使用这一账号，就无需每次填写基础信息了。经过考虑还是取消了注册账号功能，因为可能有不少人仍然在不同地方使用同一密码，尽管 Waline 的后端没有明显的安全性问题，但毕竟多一处存在就多一处风险，而与这种风险相关的收益非常小，因此没有什么必要。并且，最近填写的基础信息会保留在 cookie 中，一般情况下也不需要每次都重新填写。最后，本站的评论开启了 Akismet 垃圾过滤，提交评论时可能会受到访问者本地到 Akismet 的网络条件限制，显得异常缓慢。具体情况如何，需要读者自己尝试了。","link":"/2022/05/09/%E7%AC%AC%E5%9B%9B%E6%AC%A1%E6%9B%B4%E6%94%B9%E8%AF%84%E8%AE%BA%E7%B3%BB%E7%BB%9F/"},{"title":"当自己写了一个脚本之后","text":"作为代码经验仅限于 Hello world! 的业余选手，我对计算机技术却总是有着超过自身能力的兴趣。昨天又在折腾 VPS 上的代理程序，需要定时下载特定的文件以供使用。长期以来我的 Linux 技术保持在熟练使用一键脚本的水平，这一程序的搭建过程也不例外，但这次我第一次需要用到脚本未提供的功能，唯一的提示是讨论区别人的一句“自己写个 cron 就好了”。What do you do? Go. 虽然啥也不懂，但也不是毫无头绪。Cron 是没用过但听说过的 Linux 上可定时执行指定命令的程序，于是我的第一反应是搜索“cron 下载文件”。但显然，cron 并不能自觉地帮你下载文件，而只能执行你写好的下载文件的命令，不过这种南辕北辙的搜索倒真的绕地球一圈，找到了我需要的东西。作者是为了下载 NASA 每日一图（是我本科时候干过的事！）而写的脚本，我摘抄出自己需要的部分，再加上临时搜到的拷贝命令，就得到了： 1234567#!/usr/bin/bashwget -P /tmp &quot;https://github.com/Loyalsoldier/v2ray-rules-dat/releases/latest/download/geoip.dat&quot;wget -P /tmp &quot;https://github.com/Loyalsoldier/v2ray-rules-dat/releases/latest/download/geosite.dat&quot;cp /tmp/geoip.dat /usr/local/share/xray/cp /tmp/geosite.dat /usr/local/share/xray/ 看起来很不错。不过别急，先手动测试一下。复制第一行下载命令 wget -P /tmp &quot;https://github.com/Loyalsoldier/v2ray-rules-dat/releases/latest/download/geoip.dat&quot; 到 SSH 执行，成功；再复制拷贝命令 cp /tmp/geoip.dat /usr/local/share/xray/，同样成功，完美。于是兴冲冲把脚本保存到 VPS，一执行： 12345678910root@vps:-# bash updategeo.sh--2022-09-15 14:03:22-- https://github.com/Loyalsoldier/v2ray-rules-dat/releases/latest/download/geoip.dat%0DResolving github.com (github.com)... 192.30.255.112Connecting to github.com (github.com) | 192.30.255.112| :443... connected. HTTP request sent, awaiting response... 302 FoundLocation: https://github.com/Loyalsoldier/v2ray-rules-dat/releases/download/202209142214/geoip.dat%0D [following]--2022-09-15 14:03:22-- https://github.com/Loyalsoldier/v2ray-rules-dat/releases/download/202209142214/geoip.dat%0DReusing existing connection to github.com: 443.HTTP request sent, awaiting response... 404 Not Found2022-09-15 14:03:22 ERROR 404: Not Found. 先 Found 再 Not Found，着实让我迷惑。昨晚大概就在这里卡了半小时，尝试了各种修改 wget 参数的方法都没有效果，最后把问题发给我那同样一知半解的计算语言学朋友就睡觉了。今天早晨被没关的窗户外核酸排队声音吵醒，虽然没睡够但也睡不着了，于是起来看看朋友回了我什么。他给我发的 stackoverflow 的一个提问也是关于 wget 无法下载，但和我的问题并不一样，不过这也提醒了我可以在这里搜一搜。又经过快半小时搜索和尝试，终于发现了一个精准描述我的处境的问题：wget working in terminal but not working from shell script，答案也正是我所需要的： 仅仅又是一个系统间的格式问题。在 Windows 上用 VS Code 新建的文件行尾序列默认是 CRLF，保存为 Linux 所需文件之前要改成 LF。又或者，直接在 SSH 里新建文件，VS Code 只用来写码，写好后粘贴到 SSH 里即可。最后贴出上面回答里引用的那个链接，有兴趣可以进一步阅读。","link":"/2022/09/16/%E5%BD%93%E8%87%AA%E5%B7%B1%E5%86%99%E4%BA%86%E4%B8%80%E4%B8%AA%E8%84%9A%E6%9C%AC%E4%B9%8B%E5%90%8E/"},{"title":"打造自己的 Clash 配置并提供订阅","text":"24/04/23 更新：修改示例配置文件为 Clash Meta (mihomo) 格式并微调规则 一般来说，机场提供的配置文件一键订阅会处理好代理和分流的问题，足够使用了。但由于包括但不限于： 有多个机场、或者有自建的节点想同时使用 机场的规则过于臃肿、或者不能涵盖自己需求 等原因，总有人想要写一份完全符合自己需要的配置。我就一直有这种想法，最近终于付诸实施，并且还顺便了解到如何将这样一份配置托管到网上，让不同设备可以通过链接直接订阅，因此在这里简单记录一下过程，方便有同样需求的人参考。 一、Proxy Provider 转换Proxy Provider 是 Clash 提供的一项功能，可以单独引入一些代理服务器信息，插入到当前配置文件中以供使用。有的机场直接提供了 Proxy Provider 链接，有的没有，在后一种情况下就需要将机场的配置文件订阅链接加以转换，提取出其中代理服务器部分。 Proxy Provider Converter 是一项提供这种转换的公开服务，可以直接使用。然而这样有两个问题：(1) 该服务的提供者可以看到你的订阅地址 (2) vercel.app 在国内无法访问。这样编写的配置文件需要可用代理才能下载代理信息，而又要下载了代理信息才能获得可用代理。（扔桌子.jpg） 好在开发者提供了简便的自行部署方法。根据网页上的说明部署到 Vercel 后就解决了上述第一个问题，而要解决第二个问题就需要有一个自己的域名，并在 DNS 解析处添加一项 CNAME 记录，指向 cname-china.vercel-dns.com，随后在 Vercel 自己部署的项目中找到 Settings-Domains，添加自己刚刚做好解析的完整域名，就能通过这个没有被墙的域名使用转换服务。如果你没有域名，又信任我不会偷看你的订阅的话，也可以使用我自己的这个：https://a.ppconverter.eu.org。 二、编写配置文件Clash Meta 配置文件的基本格式官方 Wiki 有足够详尽的说明，有兴趣可以自己阅读，这里就不重复解释了，直接提供一个通用的配置（注意需要在 proxy-providers 中粘贴自己转换得到的链接）： 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142mode: rulelog-level: infoipv6: truegeodata-mode: truetcp-concurrent: true# dns: # DNS 一般无需设置，DNS 泄露的影响被夸大了。如果你坚持取消注释，请按实际情况调整内容# enable: false# prefer-h3: true# listen: 0.0.0.0:1053# ipv6: true# default-nameserver:# - 223.5.5.5# - 119.29.29.29# enhanced-mode: fake-ip# fake-ip-range: 198.18.0.1/16 # fake-ip 池设置# fake-ip-filter:# - &quot;*&quot;# - &quot;+.lan&quot;# - &quot;+.local&quot;# nameserver:# - https://1.1.1.1/dns-query# - https://8.8.8.8/dns-query# nameserver-policy:# &quot;geosite:cn,private&quot;:# - https://doh.pub/dns-query# - https://dns.alidns.com/dns-querysniffer: enable: true force-dns-mapping: true parse-pure-ip: true override-destination: false sniff: HTTP: ports: [80, 8080-8880] override-destination: true TLS: ports: [443, 8443] QUIC: ports: [443, 8443] # force-domain: skip-domain: - Mijia Cloudproxy-providers: myproxy: type: http url: https://example.com # 粘贴 Proxy Provider Converter 提供的链接 interval: 172800 path: ./myproxy.yaml health-check: enable: true interval: 600 lazy: true url: http://www.gstatic.com/generate_204proxy-groups: - name: &quot;PROXY&quot; type: select use: - myproxy - name: &quot;Ads&quot; type: select proxies: - REJECT - PROXY - DIRECT - name: &quot;Telegram&quot; type: select use: - myproxy proxies: - PROXY - name: &quot;YouTube&quot; type: select use: - myproxy proxies: - PROXY - name: &quot;GlobalMedia&quot; type: select use: - myproxy proxies: - PROXY - name: &quot;Steam&quot; type: select use: - myproxy proxies: - PROXY - DIRECT - name: &quot;OpenAI&quot; type: select use: - myproxy proxies: - PROXY - name: &quot;Others&quot; type: select proxies: - PROXY - DIRECTrule-providers: streaming: type: http behavior: domain url: &quot;https://mirror.ghproxy.com/https://raw.githubusercontent.com/blackmatrix7/ios_rule_script/master/rule/Clash/GlobalMedia/GlobalMedia_Domain.yaml&quot; path: ./ruleset/globalmedia.yaml interval: 86400 steam: type: http behavior: classical url: 'https://mirror.ghproxy.com/https://raw.githubusercontent.com/blackmatrix7/ios_rule_script/master/rule/Clash/Steam/Steam.yaml' path: ./ruleset/steam.yaml interval: 86400 steamCN: type: http behavior: classical url: 'https://mirror.ghproxy.com/https://raw.githubusercontent.com/blackmatrix7/ios_rule_script/master/rule/Clash/SteamCN/SteamCN.yaml' path: ./ruleset/steamCN.yaml interval: 86400rules: - GEOSITE,category-ads-all,Ads - GEOSITE,private,DIRECT - GEOSITE,apple-cn,DIRECT - GEOSITE,openai,OpenAI - GEOSITE,youtube,YouTube - RULE-SET,streaming,GlobalMedia - RULE-SET,steamCN,DIRECT - RULE-SET,steam,Steam - GEOSITE,category-games@cn,DIRECT - GEOSITE,geolocation-!cn,PROXY - GEOSITE,cn,DIRECT - GEOIP,telegram,Telegram - GEOIP,private,DIRECT - GEOIP,CN,DIRECT - MATCH,Others 我没有能力手写成千上万的规则，而是引入了 Geosite 以及与 Proxy Provider 类似的 Rule Provider，直接使用这些第三方规则集。Clash 的规则是从前到后依次匹配的，已经匹配到的流量就不会向后继续匹配。值得注意的情况有： OpenAI 服务有单独的策略组，用于选择解锁节点； 尽管 streaming 规则集中包括了 YouTube，但我还是将 YouTube 规则单列出来放在前面，如果有送中节点的话可以免广告看 YouTube； Steam 登录和下载一直是老大难问题。以前使用机场规则时，我的经验是（国区）需要在登录时将 Steam 和 Others 代理组都选为直连，登录后再改为需要的代理节点，这样才不会无法登录，下载节点是国内，同时也能访问好友列表、创意工坊等内容。如今自己写的规则先将 steamCN 规定为直连，再把剩下的 steam 流量用一个代理组选择代理节点，体验就基本完美了。 当然这只是一个追求最大通用性的内容，你也可以自行修改增加需要的规则。比如我实际使用的规则中还包括一条 DOMAIN,***.sharepoint.com,MyOneDrive，再在 proxy-groups 里添加 MyOneDrive 这一策略组和所需的节点，这样在我向 5T OneDrive 上传视频时可以切换为直连节约流量，观看时又打开代理来保障体验。不过请注意，出于规则匹配顺序的原因，一般自己修改的这些规则都应该放在较为靠前的位置。需要自行添加规则可优先到上述的 Geosite 中寻找，如果没有或对效果不满意，单独的规则集也可以在这些地方找到： https://github.com/Loyalsoldier/clash-rules 简洁明了，注意需要设置为 behavior: domain https://github.com/blackmatrix7/ios_rule_script/tree/master/rule/Clash 非常全面，behavior: classical https://github.com/DivineEngine/Profiles/tree/master/Clash/RuleSet 知名选择，behavior: classical 这些规则集提供的 https://raw.githubusercontent.com 地址在国内通常无法访问，只需要在前面加上 https://mirror.ghproxy.com/，组成 https://mirror.ghproxy.com/https://raw.githubusercontent.com/Loyalsoldier/clash-rules/release/proxy.txt 这样的 URL 就好。 三、托管并订阅得到这样一份可以使用的配置文件后，当然可以在各个设备间手动拷贝并导入软件，但这样本身很麻烦，如果之后需要修改的话还要重复一遍流程，更加糟糕。因此，我们最好把它托管到互联网上，让各个设备订阅托管的网址，修改也只需要变更网络上这一份，完成后各个设备更新一下订阅就好。 打开 GitHub Gist，Gist description 不用填，Filename including extension... 填入包括拓展名的文件全名，如 myconfig.yaml，将配置文件的全部内容粘贴进去，最后点右下角绿色按钮发布。 然后打开刚刚发布的 Gist，点击右上角的 Raw，复制当前的的地址，如： https://gist.githubusercontent.com/githubusername/1234567890/raw/0987654321/myconfig.yaml 将 /raw/ 之后的第二串随机数删除，得到形如： https://gist.githubusercontent.com/githubusername/1234567890/raw/myconfig.yaml 的 URL，再在开头添加上 https://mirror.ghproxy.com/，随后在任意使用 Clash Meta 内核的 Clash 图形化客户端中添加这一订阅链接，等所需文件下载完成后就可以正常使用了。","link":"/2022/10/27/%E6%89%93%E9%80%A0%E8%87%AA%E5%B7%B1%E7%9A%84Clash%E9%85%8D%E7%BD%AE%E5%B9%B6%E6%8F%90%E4%BE%9B%E8%AE%A2%E9%98%85/"},{"title":"Audacity 同时录制麦克风与系统音频","text":"Audacity 是一款跨平台的音频编辑 FOSS 软件，功能丰富又简洁易用。我最近进行的项目需要同时录制麦克风输入和系统输出的音频，这在 Windows 7 及之前的系统上可以通过开启系统混音器来很方便地实现，但在更新的系统上似乎除非有专门的外设，否则就不能使用此功能。因此，我们需要进行一些手动设置。 首先，以 Windows 11 为例，右键单击音量按钮，选择声音设置-更多声音设置，切换到录制页，双击你需要使用的输入麦克风（例如笔记本自带的一般叫麦克风阵列，连接的耳机大概叫 Headset Microphone 之类的），在弹出的设置中首先切换到高级页，记住默认格式的采样率（如 48000 HZ），再切换到侦听页，勾选上侦听此设备并保存。这时可以尝试朝麦克风说话，能同时听到在系统音频中输出。 然后打开 Audacity，在音轨上方的设置中，将音轨主机选为 Windows WASAPI，播放和录制设备均选择为你需要的音频输出设备，其他不变。保存设置后，在 Audacity 主界面左下角将项目采样率调为刚才在系统声音设置中记住的采样率。 现在点击开始录制，应该就能同时录到输入和输出的音频了。","link":"/2022/10/30/Audacity%E5%90%8C%E6%97%B6%E5%BD%95%E5%88%B6%E9%BA%A6%E5%85%8B%E9%A3%8E%E4%B8%8E%E7%B3%BB%E7%BB%9F%E9%9F%B3%E9%A2%91/"},{"title":"建了一个 Mastodon 实例","text":"对 Mastodon 早有耳闻。它是一个去中心化的微博客类社交平台（虽然我觉得只能算是半去中心化），一直吸引着对政府干预和资本控制高度警惕的隐私怪各色人士入驻，也曾敞开怀抱接纳了一批豆瓣难民，以及在最近马一龙收购 Twitter 后迎来了用户数的暴涨。大约半个月前我也打算注册一个账号看看，然而浏览了一圈，对现有中文实例的气氛都不太满意（太多人把这当作某种应许之地，you know what I mean），所以干脆自建一个实例，在联邦宇宙中点亮自己的一个小小星球。 然而搭建的过程充满艰辛，先是买的 VPS 硬盘性能太低、光是 SSH 体验就让人恼火，后是 Mastodon 升级后不能直接应用教程中的命令而不自知，重复了几次都花式报错，最后在大佬的帮助下才终于成功（极其感谢 pullopen 的教程，如果你愿意的话照着目前的教程能顺利建好）。 无论如何，现在有了自己的实例 Wanderlust。名字是我很喜欢的词，也因为不是生造词从而绝大部分常见顶级域名已被注册，但刚好 .im 无人注册，用来当个人运营的社交平台再适合不过了。（虽然但是，.im 是马恩岛的地区域名，你一定要知道他们的标志长什么样） 由于贫穷，目前买的 VPS 也是一普普通通的黑五特价款，大约承载不了多少用户。当然目前只有我一个人在用，因此欢迎大家加入，但请先阅读以下规则： 如果你愿意接受，就让我们一起建设罗马吧！","link":"/2022/11/23/%E5%BB%BA%E4%BA%86%E4%B8%80%E4%B8%AAMastodon%E5%AE%9E%E4%BE%8B/"},{"title":"（节选）电子书一键摆烂 ABC——写在 zlib 被资产阶级铁拳干烂之际","text":"转载自 Yuko’s Blog，LICENSED UNDER CC BY-NC-SA 4.0。 找书豆瓣资源下载大师我得承认：在 zlib 被资产阶级铁拳砸了的恶时辰里，找书是一件难事 我现在最推荐的是使用豆瓣资源下载大师脚本来找书，这个脚本会自动在这里面收录的各个网站里面搜索，如果有资源会用绿色来显示。当然尽管这里显示的选项很多，其实大多数都不准的，基本只有 Lorefere 和 LibGen 这两个网站有用。 找英文书用这个脚本也是可以的，比如说我下面这个图就是搜索 An Introduction to Antonio Gramsci 的结果，点开 PDFDrive 真的能找到。 ####zlib 的电报 bot zlib 目前被爆了的只有域名，服务器还是好的，因此可以使用一些方法来偷渡。用 tor 上 zlib 的暗网版本也是可以的，我这里说一下电报 bot。 https://t.me/zlibrary2bot 订阅这个 bot 之后还需要和 zlib 账号绑定才能下书，依照提示来就行，zlib 现在被干烂的只有主站，登录站还是可以用的。 就算是等将来某一天 zlib 的网页复活之后也是可以用的，毕竟 zlib 每天有下载 10 本的限制，超出部分可以用电报 bot 下，这个不算在 10 本的额度内。 互助联盟https://www.xueshu86.com 读秀的书库，卖两块钱一本。如果你面子够大有一个买了读秀书库的群友就可以省下这笔钱。 读秀书库的特点是 PDF 里每一页就是一条目录。要不要用我下文写的方法添加新的目录另说，但是我推荐你至少上来先把这个目录删了…… 结语小书屋和 epubee 被越南帝国主义的铁拳干烂之后找书本就是一件很困难的事情了，zlib 被美帝国主义的铁拳干烂更是使得困难光景变得雪上加霜。但是在越南，在赛里斯找书最难的环节还不是出了书之后找不到盗版，而是这之前的环节。我等阿尔都塞的《怎么办》、《在哲学中成为马克思主义者》和《马基雅维利的孤独》已经等了一年了，目前看来，在 2022 年里出版已经无望了。 处理Calibre Calibre 就像一个本地版的豆瓣。你把书导入进去之后可以自己编辑标签和评分等信息，书多了之后就可以很方便地根据 “西方马克思主义” 等关键词来检索到特定的书了。 我很多朋友说这个软件不会用，我简单介绍一下这个软件的运行逻辑： 一上来这个软件会要求你选择一个文件夹作为储存数据库的场所，这里可以随便选一个自己记得住的文件夹。那之后所有导入到 Calibre 里的书都会复制到这个文件夹里。软件没了随时可以去官网重新装一份，但是书没了可就糟了，因此最好定期备份这个数据库文件夹，比如说每个月都拷贝到 U 盘里，或者直接用 Onedrive 之类的软件给备份起来。 导入到 Calibre 里面的书会被复制到数据库文件夹里，如果需要作为存档的话，只保留 Calibre 里的那一份就够了，外面的电子书可以直接删掉。 Calibre 希望你只通过软件的窗口对它存储的电子书进行操作，不管是删除也好新增版本也好，最好都在这个软件的窗口里进行操作，而不是绕过这个软件直接去操作文件夹本身 —— 实际上他也不会智能检测文件夹的变化，如果你绕过软件直接增减了文件，这将不会被软件读取出来。 Calibre 以很丑陋的方式储存文件，这也意味着不管是导入还是导出都需要通过软件窗口来进行。如果你不想在拷贝文件给朋友的时候复制出一个 Yu Zhong Zha Ji - An Dong Ni Ao _Ge Lan Xi.pdf 程度的抽象文件名的话，就要用 “保存到磁盘” 这个按钮来让文件以中文方式被输出。 在 Calibre 内双击文件的逻辑为：对于特定格式的文件使用内置的阅读器打开，否则使用系统默认的打开方式。如果像我这样不喜欢 Calibre 内置的阅读器的，可以在设置里修改。 Calibre 内置了许多实用的电子书工具，比如说转换格式和编辑内容。有人抱怨说 epub 的电子书不能用 Kindle 读，实际上 Calibre 直接可以一键转换格式并且推送到 Kindle 上。 压缩与图像增强接下来的三小节我会参照这个帖子来写，实际上这个帖子的内容非常高妙，我推荐读一读。 图像增强和压缩使用 adobe acrobat。 OCROCR 会使得扫描的 PDF 变得可以复制。这里推荐的软件是 ABBYY Finereader，做 OCR 可能是效果最好的。 如果是从上一步过来的，那可以关闭这里处理图像相关的内容，因为实际上都已经在上一步里处理过了。 导出需要选择 PDF/A 来保证兼容性。 为 PDF 添加目录和原帖子一样，为 PDF 添加目录大概是这几步： 将 OCR 后的目录页复制出来 处理这个目录，使之符合特定格式 附加到 PDF 文件上，别忘了设置基准页 不过我这里更推荐使用 PdgCntEditor 这个软件，在上述第二步的时候方便点。 正常处理电子书到这一步就算完成了，甚至上面三小节的内容不搞也没事，不也照样看。然后如果是要在 Kindle 上面看还要再过一个步骤： 重排先用 ABBYY 处理 PDF，把白边切掉，注意区分奇偶页，切的时候把翻译书侧边的原书页码切掉。 然后用 k2pdfopt 这个软件来处理。 参数像我这样设置就行，字体大小可以再慢慢调过，用右边预览功能选个自己喜欢的大小。 这是处理之后的效果 虽然依然无法和 epub 等电子书格式相比。但是至少在 Kindle 上已经达到了能看的标准。 修复 Kindle 破损的封面在某个版本的固件升级之后，Kindle 对于导入的电子书经常会给一个很抽象的错误封面。 使用 Fix Kindle Ebook Cover 这个软件可以修复这个问题。 从这个网站偷的活。 阅读几个我推荐的阅读软件 稻壳阅读器全能型选手。什么格式都能打开，打开速度也很快。对于扫描 PDF 也可以设置护眼背景色。 但是每一种功能用起来都感觉差点意思。 Kindle经典护眼阅读器，推荐和 Calibre 搭配使用。 一个实用的小技巧是更换自己想要的字体，在根目录下新建 fonts 文件夹，然后把想要的字体存进去就行了。我这里推荐霞鹜文楷。 当然有时候会发现特定电子书不能选择字体，这是因为 mobi 文件类型不对，Calibre 默认的是 old，改成 both 就好了。 微信读书提前先用 “传书到手机的功能把文件上传上去，然后就可以在办公室打开浏览器摸鱼了。 就这一点而言，微信读书是无敌的。","link":"/2023/01/17/%EF%BC%88%E8%8A%82%E9%80%89%EF%BC%89%E7%94%B5%E5%AD%90%E4%B9%A6%E4%B8%80%E9%94%AE%E6%91%86%E7%83%82ABC%E2%80%94%E2%80%94%E5%86%99%E5%9C%A8zlib%E8%A2%AB%E8%B5%84%E4%BA%A7%E9%98%B6%E7%BA%A7%E9%93%81%E6%8B%B3%E5%B9%B2%E7%83%82%E4%B9%8B%E9%99%85/"},{"title":"用虚拟卡绑定 OpenAI 付费账号","text":"ChatGPT 或者说 AI 火了之后，基于 OpenAI API的应用层出不穷，从套壳 ChatGPT 网页到一键翻译一键总结一键作图一键写代码，主打一个解放生产力（可能物理）。这些应用一般需要绑定自己的 API key、消耗自己的使用额度，新注册账号有限时的 5 美元额度，如果用完或者过期了，就需要绑定银行卡付费才能用。OpenAI 不给中国提供服务，中国发行的银行卡一概不能用，因此本文就介绍一下申请 Depay 虚拟卡来绑定的过程。 注册 Depay 账号Depay 成立于2021年，是一家为个人提供处理加密货币方式的企业，属于海外国人商家。币圈毕竟还是相对小众，等 ChatGPT 流行之后 Depay 才跟着火了一把，作为门槛最低的虚拟卡之一，几乎所有介绍在中国给 OpenAI 付费的教程都会提到它。 在 Depay 的网站能够查看一些基本信息，注册的话可以下载 App（Android 直接下载 APK，iOS 需要非国区 ID），也可以直接网页注册，愿意的话可以填我的邀请码 349564。若是网页注册，完成后也需要下载 App 才能进行后续操作。 开卡和充值选择什么卡首先要说明的是，Depay 提供的是类似于借记卡的预付卡，需要先充值再消费，以下提到的“额度”指的是单月消费额度而非信用额度。 注册成功后并不会直接发放一张卡，而是还需要手动申请。打开 Depay 的 App 首页就是申请页面，目前可选的卡组织只有 MasterCard，级别包括从 Lite 到黑金五类。Lite 卡和普通卡最大的区别是，前者不需要 KYC（know your customer）实名认证，后者需要。除此之外，各级别还存在开卡费、月费、手续费等不同。 级别 开卡费 月费 额度 充值费用 KYC Lite 10 USDT 2 USD 20,000 USD/月 2% (Min 1 USD) No 标准 0 USDT 1 USD 20,000 USD/月 1.35% Yes 高级 10 USDT 0.5 USD 50,000 USD/月 1.20% Yes 白金 50 USDT 0 USD 200,000 USD/月 1.00% Yes 黑金 活动空投 0 USD 无限额 0.80% Yes 就中国国籍的用户而言，KYC 认证需要上传身份证并录一段人脸短视频。是否愿意把这种程度的隐私信息交给别人、尤其是海外国人商家，取决于各自的意愿，反正我开的是 Lite 卡。但无论如何申请时姓名要填写真实，以便在遇到风控时有申诉的基础。另外， 开了 Lite 卡之后如果进行 KYC 认证，会自动转变为高级卡； 开卡费必须用 USDT 支付，USD 不行（你可以猜到我发生了什么）。 买，提，兑，充作为“一家致力于为个人解决加密货币多场景应用的企业”，Depay 不忘初心，交开卡费或者为卡充值都需要使用 USDT，并且需要多次转账和兑换（也就是吃多次损耗）。我是矿难后才第一次接触加密货币的古墓派，对币圈毫无所知，只会按照教程一步步操作： 买：用法币买加密货币。注册一个交易平台，比如我用的欧易，支持银联微信支付宝。点击买币-快捷买币，然后输入需要的 USDT 数量（由于各种手续费和损耗，第一次充值金额建议比预计所需花费多一点。比如想用标准卡开 20 刀的 ChatGPT Plus，可以先买个 23-25 USDT），然后按交易平台的提示操作，付款后几分钟内到账。**但是！**平台普遍会限制新注册用户的交易，在欧易购买 USDT 后要等24小时才能转出。 提：把 USDT 从欧易提取到 Depay 钱包。打开 Depay App 里钱包-USDT-充币，选择一个主网，记下充值地址。在欧易中点击资产管理-提币，币种选择USDT，方式为链上提现，输入自己 Depay 钱包的充值地址，提现网络一定要选择 Depay 里选择的主网，否则你的钱就蒸发到虚空了。确认好地址、网络和数量之后提交，一般 10 分钟以内会在 Depay 里到账。 兑：把 Depay 钱包里的 USDT 转换为 USD。Depay App 选择钱包-实时兑换，把你需要数量的 USDT 兑换成 USD。虽然理论上这二者应该等价，但无论是用哪个换另一个都会有汇率损失。所以当你需要开通有开卡费的卡时切记不要一股脑全部换完，否则又需要再把对应数量的 USDT 换回来。 充：把 Depay 钱包里的 USD 充进卡里。终于来到了最后一步，上一步兑换完成后确认页面就有一键充值，没注意关闭了也不要紧，在首页点充值也可以，最低 5 USD 起充。充值好后，这张卡片才算真正激活，能够直接看到卡号、持卡人姓名和过期时间，通过邮箱验证码可以查看 CVV。 绑定到 OpenAI Platform 的 Billing 界面绑卡，但 OpenAI 的风控不停升级，很多 IP 即使没有被直接禁止访问，也无法成功绑卡，因此最好首先在这个 IP 风险检查网站检查一下自己的代理 IP，风险在中等以上基本就不用尝试了。风险低又对人品有信心的人，可以尝试浏览器开无痕模式绑定，一次失败了就换 IP 再试，但连续失败四五次之后也不建议继续，避免使自己的账号或卡本身被风控。在这种情况下可以加入 Depay 官方的 Telegram 群，群里有一些官方背书提供收费代绑定服务的人，右上角有 title“500U押金”，可以私聊他们详谈。 绑好之后，还是在 Billing 界面中设置好使用限额，并时常关注已用金额和卡内余额，避免因为余额不足导致付款失败，然后在 API Keys 界面按需生成 key 并保存，就可以尽情使用了！这里推荐几个我关注的应用： 一键搭建自己的 ChatGPT 网页：https://github.com/Yidadaa/ChatGPT-Next-Web 翻译并输出双语电子书：https://blog.amamiyayuuko.com/p/use-chatgpt-for-translation 周报生成器：https://weeklyreport.avemaria.fun/zh 总结 YouTube 视频内容，还可以向细节提问：https://chatyoutube.com 总结 Bilibili/YouTube 视频内容，不过不能提问：https://b.jimmylv.cn 划词翻译、润色和总结：https://github.com/yetone/openai-translator","link":"/2023/04/01/%E7%94%A8%E8%99%9A%E6%8B%9F%E5%8D%A1%E7%BB%91%E5%AE%9AOpenAI%E4%BB%98%E8%B4%B9%E8%B4%A6%E5%8F%B7/"},{"title":"最近干了些啥","text":"改用 Cloudflare Pages；使用 Alist 作为网盘程序；体验了 ChatGPT 的优势项目。 Cloudflare Pages自从放弃 Wordpress 后，本站一直托管在 GitHub Pages。开始一两年左右国内直连的速度还不错，后来干扰严重故使用了 Cloudflare CDN，虽然速度仍极其有限，但对于以文字为主的博客也勉强足够（不过我始终更推荐你直接用白名单模式）。 然而，这样一来就有了一个不大不小的坏处：GitHub Pages 在更新自定义域名的证书时，需要该域名解析到了他们的 IP，而开启 CDN 之后解析到的就是 CF 家的了。每三个月证书过期后，本站就无法访问，只有在我发现之后手动暂时关闭 CDN 才能续期成功。 虽然不是什么大问题，但能懒则懒，反正都是走 CF CDN，干脆直接使用 Cloudflare Pages 算了。当时他们的 Pages 刚推出时也偶尔刷到过消息，但没有特地研究，如今随便一搜排在前面的教程基本也都是那个时候的产物，想直接套用则会遇到另一个问题：Cloudflare 不知道什么时候取消了 Pages 创建项目预设中的 Hexo 模板。然而，我们其实并不需要 Cloudflare Pages 为我们构建网站，因为在本地已经通过 hexo g 生成了需要的静态文件，通过 hexo d 发布到 GitHub 后，Cloudflare Pages 只需要直接复制过去就好了。具体的操作步骤可以参考这篇教程，按其方法部署成功后，便可以取消原域名到 GitHub IP 的解析，换而绑定到 Cloudflare Pages。 这样一来，我们还可以在 GitHub 仓库里取消发布自己的网站并把仓库转为私有，也就避免了 GitHub Pages 强制仓库公开而使得网站源码暴露的问题（虽然大概并没有什么攻击价值）。 当然，回到上面提到的问题，Cloudflare 在大陆的访问速度着实一般。为解决这个问题，我当年尝试过使用 Vercel，但在当时的运营商环境下比 CF 还慢得多，因此没有直接切换，而是用一个次级域名作为备用（改过几次，目前是 https://blog.yizhimengxin.me）。如今再试，结果确实如大家所说非常不错，因此在不久后的将来可能会把主域名迁移到 Vercel，而备用域名保留 CF CDN。不愿用白名单模式、又对优化自己与 CF 之间网络感兴趣的人，可以尝试优选 IP，我在路由器上应用之后效果还算不错。 Alist 和 ChatGPTAlist 绝对是我使用过的提升幸福感程序 TOP 5。它极其强大，能够联通数十种国内外网盘；又十分方便，一键脚本即可部署，后台设置也简明易懂。相比之前使用的 FODI，Alist 界面更美观，权限管理更丰富，播放和下载功能也更加完善。在很早之前我就在使用 AList 了，但一直没有用其取代 FODI 公布在博客上，是因为一键脚本建好之后是很不安全的 IP:5244 的访问形式，而我几次用搜索引擎搜索都没找到简单可操作的绑定域名和申请证书教程。 最近用上 ChatGPT 之后又动了这方面心思。虽然在其他领域的对话表现一般，但想起它擅长写代码的声誉后，我也尝试询问它怎么解决我的问题，然后便得到了根据自身实际情况而适配过后的代码。按其介绍一步步安装 Nginx，编辑 Nginx 配置，用 acme.sh 为域名申请证书，最终实现了一个常规的互联网网站：https://pan.yizhimengxin.me，点击本站右上角的小云即可访问。此外，我还为本站的这一 Alist 添加了 VideoTogether 脚本，你可以尝试和朋友一起远程看视频。","link":"/2023/04/08/%E6%9C%80%E8%BF%91%E5%B9%B2%E4%BA%86%E4%BA%9B%E5%95%A5/"},{"title":"关于《巫师 3 - 血与酒》不同结局的一些看法","text":"最近得空高强度玩游戏，花了好几天通关了年初买的《巫师 3》本体和两个 DLC。这一两天还沉浸在对剧情的回味中，看到别人对《血与酒》结局的讨论，感觉自己也有写点什么的冲动，就在这里谈谈一些想法。以下内容涉及严重剧透，若你在意的话请避免点开。 说说剧情主角/玩家杰洛特接到南方陶森特公国女公爵安娜·亨利叶塔的委托，要清除一只在公国内连续杀人的恶兽。在恶兽杀死第四个人之后，杰洛特发现他是一只高阶吸血鬼狄拉夫，同时出现的另一位高阶吸血鬼、杰洛特的老友雷吉斯向他担保，狄拉夫并不残忍嗜血，他杀人一定有什么原因。经过两人的调查，发现是女公爵被放逐的姐姐、同时也是狄拉夫的前爱人席安娜设计逼迫狄拉夫按自己的指示杀死了这些人。极度愤怒的狄拉夫要求和席安娜单独对质，但安娜拒绝交出姐姐，因此狄拉夫指使大群低级吸血鬼在公国首都鲍克兰开展屠杀。 故事线在这里出现重要分叉，主角/玩家可以选择两条线路，并导向四种结局。在“童话世界”线中，如果从买毒品的小女孩处拿到了席安娜童年时的缎带，又查明计划的第五名受害者就是安娜，并劝说席安娜原谅妹妹，最终姐妹和好，狄拉夫死亡，雷吉斯逃亡，是为结局一；若拿到缎带但未查明真相或未劝说席安娜，最终安娜和席安娜死亡，狄拉夫死亡，雷吉斯逃亡，是为结局二；若没拿到缎带，选择杀死狄拉夫，最终安娜存活，席安娜死亡，狄拉夫死亡，雷吉斯逃亡，是为结局三；若没拿到缎带，选择放过狄拉夫，最终安娜存活，席安娜死亡，狄拉夫存活，雷吉斯无事，是为结局四。选择走“暗影长者”线，只会产生结局二。下面以结局一为背景来提出一些想法。 关于狄拉夫的罪首先，杀死四个骑士并非狄拉夫的罪，这是他以为爱人面临生命危险时的自然选择。这一罪行的承担者是席安娜。 其次，有些人觉得狄拉夫的罪行最主要的是对鲍克兰的屠杀，选择是否放过狄拉夫也首要受到这一事实的影响。但就我个人而言，这场屠杀的来源是正当的愤怒，是发现自己被欺骗和利用、成为前爱人的谋杀工具后的报复心理；而屠杀的对象至少是封建领属关系下的正常选择——对公爵家族成员的愤怒，施放在这个家族的所有物身上：公国和臣民。这场屠杀不是来自对一般意义上的人的恐惧和死亡的嗜血爱好，而是来自愤怒和报复。它仍然是不可接受的，但事出有因。 相比之下，狄拉夫更重要的罪行是事出无因的对朋友雷吉斯的未遂谋杀。雷吉斯全程始终在维护和保护狄拉夫，他前往迪沙谬那的唯一目的是保证席安娜的安全。在试图杀死席安娜失败后，狄拉夫把愤怒转移到雷吉斯身上，但后者对其是无罪的，这是对朋友的背叛，没有理由，不可接受。 最后，他对席安娜的（未遂）谋杀是对席安娜先犯下的罪的报复，正当，合情，但超越了罪刑相当的限度，又进一步犯下了新的罪。 关于爱和宽恕四个人的罪首先谈谈四个（可能）有罪的人。狄拉夫如前所述，不再重复。 安娜的罪：童年时的推卸责任；在姐姐被放逐时的沉默；以及掌权后寻找姐姐至少没有那么竭尽全力。 席安娜的罪：谋杀四个骑士；利用狄拉夫，间接造成屠杀；未遂谋杀妹妹。 雷吉斯的罪：违反吸血鬼律法，杀死同族狄拉夫。 四个人的罚再来谈谈这些罪对应的罚是什么样的，由简到难来说： 雷吉斯：违法吸血鬼的律法，会面临同族人无尽的追杀。但他杀死狄拉夫压根算不上什么罪，相反还是他超越自己的种族，成为一个“人”的明证（不是他成为人类的意思）。因此被迫逃亡是不公正的，但至少尼弗迦德是个开化的地方，没人相信吸血鬼了，他能活得安生一些。 狄拉夫：屠杀的罪是存在的，但不必然适用死刑这一最为严重、无可挽回的刑罚。猎魔人不是大法官，对公国的损害或许，在这个时代，可以交由公国的所有人——光耀的女爵殿下来处理。当然，主角/我或许也愿意聆听他的忏悔，但他自己葬送了这个机会。狄拉夫用爪子刺穿试图控制自己的雷吉斯的那一刻（只有高阶吸血鬼能杀死另一个高阶吸血鬼），对于主角/我而言就宣判了他的死刑（当然这一对无罪之人的背叛和谋杀同时也作用与主角/玩家身上，但主角/我的看法无足轻重——毕竟主角/我是无敌的，愿意放过也就放过了）。因此杀死狄拉夫既是自卫，也是执行公正的刑罚。 安娜：她的罪显然不应受到死刑，因此席安娜杀死她的结局不可接受。在其他情况下，安娜应受到何种惩罚取决于她所犯下罪的对象——席安娜。 席安娜：最为复杂的情况。她谋杀四个骑士，对他们犯下了罪，但这又是因为他们放逐她的过程中并未表现得如同一个骑士，这也是正当的愤怒和复仇，然而手段超出了目的，需要由骑士的主人女爵殿下裁定。利用狄拉夫，间接造成屠杀是对他个人的罪而非对鲍克兰的，因为狄拉夫是完整的智慧生命，只能自己承担屠杀的责任；另一方面狄拉夫希望以死亡作为报复，犯下了新的罪，但没有人能为狄拉夫负责，只能由主角/玩家加以判断和干预。最后，席安娜对妹妹的未遂谋杀，仍然是对先有的罪的报复，并也应由妹妹安娜做出抉择。 爱和宽恕如雷吉斯所说，关于理智和事实可以尽可能详尽，但关于直觉和情感就只能寥寥数语了。 秩序被破坏亟需恢复，而恢复的手段是复仇还是宽恕？放在高中、本科、甚至就三年前的我，肯定会毫不犹豫地认为物理的罚才能抵消犯下的罪。那时的我大概不会在《被伤害的和被侮辱的》最后几章时，在心中苦闷地呐喊“宽恕吧！宽恕吧！”但渐渐说不清什么时候，或许是被宽恕后，我也会并且愿意在这庞然的、难以名状的情感面前下跪（可以把它归结于全知全能的存在，因此如果有一天信教的话我大概会天主东正苏菲三选一；但也可以把它归结于人的自由，所以我大概率还是当一个无神论者）。当然，宽恕只能由被犯下罪行的人作出。 若要宽恕狄拉夫，安娜并不愿意，但主角/玩家不是必须考虑她的意愿；雷吉斯在你死我亡的战斗关头，无法宽恕，因此主角/我选择和他一起战斗，执行刑罚；至于主角/我自己的意愿，如上文所说无足轻重，因为我们不是这个故事里平等的一份子。 要宽恕安娜，席安娜愿意且能够做到。 要宽恕席安娜，安娜愿意且能够做到；狄拉夫不愿意，并且会选择罪刑不相当的报复手段，主角/玩家必须在这里做出抉择。 《血与酒》从头到尾都充满着童话气息，但不会有完美结局，只有不同的人依不同的标准做出的不同选择。 以上是一个走不出陀的人的絮絮叨叨，补充阅读的话可以看看这两个视频： 九十岁老神父为何逮捕耶稣？一个视频看懂宗教大法官（上）| 译者精讲《卡拉马佐夫兄弟》 凭什么说只需要三种力量就可以统治世界？一个视频看懂宗教大法官（下）| 译者亲讲《卡拉马佐夫兄弟》","link":"/2023/11/08/%E5%85%B3%E4%BA%8E%E3%80%8A%E5%B7%AB%E5%B8%883-%E8%A1%80%E4%B8%8E%E9%85%92%E3%80%8B%E4%B8%8D%E5%90%8C%E7%BB%93%E5%B1%80%E7%9A%84%E4%B8%80%E4%BA%9B%E7%9C%8B%E6%B3%95/"},{"title":"Netflix 转区可用的全球干净 IP 和浏览器","text":"已经是前几天的事了，Netflix 又对低价区的跨区使用账号（也有人说不只低价区）发起特别打击行动，早上起来就发现自己埃及区账号被取消了会员资格，当然也没退款。 粗略回想一下，这个账号至少也是从土耳其、阿根廷、巴西、菲律宾和埃及一路走过来的。以前每次换区还得到处找有这些冷门节点且有月付套餐的机场，找到了也不一定能绑上卡、还得先找地方买礼品卡，毕竟机场 IP 谁都知道是怎么一回事。不过现在已经没这种烦恼了，有绝对干净的家宽 IP+指纹浏览器，只要信用卡没问题，基本全球任意不锁卡的区都能绑上。 家宽 IP使用 IPRoyal。注册账号后进入主界面，选择左侧的“Royal Residential”（注意不要选成“Static Residential”了，那个是固定 IP，又贵又不符合需要），创建一个订单，目前最低一次性购买 1 GB 永久流量，花费 7 美元，足够用很久很久。购买完成并设置好代理用户名后，继续在“Royal Residential”中向下翻到代理设置部分，国家选择你需要的国家，地区可选可不选，其他按图中设置即可。 这样就得到了一个 Socks5代理，下方 hostname port username password 四项就是下一步需要的信息。当然，一般裸连境外 Socks5 代理都不太可能，所以需要通过已有的节点中转，最简单的办法就是打开代理软件的系统代理，然后使用下一节的指纹浏览器。 指纹浏览器ChatGPT 对指纹浏览器的介绍： 指纹浏览器通常是指专门设计用来掩盖或更改用户的数字指纹（digital fingerprint）的网页浏览器。在计算机科学中，”数字指纹”或”浏览器指纹”是指能够识别和追踪用户活动的数据集合，主要是通过汇总浏览器的特定信息来实现的。这些信息可能包括用户的操作系统、安装的字体、插件、屏幕分辨率、时区、语言设置等。 在正常情况下，浏览器指纹可以帮助网站提供更好的用户体验，并进行有效的用户跟踪和广告定位。然而，这也引起了一些隐私方面的担忧，因为即使用户在使用私密模式（Incognito Mode）或禁用 cookies 的情况下，也可能会被网站跟踪。 为了对抗这种跟踪，一些专门的浏览器（如 Tor 浏览器）或者浏览器扩展和插件被设计出来，用以改变浏览器传递给网站的信息，减少可识别性，增加用户隐私保护。这些工具和设置方法统称为”指纹浏览器”。使用指纹浏览器时，用户的设备和浏览习惯信息会受到干扰或伪装，使得其在线指纹更加难以识别。 使用指纹浏览器，一是如上节所述简单地利用 IPRoyal 的代理，二也是避免 Netflix 对浏览器的风控造成的奇奇怪怪的问题，相当于一个干净的访问环境。这类产品有很多，我用的是 HubStudio。 安装好后打开软件，选择“新建环境”，名字随意，下方“代理类型”选择“Socks5”，“使用方式”选择“按动态 IP 规则使用”，“代理主机”“代理端口”“代理账号”“代理密码”依次填入在 IPRoyal 里看到的 hostname port username password，然后点击“检查代理”，报错的话先看看自己代理软件的系统代理有没有打开，确认打开了、又用的是机场的话，再去问问是不是现在用的节点禁止了 Socks5 代理转发。 如果没有遇到以上问题，接下来就能顺利打开这个环境（也就是一个浏览器）了。打开之后可以先访问 ipinfo.io，看看现在的 IP 是否如图所示是家宽 ISP 类型，然后就正常去 Netflix 绑卡开会员吧。埃及区被铁拳之后，我现在开的伯利兹区，Premium Plan 每月 7.99 美元，4 人车每人每月 15 元差不多刚好，这么多年过去了物价又回到了一开始土耳其的水平。","link":"/2024/01/16/Netflix%E8%BD%AC%E5%8C%BA%E5%8F%AF%E7%94%A8%E7%9A%84%E5%85%A8%E7%90%83%E5%B9%B2%E5%87%80IP%E5%92%8C%E6%B5%8F%E8%A7%88%E5%99%A8/"},{"title":"质量效应漫画和电影","text":"前段时间终于通关了《质量效应：传奇版》，随之而来的是优秀作品后劲的空虚。 其实二三代已经不知道通过多少次，只有一代当年实在没玩下去。传奇版把一代改得能玩了，去年初买了之后就打上 mod 开始慢慢从头到尾又来一遍。中途因为毕业工作搬家等一堆破事，再加上和别的游戏混完，以及等某 mod 更新三代适配结果最终也没等到，一直到大概上个月才终于通关。 通关之后就是每次看完佳作后的 emo 时刻，然后开始玩《仙女座》——当年刚出时顶着生肉玩到一半，实在不好玩就弃了；这次用三大妈汉化还不如生肉，再加上我的丐版显卡风扇狂转太影响心情，第一个任务都还没做完就半弃了，等天气凉了再试试吧。 放弃游戏本身，还是看看同宇宙其他作品。质量效应小说读过好几次，这次不想看了；又想起本科时候看过的漫画不知道丢哪里去了，以及拍过的相关电影从来没看过，所以找了找，下到了包括仙女座在内的漫画全本，以及关于维加牺牲整个殖民地的平民来获取关于收集者的资料却因为自己的偶像薛帕德直接干爆了收集者基地而导致资料一文不值的《质量效应：迷途楷模》。美日合拍，日漫风格。 漫画在这里，cbr 文件查了下也是一种电子书格式，iOS上我用 Chunky 这个 App 来看。 电影在这里。 P.S. 质量效应原版挺好玩，但是打了 mod 之后更好。如果第一次玩可以先原版通一遍，以后想再玩就去 Nexus 找找喜欢的 mod，毕竟值得玩很多次。","link":"/2024/06/30/%E8%B4%A8%E9%87%8F%E6%95%88%E5%BA%94%E6%BC%AB%E7%94%BB%E5%92%8C%E7%94%B5%E5%BD%B1/"},{"title":"分享两部自己校对字幕的电影","text":"《卡桑德拉大桥》和《列宁在十月》。 我自己老电影比新电影看得多，但老电影的字幕资源比较少，同时由于版本匹配的原因，即使找到了时间轴往往又有错位。我很难接受对付着看，因此基本会自己校对调整一遍时间轴。 这次分享的两部电影的字幕都是这么处理过的，其中《卡桑德拉大桥》花的精力多一些，基本没任何问题；《列宁在十月》搞得比较随意，有些很短的、一两个单词的字幕给的时间太短了，看的时候会一闪而过，好在数量不算太多。另外它是英语字幕，因为找到的字幕里英语版的时间轴偏移最小，调起来最方便。 P.S. 《列宁在十月》真是 propaganda 电影的样板，脸谱化、神像化很成功，并且明明白白地为当下政治服务。全片看下来印象是：作为半神的列宁（注意：不能是真神，必须是可爱的、近似神的人），忠诚的、可靠的、能力排第二的斯大林，大叛徒大内奸大工贼季诺维耶夫 &amp; 加米涅夫，形形色色的、分别代表自己阶级的立宪民主党、社会革命党、孟什维克等反派。影片结尾斯大林走上台站在列宁身边的过程很沉默，但跟明说“我就是正统接班人”也没任何区别。 P.P.S. 关于这点，过去有一些想法： 关于过去的历史叙述和合法性叙述：后者是纵向地从现在推出过去，因为现在如此所以要找到过去的如此，如韶山火车站《开国大典》和《毛主席出韶山》两幅画；前者是横截面地切出一个历史时期，看重并置、复调和复杂性 —— 早期中共的历史不是毛泽东一人所能涵盖。形象化比喻如开局五条线齐头并进，其中四条在历史中散失了，只有一条延续到最后。历史叙述框选前期的五条线，合法性叙述按图索骥从现在把握过去。","link":"/2025/02/01/%E5%88%86%E4%BA%AB%E4%B8%A4%E9%83%A8%E8%87%AA%E5%B7%B1%E6%A0%A1%E5%AF%B9%E5%AD%97%E5%B9%95%E7%9A%84%E7%94%B5%E5%BD%B1/"}],"tags":[{"name":"Android","slug":"Android","link":"/tags/Android/"},{"name":"App","slug":"App","link":"/tags/App/"},{"name":"教程","slug":"教程","link":"/tags/%E6%95%99%E7%A8%8B/"},{"name":"PC","slug":"PC","link":"/tags/PC/"},{"name":"web","slug":"web","link":"/tags/web/"},{"name":"博物馆","slug":"博物馆","link":"/tags/%E5%8D%9A%E7%89%A9%E9%A6%86/"},{"name":"天文","slug":"天文","link":"/tags/%E5%A4%A9%E6%96%87/"},{"name":"VPS","slug":"VPS","link":"/tags/VPS/"},{"name":"羊毛","slug":"羊毛","link":"/tags/%E7%BE%8A%E6%AF%9B/"},{"name":"Netflix","slug":"Netflix","link":"/tags/Netflix/"},{"name":"娱乐","slug":"娱乐","link":"/tags/%E5%A8%B1%E4%B9%90/"},{"name":"Telegram","slug":"Telegram","link":"/tags/Telegram/"},{"name":"博客","slug":"博客","link":"/tags/%E5%8D%9A%E5%AE%A2/"},{"name":"软件","slug":"软件","link":"/tags/%E8%BD%AF%E4%BB%B6/"},{"name":"SIM","slug":"SIM","link":"/tags/SIM/"},{"name":"旅行","slug":"旅行","link":"/tags/%E6%97%85%E8%A1%8C/"},{"name":"音乐","slug":"音乐","link":"/tags/%E9%9F%B3%E4%B9%90/"},{"name":"网络","slug":"网络","link":"/tags/%E7%BD%91%E7%BB%9C/"},{"name":"游戏","slug":"游戏","link":"/tags/%E6%B8%B8%E6%88%8F/"},{"name":"-娱乐","slug":"娱乐","link":"/tags/%E5%A8%B1%E4%B9%90/"}],"categories":[{"name":"分享","slug":"分享","link":"/categories/%E5%88%86%E4%BA%AB/"},{"name":"搞机","slug":"搞机","link":"/categories/%E6%90%9E%E6%9C%BA/"},{"name":"杂谈","slug":"杂谈","link":"/categories/%E6%9D%82%E8%B0%88/"},{"name":"投稿","slug":"投稿","link":"/categories/%E6%8A%95%E7%A8%BF/"},{"name":"转载","slug":"转载","link":"/categories/%E8%BD%AC%E8%BD%BD/"}],"pages":[{"title":"关于","text":"大一时候建的小站，现在偶尔写点有的没的。","link":"/about/index.html"}]}